{"title": "Super Heavy-Starship climbs high but falls short on second test flight", "link": "https://spaceflightnow.com/2023/11/18/super-heavy-starship-climbs-high-but-falls-short-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX’s gargantuan Super Heavy-Starship, the most powerful rocket ever built, blasted off on its second test flight Saturday and while the initial stages of the mission went smoothly, the first stage broke apart moments after separation from the Starship upper stage, which then blew itself up as it neared space. ", "body": "SpaceX’s gargantuan Super Heavy-Starship, the most powerful rocket ever built, blasted off on its second test flight Saturday and while the initial stages of the mission went smoothly, the first stage broke apart moments after separation from the Starship upper stage, which then blew itself up as it neared space. Viewed as a successful learning experience by SpaceX, it was the second failure in a row to get the Starship upper stage into space, a frustrating disappointment for Elon Musk’s rocket company and a potentially major setback for NASA, which is counting on the Starship to carry Artemis astronauts to the surface of the moon in the next few years. While SpaceX’s philosophy is to fly frequently, learn from mistakes and fly again, NASA will require a long string of successful missions before the agency will deem it safe to put astronauts aboard. SpaceX will no doubt resolve the issues that derailed Saturday’s flight, but every delay poses a threat to NASA’s moon landing timeline. But SpaceX, at least, viewed the launching as more of a success than a failure. “Congratulations to the entire SpaceX team on an exciting second integrated flight test of Starship!” the company posted on X. “Starship successfully lifted off under the power of all 33 Raptor engines on the Super Heavy booster and made it through stage separation” Shattering the morning calm at SpaceX’s Boca Chica launch site on the Texas Gulf Coast, the Super Heavy’s 33 methane-burning Raptors ignited with a torrent of flame at 8:03 a.m. EST, instantly engulfing the rocket in billowing clouds of dust and steam. Gulping more than 40,000 pounds of methane and liquid oxygen per second, the 397-foot-tall rocket slowly climbed skyward, thrilling thousands of area residents, tourists and journalists who looked on from nearby South Padre Island. The launching came nearly seven months after an April 20 maiden test flight ended in a spectacular conflagration four minutes after liftoff, triggered by multiple first stage engine failures, problems separating the Starship from the Super Heavy and a catastrophic tumble. Maximum altitude: 24 miles. The second time around, the rocket got farther and several of the systems that derailed the first test flight appeared to work normally. All 33 Raptor engines powering the first stage fired throughout the boost phase of the flight and a new “hot staging” system, in which the Starship’s engines ignited before separation, work as designed. Moments after separation, the first stage flipped around and began lining up for a planned controlled splashdown in the Gulf of Mexico,, closer to the Texas coast. But moments later, it suddenly broke apart, possibly due to stresses imposed by the hot-staging technique. The Starship, however, continued the climb toward space on the power of its six Raptor engines. All went well until about eight-and-a-half minutes into the flight when controllers lost contact with the rocket. The vehicle had disappeared from view in long-range tracking cameras by that point, but a sudden, shimmering disturbance in the atmosphere may have been a sign of the rocket’s destruction. “We have lost the data from the second stage,” reported SpaceX engineer John Insprucker. SpaceX founder Elon Musk could be seen huddling with flight controllers, looking at computer monitors to get a sense of what might have happened. Moments later, Insprucker said “the automated flight termination system on the second stage appears to have triggered very late in the burn as we were headed downrange out over the Gulf of Mexico.” It’s not yet known why the Super Heavy booster broke apart or why the Starship upper stage apparently failed just before or after engine shutdown. But SpaceX commentators said the primary goal of the flight, testing the hot-staging systen for separating the upper and lower stages, appeared to work as planned. Likewise, all 33 Raptor engines in the Super Heavy and the six powering the Starship appeared to fire normally for as long as the vehicles were visible. How other upgrades implemented in the wake of the April failure performed Saturday remains to be seen. NASA is spending billions for a variant of the Starship to carry Artemis astronauts back to the surface of the moon. SpaceX is counting on the rocket to vastly expand its fleet of Starlink internet satellites and to power eventual low-cost government and commercial flights to the moon, Mars and beyond in keeping with founder Elon Musk’s drive to make humanity a “multi-planet species.” Multiple test flights will be needed to demonstrate the reliability required for astronaut flights and it’s not yet clear how long that might take. While Saturday’s launch was far from a complete success, it did demonstrate solid engine performance and successful stage separation. In the April flight, the pad was seriously damaged, the Super Heavy suffered multiple premature engine shutdowns, the stage separation system did not work and the rocket’s self-destruct system took longer than expected to activate. The rocket reached a maximum altitude 24 miles, well below the 50-mile altitude NASA considers the “boundary” of space, before tumbling back toward Earth and exploding in a fireball of burning propellant. The Federal Aviation Administration investigated the failure and cited “multiple root causes of the … mishap and 63 corrective actions SpaceX must take to prevent mishap reoccurrence.” Musk said the company implemented “well over a thousand” changes” to improve safety and performance. The company finally received the required FAA launch license earlier this week after a final review of the rocket’s possible impact on area wildlife. Along with hot staging, SpaceX added a powerful water deluge system to the launch pad to reduce the acoustic shock of engine ignition and the effects of their combined thrust. During the April launch, the base of the pad was heavily damaged, with steel and concrete debris blasted into the surrounding area. Other major upgrades include the replacement of hydraulic actuators with an electrically-driven engine steering system and an improved, faster-acting self-destruct system. Musk believes the Super Heavy-Starship will open a new era in space transportation. It is by far the largest, most powerful rocket ever built, standing 40 stories tall and tipping the scales at more than 11 million pounds when fully loaded with propellants. Burning methane with liquid oxygen, the rocket is capable of generating a staggering 16.7 million pounds of thrust, more than twice the power of NASA’s Space Launch System moon rocket and the legendary Apollo-era Saturn 5. The Super Heavy first stage alone stands 230 feet tall while the Starship upper stage, designed to carry cargo, passengers or both, towers another 164 feet and is equipped with six Raptor engines of its own. It is capable of lifting up to 150 tons of cargo to low-Earth orbit. Getting the Super Heavy-Starship flying on a regular basis is critical to NASA’s Artemis moon program. NASA gave SpaceX a $2.9 billion contract in 2021 to develop a variant of the Starship upper stage to carry astronauts down to the lunar surface in the next two to three years. To send a Starship to the moon, SpaceX must first refuel it in low-Earth orbit, robotically transferring thousands of gallons of super-cold cryogenic propellants carried up by multiple Starship “tankers.” The number of tankers required is not yet known, but senior NASA managers have said more than a dozen will be needed for each Starship sent to the moon. NASA’s contract requires one unpiloted lunar test flight before astronauts will make a landing attempt. Artemis managers continue to officially target late 2025 for the first lunar landing with astronauts on board, but that’s not remotely feasible given SpaceX’s pace developing the Starship system. It’s also not known when SpaceX might be ready to launch paying customers aboard the new rocket. NASA’s moon program aside, at least three all-civilian missions have been booked to date. Billionaire Jared Isaacman, who charted the first private Crew Dragon flight to low Earth orbit in 2019, plans to be aboard for the first piloted orbital flight of a Starship as part of his Polaris Dawn program. Japanese billionaire Yusaku Maezawa, who paid the Russians for a visit to the International Space Station in 2021, also has chartered a Starship flight — “Dear Moon” — to carry him, an assistant and 10 artists and influencers on a privately funded around-the-moon voyage. A third civilian Starship flight carrying 12 passengers, including space station veteran Dennis Tito and his wife, also has been booked. Tito paid the Russians an estimated $20 million for a visit to the International Space Station in 2001 and says he can’t wait to get back into space and share the experience with his wife. It’s not known what SpaceX might be charging for a privately chartered Starship flight. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches more than a hundred payloads on Falcon 9 mission from Vandenberg", "link": "https://spaceflightnow.com/2023/11/11/live-coverage-spacex-to-launch-90-payloads-on-transporter-9-falcon-9-mission-from-vandenberg/", "date": "November 11, 2023", "description": "A SpaceX Falcon 9 launched from Vandenberg Space Force Base in California on a rideshare mission to low Earth orbit with a multitude of small payloads. The Transporter-9 mission lifted off into a clear blue sky at 10:49 a.m. PST (18:49 UTC).", "body": "For the fourth time in 2023, SpaceX launched a smallsat rideshare mission to low Earth orbit with a multitude of payloads. The Transporter-9 mission lifted of at the opening of a 55-minute window at 10:49 a.m. PST (18:49 UTC) from Vandenberg Space Force Base in California. SpaceX said the launch included 113 payloads, 90 of which were deployed directly from the Falcon 9 rocket. The other 23 satellites will deploy from orbital transfer vehicles at a later time. Spaceflight Now will provide in our Launch Pad Live stream. The plurality of the payloads came from Earth observation company, Planet Labs PBC. The San Francisco-based company sent up 36 more of its SuperDove satellites, which add to a roster of more than 200 currently on orbit. It also launched a technology demonstration satellite called “Pelican-1,” which will “host Planet’s next generation of imaging sensors, to be deployed as part of the Pelican and Tanager constellations.” The mission comes at the end of a week where SpaceX launched a batch of Starlink satellites and a cargo resupply mission to the International Space Station. It also comes a day before the company prepares to launch two more satellites on behalf of Luxembourg-based satellite company, SES. The Transporter-9 mission lifted off into a clear blue sky from Space Launch Complex 4 East (SLC-4E). The first stage booster, tail number B1071, returned to Vandenberg for a touchdown at Landing Zone 4 (LZ-4). It was the 12th mission for B1071 after flying Transporter-8, two missions for the National Reconnaissance Office, NROL-87 and NROL-85, German radar-imaging satellite SARah-1, the NASA-French ocean research satellite SWOT, plus six Starlink delivery flights. Starting just over 54 minutes into the mission, SpaceX started deploying the rideshare payloads, starting with a batch of 11 payloads manifested by German company, Exolaunch. First up was one of three satellites from Canadian company, : GHGSat-C9 “Juba.” It along with GHGSat-C10 “Vanguard” and GHGSat-11 “Elliot” were named after the children of company employees and are designed to monitor emissions. The company claims that GHGSat-10 will become “the world’s first commercial CO2 monitoring payload.” Also onboard the flight was Djibouti-1A, a satellite designed to “transmit data by the meteorological station of the Djibouti Center for Study and Research (CERD) to the Missions Control Center located in Djibouti, and provide the necessary tools to keep track of the changes in water resources by providing country-wide, real-time data,” according to the publican . The final payload to deploy deploy, nearly and hour-and-a-half into the mission, was FalconSAT-X, a satellite developed by the U.S. Air Force Academy. The Air Force describes the FalconSAT program as “as an academic platform for an array of aerospace industry and Defense Department experiments.” A team of 18 Argentine engineers is quarantining in Florida this week after arriving from Buenos Aires, observing coronavirus health restrictions before beginning operations at Cape Canaveral next week to ready Argentina’s second radar Earth observation satellite for liftoff as soon as July 25 on a SpaceX Falcon 9 rocket. A Falcon 9 rocket loaded with 58 more broadband relay nodes for SpaceX’s Starlink Internet network took off Tuesday from Cape Canaveral, bringing the total number of Starlink craft launched since May 2019 to 653 satellites. After several delays earlier this week, SpaceX conducted a hold-down test-firing of a Falcon 9 rocket at Cape Canaveral Friday evening in a key test before launch next week on a resupply mission to the International Space Station. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX Falcon 9 rocket launches 3rd pair of O3b mPOWER satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/11/12/live-coverage-spacex-falcon-9-rocket-to-launch-3rd-pair-of-o3b-mpower-satellites-from-cape-canaveral/", "date": "November 12, 2023", "description": "The launch of the SES O3b mPOWER satellites a day after the Transporter-9 rideshare mission from California. The Boeing-built O3b mPOWER 5&6 satellites launched from Space Launch Complex 40 (SLC-40) at the start of the 89-minute window that opened at 4:08 p.m. EST (2108 UTC). ", "body": "SpaceX successfully launched its Falcon 9 rocket to begin the mission. The satellites will start being deployed around 6:08 p.m. EST (2308 UTC). On its second Falcon 9 mission of the weekend, SpaceX will launch a pair of internet-providing satellites for Luxembourg-based company, SES. Liftoff from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station is planned during an 89-minute window that opens at 4:08 p.m. EST (2108 UTC). According to the 45th Weather Squadron’s launch weather forecast, there is a 70 percent chance of favorable weather at liftoff with cumulus clouds being the main watch item. Should the launch slip to Monday, weather deteriorates to the point that there would only be 40 percent favorable weather. Spaceflight Now will have starting about an hour before liftoff. This is the third launch of the Boeing-built O3b mPower satellites for SES. O3b means “Other 3 billion,” in reference to the billions of people around the world without access to consistent, reliable internet service. The first two O3b mPOWER satellites launched on Dec. 16, 2022, followed by the second pair on April 28, 2023. The satellites operate in a medium Earth orbit (MEO), roughly 8,000 kilometers above the Earth. SES said in an its Year-to-Date (YTD) 2023 results statement that commercial service from the O3b mPOWER 5&6 satellites is anticipated in early second quarter of 2024, a delay from the end of 2023. The launch of the third pair of satellites for the O3b mPOWER constellation comes at a challenging time for SES. Among the first four satellites that launched, there have been “an increased number of sporadic power module switch offs… including a few non-recoverable events,” according to the company. Boeing and SES have been examining the root causes and mitigation possibilities for those satellites, which have already launched. As these investigations have been going on, the launch of the third pair of O3b mPOWER satellites was delayed multiple times throughout 2023. “We have identified the causes of the power module issues with the initial 4 satellites in orbit and have now put in place a plan to address those issues,” said Roy Pinto, the CEO of SES, in a statement accompanying the YTD 2023 results filing. The O3b mPOWER satellites have more than 4,000 beams per satellite that are adjustable to focus bandwidth for high-demand areas. That’s compared to the original O3b satellites, built by Thales Alenia Space, which only had 10 beams per spacecraft. “It has been determined that the anticipated operational life and available capacity of the initial O3b mPOWER satellites will be significantly lower than previously expected,” SES said in its financial filing. “SES has secured firm commitments from Boeing and both companies are closely collaborating to deliver the full lifecycle capabilities of the constellation.” Part of that commitment is that the remaining satellites under contract, numbers 7 through 11, will receive new upgrades and two more satellites will be added to the constellation. That will bring the O3b mPOWER constellation up to a total of 13 satellites, compared to the 20 in the original O3b constellation. SES has not specified what the upgrades will look like or how extensive they may be. Getting six of the O3b mPOWER satellites up to MEO has been a priority for SES not only to begin the service as quickly as possible, but also to receive a fiscal incentive from the Federal Communications Commission (FCC). Like other satellite internet operators, like Intelsat and SpaceX, SES needs to vacate the C-band spectrum that was auctioned off to 5G wireless operators. The company had to meet a Dec. 5 deadline in order to receive a $3 billion payment. “I am delighted to confirm that we have now collected the full $3 billion (pre-tax) in accelerated relocation payments from Phase II U.S. C-band clearing,” Pinto said. “With the clearing completed ahead of schedule, we have fully delivered on the objectives of enabling accelerated deployment of 5G services in the U.S., protecting the critical broadcast services delivered by our customers, and realizing significant value creation for SES.” SES said it has a contract backlog of €4.7 billion (about $5 billion), which includes a $830 million for SES-17 (launched Oct. 24, 2021) and O3b mPOWER combined. The launch of the next pair of O3b mpOWER satellites is targeting the back half of 2024. Satellites 9, 10 and 11 are expected to launch in 2025 with 12 and 13 launching in 2026. Stormy weather across Florida’s Space Coast forced SpaceX to call off the long-awaited launch of two astronauts aboard the company’s Crew Dragon spacecraft, the first piloted flight to orbit from U.S. soil in nearly nine years. Forecasters expect good weather on Florida’s Space Coast for liftoff of a Falcon 9 rocket early Tuesday with an Indonesian communications satellite. SpaceX launched a Falcon 9 rocket from Vandenberg Space Force Base, California, with 51 small satellites, hosted payloads, and orbital transfer vehicles heading into polar orbit on the Transporter 7 mission. Liftoff occurred at 11:48 p.m. PDT Friday (2:48 a.m. EDT; 0648 UTC Saturday). © 1999-2023 Spaceflight Now Inc "}
{"title": "FAA clears SpaceX for second Super Heavy-Starship test flight", "link": "https://spaceflightnow.com/2023/11/16/faa-clears-spacex-for-second-super-heavy-starship-test-flight/", "date": "November 16, 2023", "description": "SpaceX’s huge Super Heavy-Starship rocket has been cleared for a second test flight in an attempt to boost the unpiloted Starship upper stage into space for the first time, the company announced Wednesday. On Thursday Elon Musk announced the launch has slipped to Saturday to replace a grid fin actuator. ", "body": "Update (2:30 p.m. EST Thurs. Nov. 16, 2023): Launch delayed to Saturday to replace grid fin actuator. Launch window also shortened to 20 minutes. SpaceX’s huge Super Heavy-Starship rocket has been cleared for a second test flight Friday in an attempt to boost the unpiloted Starship upper stage into space for the first time, the company announced Wednesday. The Federal Aviation Administration granted SpaceX the required launch license Wednesday, clearing the way for liftoff nearly seven months after the rocket suffered multiple failures and blew itself up during its maiden flight in April. Since then, SpaceX has implemented what company founder Elon Musk said were “well over” 1,000 upgrades and improvements and carried out 63 FAA-mandated “corrections” designed to improve flight safety and performance. “The (launch) license applies to all phases of the proposed operation,” the FAA said in a statement. “After consultation with the U.S. Fish and Wildlife Service and a written evaluation of the 2022 Programmatic Environmental Assessment, the FAA concluded there are no significant environmental changes.” The Super Heavy’s liftoff from SpaceX’s Boca Chica flight test facility on the Texas Gulf Coast is targeted for 8 a.m. EST Friday, the opening of a two-hour window. The goal of the flight is to send the Starship on a looping trajectory around the planet before re-entry and splashdown in the Pacific Ocean north of Hawaii. The 30-foot-wide Super Heavy-Starship is the largest, most powerful rocket ever built, standing 397 feet tall and tipping the scales at more than 11 million pounds when fully fueled. The 33 Raptor engines in the Super Heavy first stage are capable of generating 16 million pounds of thrust at full throttle — roughly twice the power of NASA’s Space Launch System moon rocket, currently the world’s most powerful. A successful flight test would mark a major milestone for both SpaceX and for NASA, which is spending billions for a variant of the Starship upper stage to carry Artemis astronauts from lunar orbit down to the surface of the moon. SpaceX is counting on the rocket to vastly expand its constellation of Starlink internet satellites and to power eventual low-cost government and commercial flights to the moon, Mars and beyond. Multiple test flights will be needed to demonstrate the reliability required for astronaut flights and it’s not yet clear how long that might take. In its maiden flight, the Super Heavy-Starship launch pad was heavily damaged. Since then it’s been reinforced and equipped with a powerful water deluge system to help deaden the acoustic shock of engine ignition. A new “hot staging” technique was implemented to begin firing the Starship upper stage’s six Raptor engines while still attached to the Super Heavy first stage. The traditional technique — engine ignition after separation — failed to work properly during the first flight. The Super Heavy also was equipped with a more robust electronic steering system to move, or gimbal, engine nozzles as needed to maintain the proper trajectory. And the rocket’s self-destruct system was upgraded to make sure it will act promptly if needed. The new staging system will be put to the test about two minutes and 40 seconds after liftoff when the first stage engines begin shutting down after boosting the rocket out of the dense lower atmosphere. The Starship’s six Raptors will ignite while the upper stage is still attached to the booster, using a new vent system to deflect the exaust away from the first stage. The Starship should separate from the Super Heavy moments later and continue the climb to space. While designed to be fully reusable, the Super Heavy first stage will not be recovered. Instead, it will carry out rocket firings to slow down as if it was heading for a landing pad, but will fall tail first into the Gulf of Mexico instead. The Starship’s engines, meanwhile, will continue firing for another five minutes of so. Then it’s expected to coast around the planet, falling back into the discernible atmosphere about one hour and 20 minutes after launch. Like the first stage, the Starship is designed to be reusable, but no recovery is planned for this initial test flight. The trajectory will carry the Starship to a Pacific Ocean impact north of Hawaii. As SpaceX sums up the countdown on the company’s web site: “Excitement guaranteed.” © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches Falcon 9 rocket from Cape Canaveral with 23 Starlink satellites", "link": "https://spaceflightnow.com/2023/11/18/live-coverage-spacex-to-launch-falcon-9-rocket-from-cape-canaveral-with-23-starlink-satellites/", "date": "November 18, 2023", "description": "A Falcon 9 rocket is to launch tonight with another batch of satellites for SpaceX’s Starlink internet service. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 11:15 p.m. EDT (0415 UTC). ", "body": "Successful liftoff of the Falcon 9 rocket and landing of the Falcon 9 first stage booster. A Falcon 9 rocket is to launch tonight with another batch of satellites for SpaceX’s Starlink internet service. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 12:05 a.m. EDT (0505 UTC). The 45th Weather Squadron in a forecast issued Thursday, predicted a 60-percent chance of acceptable conditions for launch. After days of wet and windy weather, skies cleared briefly Friday before foggy conditions descended on the Space Coast after sunset. Spaceflight Now’s began about an hour before liftoff. The Falcon 9 carried 23 second-generation V2 mini satellites and headed on a south-easterly trajectory after launching from Space Launch Complex 40 at Cape Canaveral. Following stage separation, about two and half minutes into flight, booster 1069, which is making its 11th flight, landed on the drone ship “Just Read the Instructions” which will be stationed about 420 miles (675 km) downrange in the Atlantic east of the Bahamas. This was SpaceX’s 54th Starlink delivery mission in 2023 and the company’s 84th orbital launch of the year. If all goes according to plan, the satellites, will be released into orbit an hour and five minutes after liftoff. SpaceX announced early this year it had signed up over two million subscribers in more than 60 countries for its Starlink internet service. It’s a busy weekend for SpaceX with the second test flight of its new Starship vehicle scheduled for 7 a.m. CST (8 a.m. EST (1300 UTC) and an additional 22 Starlink satellites due to launch from Vandenberg Space Force Base in California Saturday night. Liftoff of the Starlink 7-7 mission from Space Launch Complex 4E is scheduled for 10:55 p.m. PST (1:55 a.m. EST/0655 UTC). The investigation into a dramatic Falcon 9 rocket explosion earlier this month at Cape Canaveral has determined a “large breach” in the launcher’s upper stage helium pressurization system led to the destruction of the booster and its $200 million satellite payload, SpaceX said Friday. A communications satellite developed in a public-private partnership between Luxembourg government and SES is set for launch Tuesday aboard a previously-flown SpaceX Falcon 9 booster from Cape Canaveral, ready for a 15-year mission beaming encrypted, jam-resistant signals for security and military forces across Europe, Africa and the Middle East. SpaceX’s Falcon 9 rocket is set for liftoff from Cape Canaveral on Tuesday, heading due east over the Atlantic Ocean to deliver the Hispasat 30W-6 communications satellite into orbit around 33 minutes later. © 1999-2023 Spaceflight Now Inc "}
{"title": "Live Coverage: SpaceX to launch Starship/Super Heavy Booster on second test flight", "link": "https://spaceflightnow.com/2023/11/18/live-coverage-spacex-to-launch-starship-super-heavy-booster-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX is counting down for the second test flight of its mammoth Starship launch vehicle. Liftoff from Starbase in Texas is scheduled for 7 a.m. CST / 8 a.m. EST (1300 UTC). If all goes according to plan the Starship will travel around the world before splashing down in the Pacific near Hawaii. ", "body": "Our live webcast from Starbase, Texas, will get underway at 5 a.m. CST / 6 a.m. EST / 1300 UTC. Our coverage of the countdown and launch is brought to you in partnership with our colleagues at LabPadre. © 1999-2023 Spaceflight Now Inc "}
{"title": "Capitol Hill budget battle may limit initial funding of some National Security Space Launch missions", "link": "https://spaceflightnow.com/2023/11/08/capitol-hill-budget-battle-may-limit-initial-funding-of-some-national-security-space-launch-missions/", "date": "November 8, 2023", "description": "Among the 21 missions set to be ordered in the fifth year of Phase 2 task orders, only eight are anticipated to be ordered under a continuing resolution. ", "body": "The U.S. Space Systems Command revealed the details of its latest batch of launch contracts for national security missions shared between United Launch Alliance and SpaceX. This marks the fifth and final year of the Phase 2 National Security Space Launch (NSSL) Service Task Order awards has been issued. It also sets the stage for more launch companies to join in the mix in the future. NSSL missions help protect U.S. assets both in orbit as well as on the ground. They also host technology demonstrations and advancements in various defense capabilities. However, financial uncertainty on Capitol Hill means that not all of the proposed missions may get funding for some time, including a demonstration of a nuclear thermal rocket. Among the 21 missions that have been assigned to ULA and SpaceX, only eight are anticipated to be ordered under a continuing resolution scenario, according to the U.S. Space Systems Command: ULA SpaceX The Space Development Agency’s (SDA) T1TL-F mission is the sixth and final mission of the Tranche 1 Transport Layer launches, which “will provide assured, resilient, low-latency military data and connectivity worldwide to the full range of warfighter platforms,” according to SSC. T1TR-A and T1TR-E are the two final Tranche 1 Tracking Layer launches, which “provide global indications, warning, tracking, and targeting of advanced missile threats, including hypersonic missile systems.” The launch sites for the eight missions are split evenly between the Eastern Range in Florida and the Western Range in California and will use ULA’s forthcoming Vulcan rocket and SpaceX’s Falcon 9 rocket. As far as how these eight missions were chosen to be the ones likely recommended for funding through the continuing resolution, Maj. Christopher Box, the SSC chief of Phase 2 Launch Service Procurement told Spaceflight Now that, “These are the first eight missions expected to launch chronologically.” Currently, the federal government is being funded by a short-term continuing resolution that was passed on Sept. 30 to avoid a government shutdown but it will expire on Nov. 17, once again raising the prospect of a shutdown. In order to fully fund the government through fiscal year (Oct. 1, 2023 through Sept. 30, 2024), Congress needs to pass 12 appropriation bills. As of Tuesday, , three bills have passed the Senate from a bipartisan so-called “minibus” package and House Republicans have passed seven partisan bills. Like in September, Congress could pass another continuing resolution while they hammer out the appropriations bills for the full FY24 budget, but a consensus has yet to be reached. On Oct. 31, SSC announced the planned 21 missions that will close out the NSSL Phase 2 Launch Service Procurement. This collection of launch contracts was first announced back on Aug. 7, 2020, when the Space and Missile Systems Center (officially renamed SSC on Aug. 13, 2021) when the two Firm-Fixed-Price, Indefinite Delivery Requirement contracts were awarded to ULA and SpaceX in a roughly 60-40 split. “Over the five-year Phase 2 contract, we will have ordered a total of 48 missions, a significant increase over the 34 missions originally estimated leading up to Phase 2,” said Brig. Gen. Kristin Panzenhagen, program executive officer, Assured Access to Space, in a statement.  “The increase in launch tempo is a clear reminder of how vital space-based capabilities are in providing our warfighters and our nation’s decision-makers with the information needed to stay ahead of and to deter adversarial forces.” Following the assigned concurrent with the Phase 2 announcement, SSC went on to assign four missions for , eight missions for , 12 missions for and 21 missions for . The price tag of all the planned mission is approximately $5.6 billion with roughly $3.1 billion awarded to ULA and $2.5 billion awarded to SpaceX. When the Phase 2 contracts were first announced in 2020, Dr. William Roper, Assistant Secretary of the Air Force for Acquisition, Technology and Logistics, said at the time that it was a “groundbreaking” advancement in launch procurement alongside the National Reconnaissance Office. “Maintaining a competitive launch market, servicing both government and commercial customers, is how we encourage continued innovation on assured access to space,” Roper said in a statement at the time. “Today’s awards mark a new epoch of space launch that will finally transition the Department off Russian RD-180 engines.” All of the Phase 2 missions granted to ULA using its forthcoming Vulcan rocket. However, the USSF-51 mission, which was awarded in 2020 for Vulcan, will instead be flown using an Atlas 5 rocket due to delays with the debut of Vulcan. That will launch no earlier than 2024. Our inaugural is now outfitted with both of its GEM 63XL solid rocket boosters that will provide extra thrust at liftoff for the mission to launch a commercial lunar lander to the Moon and a memorial payload into deep space. Launch is targeted for Dec. 24! — ULA (@ulalaunch) The final batch of Phase 2 missions will see three Vulcan rockets launch from Vandenberg Space Force Base, a capability that is still in development. There will also be three launches for SpaceX using its Falcon Heavy rocket, including to support a next generation GPS satellite. The GPS 3 Follow-On (GPS 3F) series of satellites feature upgrades like Regional Military Protection Capability and a new search and rescue payload. Lockheed Martin was in September 2018 to build up 22 of the GPS 3F satellites for a total contract value of up to $7.2 billion, with the first dubbed GPS 3F SV (Space Vehicle) 11. Most recently, SSC opted for its to procure SVs 18, 19 and 20 for about $774 million. Also in the mix is Defense Advanced Research Projects Agency’s (DARPA) Demonstration Rocket for Agile Cislunar Operations (DRACO), designated mission USSF-25. It will demonstrate the abilities of a nuclear thermal rocket in space, powered by high-assay low enriched uranium (HALEU), which researchers believe will have two to three times the efficiency of a typical combustion engine. The U.S. Nuclear Regulatory Commission as “uranium enriched so that the concentration of the fissile isotope uranium-235 (U-235) is between 5% and 20% of the mass of uranium.” That mission is expected to launch in March 2027, according to a presentation by Tabitha Dodson, the DRACO program manager, during the von Braun Space Exploration Symposium last month. The SSC confirmed that it will launch on a Vulcan rocket. 10/ This is an overview of the flight profile.👇🏾 — Will Robinson-Smith🚀 (@w_robinsonsmith) Another new technology will launch with the USSF-95 mission onboard another Vulcan rocket. That will be the first launch of a prototype Missile Track Custody satellite, which SSC said, “will evaluate the ability of various Next Generation Overhead Persistent Infrared sensor designs to meet missile tracking requirements.” There are also five missions launching in this batch on behalf of the NRO. “We maintain a close partnership with our mission customers and our domestic launch industry to protect our nation,” said Col. Chad Melone, SSC senior materiel leader, Mission Solutions Space Acquisition Delta, in a statement. “Under our Phase 2 contract, ULA and SpaceX have been committed partners, and our combined team remains dedicated to delivery of critical assets to our warfighters as we complete this phase of the NSSL program and embark on NSSL Phase 3 starting in FY25.” Phase 3 will see new entrants into the competition for NSSL awards. Companies like Blue Origin and Relativity Space are expected to vie for the forthcoming launches. One of the two Falcon 9 rockets SpaceX planned to take off in a span of less than five hours earlier this week will remain grounded indefinitely, preventing Cape Canaveral from hosting two launches on the same day for the first time in decades. But the military-run Eastern Range was ready for the back-to-back missions, and probably won’t have to wait long for the next chance for a launch doubleheader. SpaceX’s Falcon 9 rocket took off from Cape Canaveral on Friday afternoon, sending a Dragon cargo freighter on the way to the International Space Station as the launcher’s first stage booster returned to Earth aboard a floating platform. SpaceX launched Argentina’s SAOCOM 1B radar observation satellite from Cape Canaveral at 7:18 p.m. EDT (2318 GMT) Sunday. A Falcon 9 rocket headed toward the south on a trajectory hugging the Florida East Coast on the first flight into polar orbit from Cape Canaveral since 1969, and the first stage booster returned to the spaceport for an onshore landing minutes after liftoff. © 1999-2023 Spaceflight Now Inc "}
{"title": "U.S. military’s X-37B  mini-shuttle to launch on SpaceX Falcon Heavy for the first time", "link": "https://spaceflightnow.com/2023/11/09/u-s-militarys-x-37b-mini-shuttle-to-launch-on-spacex-falcon-heavy-for-the-first-time/", "date": "November 9, 2023", "description": "The U.S. military’s experimental spaceplane will soon soar to orbit using a SpaceX Falcon Heavy rocket for the first time, a Pentagon news release announced. The X-37B spacecraft will launch from the Kennedy Space Center no earlier than December 7. ", "body": "The U.S. military’s experimental spaceplane will soon soar to orbit using a SpaceX Falcon Heavy rocket for the first time, a Pentagon news release announced. The X-37B spacecraft will launch from NASA’s Kennedy Space Center no earlier than December 7. The Falcon Heavy launch will mark the seventh flight of the X-37B Orbital Test Vehicle. The mini-shuttle is operated by Department of the Air Force Rapid Capabilities Office, in partnership with the United States Space Force. The mission was previously dubbed USSF-52 by the U.S. Space Force. “We are excited to expand the envelope of the reusable X-37B’s capabilities, using the flight-proven service module and Falcon Heavy rocket to fly multiple cutting-edge experiments for the Department of the Air Force and its partners,” said Lt. Col. Joseph Fritschen, the X-37B Program Director, in a statement. The news release said the mission would see the spaceplane operate in “new orbital regimes” without any specific details. Previous X-37B missions have operated in low Earth orbit. The spaceplane is designed for long-duration missions on orbit for various tests and experiments on behalf of the Space Force as well as NASA. This upcoming flight, OTV-7, will include a radiation experiment called “Seeds-2,” which will study the impacts of radiation on various plant seeds during long-duration spaceflight. The upcoming flight will also be “experimenting with future space domain awareness technologies” in order to ensure “safe, stable, and secure operations in space for all users of the domain.” OTV-7 will mark the first launch of the X-37B on a Falcon Heavy rocket. The fifth flight of the spaceplane took off on a Falcon 9 Block 4 rocket back on Sept. 7, 2017. The other four launches used a ULA Atlas 5 rocket to get to orbit. While the length of this upcoming flight has not been disclosed, each previous mission of the X-37B got progressively longer. The most recent flight launched back on May 17, 2020, and landed on Nov. 12, 2022 at Space Florida’s Launch and Landing Facility at KSC. That mission was the first to include a service module, which attached to the rear of the spaceplane, allowing for more experiments to fly onboard. It too included a seeds experiment for NASA as well as the FalconSat-8, a satellite built and operated by U.S. Air Force Academy cadets, which remains in orbit. There are two spaceplanes currently in the X-37B program, thought it was not disclosed which one will be launching on this upcoming mission. This mission also continues the relationship between USSF and SpaceX to further validate its launch capabilities. The Falcon Heavy side boosters that will launch on this mission, B1064 and B1065, will make their fifth flight. They were first used on USSF-44, which launched on Nov. 1, 2022, and have subsequently flown on USSF-67, Jupiter-3/EchoStar-24 and NASA’s Psyche missions. The launch contract with SpaceX for this mission is valued at $154,726,072, according the U.S. Space Systems Command. SpaceX and NASA said they plan to use these side boosters one last time in October 2024 to support the Europa Clipper mission to send a spacecraft to study one of Jupiter’s moons. That launch will take the full power of the Falcon Heavy and so, the side boosters and the core stage will all be expended. An unpiloted demonstration flight of Boeing’s Starliner crew capsule ended prematurely Sunday with a smooth airbag-cushioned predawn landing in New Mexico after a timing glitch prevented it from docking with the International Space Station, leaving some test objectives incomplete as NASA begins analyzing data to determine if astronauts should fly on the next Starliner mission. SpaceX’s Falcon 9 booster steered toward a first-ever landing on a drone ship floating 185 miles northeast of Cape Canaveral in the Atlantic Ocean minutes after blasting off from Florida with a space station cargo ship. SpaceX chief executive Elon Musk released the first images of his company’s Falcon Heavy rocket Wednesday, showing the massive triple-core booster almost fully assembled inside its hangar at the Kennedy Space Center’s pad 39A, where it is scheduled to lift off some time in January. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches Falcon 9 rocket on 29th resupply mission to the Space Station", "link": "https://spaceflightnow.com/2023/11/09/live-coverage-spacex-to-launch-falcon-9-rocket-on-29th-resupply-mission-to-the-space-station/", "date": "November 9, 2023", "description": "Rodents, water filters and a laser relay are among the 6,500 pounds of science and equipment that will launch to the International Space Station on Thursday evening. A Falcon 9 rocket launched carrying a SpaceX Cargo Dragon at 8:28 p.m. EST (0128 UTC on Nov. 10) from Launch Complex 39A at NASA’s Kennedy Space Center. ", "body": " Successful liftoff of the Falcon 9 rocket and Cargo Dragon separation. Rodents, water filters and a laser relay are among the 6,500 pounds of science and equipment that will launch to the International Space Station on Thursday evening. A Falcon 9 rocket is scheduled to liftoff carrying a SpaceX Cargo Dragon at 8:28 p.m. EST (0128 UTC on Nov. 10) from Launch Complex 39A at NASA’s Kennedy Space Center. This will be the ninth mission for SpaceX under the current Commercial Resupply Services-2 (CRS). The first 20 missions flew under the original resupply services contract. Weather heading into the launch is about as ideal as possible. The 45th Weather Squadron based at Patrick Space Force Base forecast a 95 percent favorable outlook at liftoff. If needed, the 24-hour backup opportunity on 8:05 p.m. EST (0105 UTC) is 90 percent favorable. After lifting off from the pad at LC-39A, the Falcon 9 will fly in a northeast trajectory to catch up to the ISS. About seven-and-a-half minutes after liftoff, the first stage booster, B1081, will land at Landing Zone 1. This will be the second flight for this booster after launching the Crew-7 mission to the ISS earlier this year. The Cargo Dragon on tap for the CRS-29 mission is one of three in the SpaceX fleet. Dubbed C211, it is also making its second flight after previously serving during the CRS-26 mission a year ago. The mission comes during the same month as the 25th anniversary of the launch of Zarya, the first module of the ISS. It was designed by NASA, but built and launched by Russia. “It’s incredible looking back over the past 25 years and seeing how space station has grown and how the international partnerships have flourished and how much research we’ve accomplished on the vehicle,” said Dana Weigel, ISS Deputy Program Manager, during a press call earlier this week. “As of today, 273 people from 21 countries have visited the International Space Station, which is pretty impressive.” Among the experiments launching to the ISS on this mission is the continuation of NASA’s foray into optical communications. The agency is sending up a piece of equipment called ILLUMA-T or the Integrated LCRD Low Earth Orbit User Totem and Amplifier Terminal. It will work in tandem with the Laser Communications Relay Demonstration (LCRD), which launched as a rideshare payload on a U.S. Department of Defense satellite back in December 2021. That satellite, the Space Test Program Satellite 6 (STPSat-6) operates in geostationary Earth orbit, which means it remains in a stable position relative to the Earth. “We’ll be able to send data from the ISS at 1.2 gigabits per second from LCRD and back to a ground station. That will all be done using laser links,” said Zachary Gonnsen, the ILLUMA-T Lead Systems Engineer. Normally, data is sent from space to the Earth and vice versa through radio frequencies. While sending data via a laser system won’t make the data move physically faster, more of it can be sent at one time. “The analagy I think of is you’re driving down the road at 80 miles an hour and you have a car with one person and there’s a bus next to you with 80 people. You both get to the destination at the same time, but the bus is carrying 80 people there and you only have one,” Gonnsen said. “So, you can think of that in terms of data and bits. That’s essentially what we’re doing here.” After the Dragon docks with the ISS, no astronauts will be needed with installing the ILLUMA-T payload onto the station during a spacewalk. Gonnsen said it will be done using the robotic arms that the station has externally. “The Canadarm will actually reach into the Dragon trunk, where ILLUMA-T is mounted, pull us out and we’ll do a handover between the Canadarm and the Japanese robotic arm,” Gonnsen said. “And then the Japanese arm will actually install us into our position.” The mission is set to nominally last six months, but could be extended beyond that as the technology is proven out. In addition to ILLUMA-T and other NASA-led experiments, there will also be 25 science payloads flying that are sponsored by the ISS National Laboratory. One of those comes from Redwire Space in Jacksonville, Florida. The PIL-BOX-01 is a joint mission with Eli Lilly and Company, which will run three experiments that examine treatments for diabetes and cardiovascular disease. Redwire is also sending up materials for a future bio printing experiment that will likely be conducted during the Crew-8 mission, which will launch no earlier than mid-February. It will print cardiac tissue using the company’s BioFabrication Facility (BFF). Another experiment is driven by researchers at the University of California, San Diego. It will examine the impact of microgravity on stem-cell derived brain organoids, which are described as “three-dimensional cellular models that represent aspects of the human brain.” This experiment will help better understand the processes that cause accelerated aging in space. Forecasters predict mostly clear skies and light winds at the surface and aloft for Monday’s launch of a SpaceX Falcon 9 rocket on a resupply mission to the International Space Station, favorable conditions for the booster’s liftoff and landing at Cape Canaveral. NASA wants to fly an astronaut on Russia’s next Soyuz mission to the International Space Station in April, a measure the agency says would ensure a continued U.S. presence on the research outpost in case of delays in the launch of SpaceX’s next Crew Dragon flight. NASA’s independent review team that investigated the destruction of a SpaceX Falcon 9 rocket and Dragon supply ship shortly after liftoff in June 2015 concluded a design error led to the loss of more than two tons of provisions and equipment heading for the International Space Station. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches Dragon cargo ship to space station", "link": "https://spaceflightnow.com/2023/11/10/spacex-launches-dragon-cargo-ship-to-space-station/", "date": "November 10, 2023", "description": "Lighting up the night sky, a SpaceX Falcon 9 rocket streaked into orbit in spectacular fashion Thursday, kicking off a 32-hour rendezvous with the International Space Station to deliver 6,500 pounds of research gear, crew supplies and needed equipment. ", "body": "Lighting up the night sky, a SpaceX Falcon 9 rocket streaked into orbit in spectacular fashion Thursday, kicking off a 32-hour rendezvous with the International Space Station to deliver 6,500 pounds of research gear, crew supplies and needed equipment. Also on board: fresh fruit, cheese and pizza kits and “some fun holiday treats for the crew, like chocolate, pumpkin spice cappuccino, rice cakes, turkey, duck, quail, seafood, cranberry sauce and mochi,” said Dana Weigel, deputy space station program manager at the Johnson Space Center. Liftoff from historic pad 39 at the Kennedy Space Center came at 8:28 p.m. EDT, roughly the moment Earth’s rotation carried the pad directly into the plane of the space station’s orbit. That’s a requirement for rendezvous missions with targets moving at more than 17,000 mph. The climb to space went smoothly, and the Dragon was released to fly on its own about 12 minutes after liftoff. If all goes well, the spacecraft will catch up with the space station Saturday morning and stand by for capture by the lab’s robot arm. The launching marked SpaceX’s 29th Cargo Dragon flight to the space station and the second mission for capsule C-211. The first stage booster, also making its second flight, flew itself back to the Cape Canaveral Space Force Station to chalk up SpaceX’s 39th Florida touchdown and its 243rd overall. But the primary goal of the flight is to deliver research gear and equipment to the space station. Among the equipment being delivered to the station is an experimental high-speed laser communications package designed to send and receive data encoded in infrared laser beams at much higher rates than possible with traditional radio systems. “This is using optical communication to use lower power and smaller hardware for sending data packages back from the space station to Earth that are even larger and faster than our capabilities today,” said Meghan Everett, a senior scientist with the space station program. “This optical communication could hugely benefit the research that we are already doing on the space station by allowing our scientists to see the data faster, turn results around faster and even help our medical community by sending down medical packets of data.” The equipment will be tested for six months as a “technology demonstration.” If it works as expected, it may be used as an operational communications link. Another externally mounted instrument being delivered aboard the Dragon is the Atmospheric Waves Experiment, or AWE. It will capture 68,000 infrared images per day to study gravity waves at the boundary between the discernible atmosphere and space — waves powered by the up-and-down interplay between gravity and buoyancy. As the waves interact with the ionosphere, “they affect communications, navigation and tracking systems,” said Jeff Forbes, deputy principal investigator at the University of Colorado. “AWE will make an important, first pioneering step to measure the waves entering space from the atmosphere. And we hope to be able to link these observations with the weather at higher altitudes in the ionosphere.” And an experiment carried out inside the station will use 40 rodents to “better understand the combined effects of spaceflight, nutrition and environmental stressors on (female) reproductive health and bone health,” Everett said. “There was some previous research that suggested there were changes in hormone receptors and endocrine function that negatively impacted female reproductive health,” she said. “So we’re hoping the results of this study can be used to inform female astronaut health during long-duration spaceflight and even female reproductive health here on Earth.” © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX Falcon 9 rocket launches 22 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/10/28/live-coverage-spacex-falcon-9-rocket-to-launch-22-starlink-satellites-from-california/", "date": "October 28, 2023", "description": "The first of two Falcon 9 missions SpaceX is planning for Sunday carried into orbit the largest batch of second-generation Starlink satellites to be launched from the West Coast.", "body": "The first of two Falcon 9 missions SpaceX is planning for Sunday carried into orbit the largest batch of second-generation Starlink satellites to be launched from the West Coast. It was the 50th Starlink launch of the year. The Falcon 9 lifted off from Space Launch Complex 4 East (SLC-4E) at Vandenberg Space Force Base in California at 2 a.m. PDT (5 a.m. EDT / 0900 UTC) with 22 satellites aboard. The California launch will be followed on Sunday by another Starlink delivery mission carrying 23 satellites, which will launch from pad 40 at Cape Canaveral Space Force Station at 7:45 p.m. EDT (2345 UTC). The Starlink 7-6 mission was the first time a Falcon 9 has carried 22 of the so-called V2 Mini satellites from the West Coast. Previously, missions from there had been limited to 15 or 21 Starlinks, depending on the orbit. On the East Coast, a Falcon 9 launched 23 V2 Minis a week ago on Oct. 21, one more than the previous maximum load for a mission from the Cape. SpaceX has not explained how it is achieving this extra delivery capacity. It’s possibly due an improvement in the rated performance of the Falcon 9 or perhaps a manufacturing change that has reduced the satellites’ total weight. The Falcon 9 first-stage booster, tail number B1075, was making its seventh flight. It entered service in January of this year carrying 51 older generation Starlinks into orbit. It went on to launch the Tranche 0 Flight 1 mission for the U.S. military’s Space Development Agency and then made four more Starlink delivery flights. It last flew prior to today’s launch on Sept. 25, making for a 34-day turnaround. After separating from the Falcon 9 second stage, B1075 continued downrange for a landing on the droneship Of Course I Just Love You, which was stationed in the Pacific off shore of Baja California. The 22 Starlink satellites will be released from the second-stage just over an hour into flight. A successful deployment will bring the total number of Starlink satellites in orbit to 4,989, according to . SpaceX has accomplished 25 orbital missions from Vandenberg in the last 365 days, an average of one launch every 14.6 days. Including launches from Cape Canaveral, it was the 89th orbital mission for SpaceX in the last 365 days, a launch every 4.1 days on average. © 1999-2023 Spaceflight Now Inc "}
{"title": "Falcon 9 launch scrubbed 30 seconds before liftoff with 23 Starlink satellites", "link": "https://spaceflightnow.com/2023/10/29/live-coverage-spacex-falcon-9-rocket-to-launch-from-cape-canaveral-with-23-starlink-satellites/", "date": "October 29, 2023", "description": "SpaceX encountered an issue with the stage separator prior to launching 23 more satellites for its Starlink internet service from Cape Canaveral. The backup launch window on Monday, Oct. 30, begins at 7:20 p.m. EDT (2320 UTC). ", "body": "A scrub was called at T-30 seconds to liftoff. The launch team will target its next launch attempt with a 24-hour recycle. The launch window opens at 7:20 p.m. EDT (2320 UTC). SpaceX is gearing up to launch 23 more satellites for its Starlink internet service from Cape Canaveral on Sunday, its second Falcon 9 launch of the day. Liftoff from pad 40 is scheduled for 8:17 p.m. EDT (0017 UTC). Earlier Sunday, a Falcon 9 lofted 22 Starlinks from Vandenberg Space Force Base in California. That launch brought the number of Starlink satellites currently in orbit to 4,989, according to . If all goes according to plan, SpaceX will have more than 5,000 Starlink satellites in orbit by the end of the day. A forecast issued by the 45th Weather Squadron at Cape Canaveral on Saturday gave the Falcon 9 an 85-percent chance of favorable conditions for launch. The main concerns are violations of liftoff wind limits and rules associated with lightning-triggering cumulus clouds. There was a low to moderate risk of poor weather in the booster recovery area near the Bahamas. SpaceX has five back up launch opportunities on Sunday night if needed, the last of which is at 10:47 p.m. EDT (0247 UTC). Spaceflight Now will bring you live coverage from the Cape, starting about an hour before launch. After lifting off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station, the Falcon 9 will pitch and roll onto a south-easterly trajectory as it targets an orbit inclined at 43 degrees to the equator. The first-stage booster, making its eighth flight, will touch down on the drone ship ‘Of Course I Still Love you’ about eight and a half minutes after launch. The booster, tail number B1077, first flew in October 2022, carrying Crew 5 to the International Space Station aboard Dragon Endurance. It went on to fly the GPS III F6, Inmarsat I6-F2, CRS-28, and Intelsat G-37 missions, plus two Starlink delivery flights. Deployment of the 23 Starlink satellites into a 182×177 mile (293×285 km) orbit is scheduled to occur 1 hour, 5 minutes and 38 seconds after launch. Tonight’s launch will be the 90th orbital mission for SpaceX in the last 365 days, roughly a launch every four days on average. Company officials have said they hope to accelerate the pace of launches and make 100 flights in 2023, surging to a total of 144 in 2024. © 1999-2023 Spaceflight Now Inc "}
{"title": "Falcon 9 adds 23 satellites to Starlink network, pushes total in orbit over 5,000", "link": "https://spaceflightnow.com/2023/10/30/live-coverage-spacex-to-launch-23-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral/", "date": "October 30, 2023", "description": "SpaceX successfully launched a Falcon 9 carrying 23 more satellites for its Starlink internet service from Cape Canaveral. Liftoff from pad 40 occurred at 7:20 p.m. EDT (2320 UTC).  ", "body": "A Falcon 9 carrying 23 more satellites for SpaceX’s Starlink internet service lifted off from Cape Canaveral Monday, bringing the total number of Starlinks currently in orbit to more than 5,000 satellites. Liftoff from pad 40 occurred at 7:20 p.m. EDT (2320 UTC). After lifting off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station, the Falcon 9 pitched and rolled onto a south-easterly trajectory as it targeted an orbit inclined at 43 degrees to the equator. It was the second launch attempt for the Starlink 6-25 mission. On Sunday night the countdown reached T-30 seconds when an abort was called. The launch director said a problem was detected with the system used to separate the first and second stages of the rocket and launch was pushed back to Monday. The first-stage booster, making its eighth flight, successfully touched down on the drone ship , stationed east of the Bahamas, about eight and a half minutes after launch. The booster, tail number B1077, first flew in October 2022, carrying Crew 5 to the International Space Station aboard Dragon Endurance. It went on to fly the GPS III F6, Inmarsat I6-F2, CRS-28, and Intelsat G-37 missions, plus two prior Starlink delivery flights. Deployment of the 23 Starlink satellites into a 182×177 mile (293×285 km) orbit occurred 1 hour, 5 minutes and 38 seconds after launch. The mission brought the number of Starlink satellites currently in orbit to 5,011 based on . Tonight’s launch was the 90th orbital mission for SpaceX in the last 365 days, roughly a launch every four days on average. Company officials have said they hope to accelerate the pace of launches and make 100 flights in 2023, surging to a total of 144 in 2024. © 1999-2023 Spaceflight Now Inc "}
{"title": "FAA concludes SpaceX Starship safety review, continues environmental review", "link": "https://spaceflightnow.com/2023/10/31/faa-concludes-spacex-starship-safety-review-continues-environmental-review/", "date": "October 31, 2023", "description": "SpaceX’s highly anticipated second test flight of its Starship super heavy lift rocket is one step closer to liftoff from South Texas. On Tuesday, the Federal Aviation Administration announced the conclusion of its safety review. The FAA said it is still working with the U.S. Fish and Wildlife Service to complete an environmental review. ", "body": "SpaceX’s highly anticipated of its Starship super heavy lift rocket is one step closer to liftoff from South Texas. On Tuesday, the Federal Aviation Administration announced the conclusion of its safety review. The agency issued a brief statement noting the this portion of the assessment wrapped up on Oct. 31. It describes the safety review as being “focused on issues that affect public health and safety of property.” “It consists of evaluating the applicant’s safety organization, system safety processes, flight safety analysis, and quantitative risk criteria for launch, reentry, and vehicle disposal,” the FAA stated. The biggest outstanding piece of the equation before the second integrated flight test is the environmental review, which is being done in partnership with the U.S. Fish and Wildlife Service (FWS). On Oct. 5, the FAA sent its final biological assessment to FWS. The latter agency had up to 30 days to review that document, but announced that it finished that review on Oct. 19 and reinitiated its formal Endangered Species Act consultation with the FAA. That process is allotted 135 days by statute, but similarly with the biological assessment review, FWS stated on Oct. 26 that it does “not expect to take the full amount of time.” Spaceflight Now reached out to FWS to see where the agency is in the process and is waiting to hear back. That 135 days breaks down into two main buckets as part of the agency’s “ESA Section 7 Consultation” process: In a statement to Spaceflight Now on Tuesday, an FAA spokesperson said, “The environmental review is the last major element to complete before the FAA makes a license determination.” Last week, SpaceX stacked Ship 25 with Booster 9 and conducted a wet dress rehearsal before unstacking the vehicle. Vehicle is ready for the second test flight of a fully integrated Starship, pending regulatory approval — SpaceX (@SpaceX) “We are prepared to conduct Starship’s second integrated test flight as soon as the end of this month, pending only FAA license approval, which includes the reviews of supporting agencies,” Gerstenmaier said in a to a Senate subcommittee. “Critically, the vehicle has been ready to fly since mid-September. The current regulatory process is not keeping up with the pace of innovation.” Because of SpaceX’s iterative process of testing and flying, Gerstenmaier described IFT-2 as needed “in order to test critical systems need to meet NASA objectives.” NASA’s Human Landing System Program is also eagerly awaiting this next launch to continue the progress towards the version of Starship that will bring humans down to the lunar surface on the Artemis 3 mission, targeting launch in December 2025. “I would be remiss if I didn’t say we’re concerned about the SpaceX schedule for HLS and the concern is that our critical path, even today, goes through these test flights,” said Lisa Watson-Morgan, the HLS program manager in with Spaceflight Now. “And the reason it goes through the test flights is because of SpaceX’s development approach, which I fully support and I really cherish.” Watson-Morgan said they’re hoping to see the ship-to-ship propellant transfer mission sometime in 2024. “That is our key. When that day happens, I’m gonna be like, whew!” Watson-Morgan said. “I know we’ll get there.” In the last few months, teams of SpaceX engineers working on the flat coastal plains of South Texas and in a nondescript industrial yard on Florida’s Space Coast have been building two futuristic-looking stainless steel rockets — or Starships — prototypes for a reusable vehicle the company claims could one day ferry people to Mars. For the fourth time this month, SpaceX has launched a Falcon 9 rocket from Florida’s Space Coast with another 60 Starlink internet satellites. Liftoff of the Falcon 9 from pad 40 at Cape Canaveral Space Force Station occurred at 4:28 a.m. EDT (0828 GMT) Wednesday. The Falcon 9’s booster landed on an offshore drone ship. For the second day running, computers automatically aborted a Falcon 9 launch countdown Monday at NASA’s Kennedy Space Center in Florida in the final seconds before liftoff with the Intelsat 35e communications satellite. Thanks for the update. “Go Super Heavy, Go Starship!” Comments are closed. © 1999-2023 Spaceflight Now Inc "}
{"title": "Astrobotic’s Peregrine lander arrives in Florida ahead of Christmas Eve Moon-bound launch", "link": "https://spaceflightnow.com/2023/11/01/astrobotics-peregrine-lander-arrives-in-florida-ahead-of-christmas-eve-moon-bound-launch/", "date": "November 1, 2023", "description": "The first payload teed up for NASA’s industry-led missions to the Moon has arrived in Florida. Astrobotic’s Peregrine lunar lander was unpacked inside a clean room on the Space Coast after leaving the company’s facilities in Pittsburgh, Pennsylvania, on Friday. ", "body": "The first payload teed up for NASA’s industry-led missions to the Moon has arrived in Florida. Astrobotic announced on Halloween that its Peregrine lunar lander was unpacked inside a clean room on the Space Coast after leaving the company’s facilities in Pittsburgh, Pennsylvania, on Friday. The mission will be the first for both Astrobotic and its ride to space, United Launch Alliance’s Vulcan rocket. President and CEO Tory Bruno said in a tweet on Tuesday that the launch time on Dec. 24 is 1:49 am EST (0649 UTC). “It’s incredibly thrilling. We’ve been talking about this mission for 16 years as an organization, our first mission to the Moon, and now it’s finally here,” said Dan Hendrickson, Astrobotic’s Vice President of Business Development. “The team is exhilarated, anxious to get off the launchpad and ready to fly. So really, it’s a dream come true now that we’re here.” Hendrickson spoke with Spaceflight Now on the sidelines of the American Astronautical Society’s von Braun Space Exploration Symposium on Oct. 27, the day that the Peregrine lander hit the road to head down to Florida. Hendrickson said it will be a fairly straightforward process for them to get to launch, now that they’re in the Sunshine State. He said teams with Astrobotic have been working with ULA for months about the fueling steps, transportation to ULA’s Vertical Integration Facility and integration on top of the Centaur 5 upper stage. “We built Peregrine in a 100k-class cleanroom in accordance with our standards for cleanliness for the spacecraft. And so, we’ve maintained that environment as it’s transiting and through the encapsulation process,” Hendrickson said. “That process and that flow has been maintained and will continue to be maintained through the launch.” . 's Peregrine lunar lander is on the road to Florida. It left the clean room adjacent to the in Pittsburgh this morning. We spoke with VP of Business Development Dan Hendrickson about the lander's journey to the pad and launch NET Dec. 24. Watch here: — Spaceflight Now (@SpaceflightNow) After Vulcan lifts off from Space Launch Complex 41 (SLC-41) at Cape Canaveral Space Force Station, and separates from the rocket, Hendrickson said the first step is to power up while it flies on its first phasing loop heading out to a lunar distance. “So, that gives us an opportunity to check out the vehicle, understand its performance, since it’s the first time it’s flying in space,” Hendrickson said. “It will come back around the Earth. It’ll slingshot and then go out to meet the Moon where it will be at that point.” Hendrickson said from there, Peregrine will perform a lunar orbit insertion burn to move into a highly-elliptical orbit. Following that, it will enter into a less elliptical orbit and then finally, circularize into a 100 by 100 kilometer ellipse. The spacecraft will remain in that orbit “until the lunar lighting conditions are just right.” “We want to land in the early morning at the landing site. And so, we’ll wait for those lighting conditions to line up,” Hendrickson said. “And then, we’ll start to make the powered descent down the surface.” Hendrickson said because the lander uses as hypergolic (liquids that react spontaneously upon contact with each other) propulsion system, they’re able to linger in this circular orbit before ultimately beginning the powered descent sequence. “We don’t have any issues with any of the propellant outgassing away over time and so, it gives us quite a bit of flexibility,” he said. “We’ll be fine as far as waiting for any kind of lighting conditions. The full opportunities and launch windows that we have available to us will allow us to linger as long as we need to ultimately for the vehicle.” In a nominal scenario, Hendrickson said it would take between 30 to 39 days from launch to landing on the Moon. Assuming ULA is able to launch during their December window, which runs from Dec. 24-26, that would set up a landing around late January 2024. When asked whether a different launch and landing strategy was considered to allow for a larger launch window each month, Hendrickson said this was their best option. “We worked with ULA to maximize all the available opportunities. We wanted to make sure that Peregrine has the best possible chance to succeed on its way to the surface and give it the best possible window to land,” Hendrickson said. “So, we worked very closely with them over the time that we’ve been on contract together. It’s been a great working relationship and we found the sweet spot.” The Peregrine lander is set to touch down at , which translates to “Bay of Stickiness.” It’s located at 35.25 degrees North and 40.99 degrees West on the Moon. Hendrickson said one of their partners, DHL, is helping with sharing their journey to the Moon and said the landing would be live-streamed. Because of the of Intuitive Machines’ launch of its Nova-C lander, the Peregrine-1 mission will be the first to launch under NASA’s Commercial Lunar Payload Services (CLPS) initiative. Similar to the Commercial Crew Program, NASA will be a paying customer and will hitch a ride with various payloads on board commercial landers that are heading to the Moon. If it holds its launch date though, the IM-1 mission should arrive at the Moon’s surface slightly before Peregrine-1 touches down. Once it’s on the surface, Hendrickson said Peregrine is designed to operate for roughly eight to ten days. They’re carrying 21 payloads onboard, which are a mix of commercial and government items. Astrobotic was awarded one of the first task orders under the CLPS program back in 2019, which was valued at $79.5 million. It was dubbed Task Order 2 – AB (TO2-AB) by the agency. Originally, it was going to carry up to 14 NASA payloads, of which ten that were considered later in development. However, five were shifted to future CLPS missions, according to an April 2023 from NASA. The five remaining NASA payloads are from following Ames Research Center (ARC) Goddard Space Flight Center (GSFC), Johnson Space Center (JSC): Peregrine-1 will also transport the built by Carnegie Mellon University, which is poised to become the first American lunar robot sent to the Moon. Another payload onboard will be a technology demonstration called the Terrain Relative Navigation (TRN) sensor, which was developed through a $10 million NASA Tipping Point contract in partnership with JSC, NASA’s Jet Propulsion Lab and Moog. “We’re in a GPS-denied environment and so, that sensor is something that we have come to appreciate since the very beginning of our program, that we needed to develop that in house. That’s an incredibly important capability that we need to have for our landers,” Hendrickson said. “It’s an opportunity to test the hardware and also the algorithms that will identify key features visually to help the spacecraft understand where it is in space in relation to the Moon.” He said they won’t be relying on the TRN to safely land with this first mission, which will allow it to be primarily a tech demonstration. Astrobotic’s second Moon mission, using their larger Griffin lander, will need that capability though, since it’s making a much more precise landing at the Moon’s South Pole. “We will take performance of that sensor, the data and the full performance that it operates on Peregrine. We’ll learn from that and apply lessons learned then for Griffin for that sensor, which will then be in the loop and be relied upon for that precise landing ellipse,” Hendrickson said. The Griffin lander is set to launch in November 2024 and will carry NASA’s (Volatiles Investigating Polar Exploration Rover) payload. While they are two different types of landers, Hendrickson said the development of each has helped inform items on the other. “We try to have commonality between our landers as much as possible and what I’ve been heartened to observe in my time that we’ve been executing on Peregrine and Griffin is watching the lessons learned actually between both programs over time,” Hendrickson said. “They might look very different, they’re carrying different payloads, but ultimately, they’re both lunar lander missions.” Astrobotic is not only concerned with landing science and robotic missions on the Moon, but eventually people as well. The company is one of the six corporations involved in the Blue Origin-led National Team, which is developing a crewed lander as part of NASA’s . The TRN that will be tested and developed using Peregrine and Griffin will also factor into the Blue Moon lander’s guidance, navigation and control (GNC) system. “We have organically been developing our own mapping tool for the Moon for years now. So, we’re really excited to help Blue Origin by providing the tools and the background experience that we have,” Hendrickson said. “Certainly, we’ll be sharing lessons learned that we have from this mission as much as possible with the National Team. We’re also helping on the cargo accommodation system for the future.” He noted that while they are optimistic with this first landing attempt, spaceflight is not an easy thing and that “the Moon is a harsh mistress, as they say.” “If there are any issues along the way, we will learn from them and we will proceed. This is a program that is built for the long term. We’re here to stay,” Hendrickson said. “We’re really excited to follow up with multiple missions in the future. So, every flight is a learning opportunity, success or failure, doesn’t matter. And we plan to certainly learn from the mission and improve our future missions with all the data and experience that we gain.” “But again, we’re feeling really good. We’ve been doing a lot of mission simulations over the last few months, practicing all the operations on the way to the Moon: the actual power descent, then the payload operations on the surface,” he added. “We feel ready, we feel confident and we’re excited to go.” When launches on its inaugural flight, almost half of the thrust to depart Space Launch Complex-41 comes from a pair of GEM 63XL solid rocket boosters. Today, the first solid rocket booster was installed for the mission in our . — ULA (@ulalaunch) The four RS-25 engines at the bottom of NASA’s first Space Launch System core stage shut down about a minute into a ground test-firing Saturday that was supposed to last more than eight minutes. Wrapping up a busy two days on the lunar surface, a Chinese spacecraft carrying moon soil took off from a makeshift launch pad and fired back into orbit Thursday on the first leg of its journey back to Earth. NASA is taking steps to rein in costs, emphasizing bonds with private sector companies, and signaling it might be open to a future where the agency’s flagship Orion deep space capsule and Space Launch System are no longer necessary to explore deep space, at least in their current forms. © 1999-2023 Spaceflight Now Inc "}
{"title": "Mixed results for spacewalkers after time lost dealing with difficult-to-loosen bolts", "link": "https://spaceflightnow.com/2023/11/01/mixed-results-for-spacewalkers-after-time-lost-dealing-with-difficult-to-loosen-bolts/", "date": "November 1, 2023", "description": "Astronauts Jasmin Moghbeli and Loral O’Hara worked outside the International Space Station Wednesday to replace a bearing assembly in one of the lab’s solar array rotation mechanisms. But the task took longer than expected and they were unable to retrieve a failed electronics box as planned. ", "body": "Astronauts Jasmin Moghbeli and Loral O’Hara worked outside the International Space Station Wednesday to replace a bearing assembly in one of the lab’s solar array rotation mechanisms. But the task took longer than expected and they were unable to retrieve a failed electronics box as planned. It was the first spacewalk for Moghbeli and O’Hara, the fourth all-female excursion and the first such outing since January 2020 when Jessica Meir and Christina Koch completed their third EVA, or extra-vehicular activity. The year’s 12th spacewalk began at 8:05 a.m. EDT when Moghbeli and O’Hara switched their spacesuits to battery power. The two major goals of the 269th station spacewalk were to replace a degraded bearing assembly in one of the station’s two solar array rotation mechanisms and to retrieve a failed communications component stored on an external platform so it could be shipped back to Earth for repairs. O’Hara focused on replacing the bearing assembly in the station’s left-side solar alpha rotary joint, or SARJ, which rotates outboard solar arrays to maximize energy production. Each SARJ is equipped with 12 bearing assemblies that clamp onto a rotating 10.5-foot-wide “race ring.” While O’Hara was working to unbolt the bearing assembly, Moghbeli removed a no-longer-needed handling fixture to make way for the future installation of a roll-out solar array blanket. She was in the process of taking pictures of the area where the new arrays will be installed when flight controllers asked her to help hold O’Hara in place while she struggled to loosen tight bolts holding the bearing assembly in place. By the time the degraded bearing assembly was finally removed, the crew was about an hour behind schedule. O’Hara used a grease gun to lubricate the race ring while Moghbeli made her way to a nearby external camera to reposition an out-of-position ethernet cable. After helping stabilize O’Hara while she used a power tool to tighten the bolts holding the replacement bearing assembly in place, Moghbeli floated over to an external storage platform where the failed S-band radio communications component was stowed. She and O’Hara originally planned to remove the unit and bring it back to the station airlock for eventual return to Earth. But given time lost installing the bearing assembly, flight controllers opted to have Moghbeli simply prep the unit for removal during a future spacewalk. O’Hara assisted her toward the end of the EVA. At one point earlier in the spacewalk, Moghbeli mentioned that she could not find a tool bag she had tethered to a nearby handrail. She was told to look for it later, but it wasn’t immediately known if she found it or if it somehow came loose and floated away. In any case, the astronauts returned to the Quest airlock and closed out the 6-hour 42-minute spacewalk at 1:47 p.m. “Congratulations to you both on your first EVAs,” astronaut Anne McClain radioed from mission control. “You and the whole team here safely executed a complex and international mission. Nicely done.” Moghbeli thanked the crew’s trainers, adding “I’d also like to thank my family and friends. This is a very special moment for me, going out on my first spacewalk, with my good friend and someone I really look up to, Loral. So thank you for giving me this. … I really think it takes a village, and I’ve got a strong village.” In a final call out to her twin two-and-a-half-year-old girls, she added: “Zelda and Estelle, mommy loves you, and I hope this is a reminder that dreams can become reality.” © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches Falcon 9 booster from Cape Canaveral on recording-breaking 18th flight", "link": "https://spaceflightnow.com/2023/11/03/live-coverage-spacex-to-launch-falcon-9-booster-from-cape-canaveral-on-recording-breaking-18th-flight/", "date": "November 3, 2023", "description": "SpaceX broke another re-flight record on Friday evening with the launch of 23 more Starlink satellites on a Falcon 9 booster making its 18th flight. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 8:37 p.m. EDT (0037 UTC on Nov. 4). ", "body": "SpaceX broke another re-flight record on Friday evening with the launch of 23 more Starlink satellites on a Falcon 9 booster making its 18th flight. The Starlink 6-26 mission launched from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station at 8:37 p.m. EDT (0037 UTC on Nov. 4). It sent 23 Starlink V2 Mini satellites up to low Earth orbit, which will bring the total Starlink satellites launched in 2023 up to 1,711. The booster for this mission, tail number B1058, is the oldest, currently flying Falcon 9 booster. It first flew on May 30, 2020, launching former NASA astronauts Bob Behnken and Doug Hurley to the International Space Station on the Demo-2 mission. This was the first flight of the Commercial Crew Program with astronauts on board. SpaceX has since flown seven crew rotation missions up to the orbiting outpost, in addition to two private astronaut missions. Following liftoff, the booster landed on the droneship, ‘A Shortfall of Gravitas,’ about eight-and-a-half minutes into the mission. As SpaceX continues working towards adding Dragon capabilities to SLC-40 with a new crew access tower, Friday night’s mission will marked the 152nd orbital launch for the company since it began using the launch pad. This will be the 207th overall launch from this site. While SpaceX launched its 52nd Starlink launch of the year, it’s also working towards another mission over at Launch Complex 39A at NASA’s Kennedy Space Center. On Thursday, NASA announced another two-day slip to the launch. It’s the third time the mission has been delayed due to an issue with one of the Draco thrusters on the Cargo Dragon that will fly the mission. Launch was previously scheduled for Nov. 3, 5 and 7. “During the initial propellant load in preparation for the CRS-29 mission, teams identified a leak of NTO (nitrogen tetroxide oxidizer) in a Draco thruster valve, which per standard procedure required a pause to the operation to troubleshoot,” NASA said in a statement. “The team inspected the valve and respective data, and decided to replace the thruster.” The 29th SpaceX mission for the Commercial Resupply Services program is currently targeting launch at 8:28 p.m. EST on Nov. 9 (0128 UTC on Nov. 10). One week after two cosmonauts and a NASA astronaut arrived at the International Space Station for a six-month stay, the three crew members they’re replacing packed up their Soyuz spacecraft for a fiery plunge back to Earth Wednesday evening to close out a 196-day mission. A commercial Dragon cargo craft wrapped up a two-day trip to the International Space Station on Monday with a glacial laser-guided final approach before astronauts grasped the supply ship with a robotic arm, completing the refurbished capsule’s second journey to the orbiting research complex. Four days after a Soyuz ferry craft brought three space station fliers down to a frigid landing in Kazakhstan, three fresh crew members are poised for launch early Tuesday from the Baikonur Cosmodrome to boost the lab’s crew back to six. I am a true X addict.wish were younger to witness Mars exploration bring on starship launch SpaceX develops expanded capabilities using existing technologies.  Rocket motors capable of large thrust outputs all burn chemicals and have specific impulse (ISP) values of not more than about 400 seconds.  Thermal nuclear rockets, such as the one to be developed by BWXT and Lockheed for DOE and NASA, will have an ISP of about 800 seconds.  New technologies, based on existing particle accelerators, such as those at Fermi Lab, Brookhaven lab and CERN, could potentially produce ISPs of hundreds of thousands to millions of seconds, depending on the exhaust velocity from the accelerator. The problem, just as with current electrical rocket thrusters, is maintaining charge neutrality. I believe projects should be funded to develop accelerator-based rockets for space since they would probably be impractical for use in the atmosphere. It is very much an incredible feat to see that a man, Elon musk, has successfully launched humans in what appears to be capsules that look like the ones from the 1969 missions. He has not had one loss of life. That is a feat in itself. However with this good rocket flying I bet you Mr musk’s promise of making a falcon 9 rocket fly 20 times is coming to fruition we’re on number 18 right now. Thanks for showing! I saw a red object with a short red tail traveling from the North toward the Southeast. it was about 8:45 PM. the tail disappeared shortly after and then the object was bright white, before being obscured by clouds. The date was 11/3/23. With all the upside down in our world it is a real pleasure  to see a real plan working and people who think and are responsible.  wish I was young enough to get involved.Built war ships for a life time and now retired, your turn to build spaceships.    GOOD LUCK! Great coverage tonight, thanks! What a remarkable rocket. Comments are closed. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX poised for ‘mid-November’ launch of second Starship test flight", "link": "https://spaceflightnow.com/2023/11/04/spacex-poised-for-mid-november-of-second-starship-test-launch/", "date": "November 4, 2023", "description": "More than half a year after its first flight, SpaceX believes it’s on the cusp of getting to launch its Starship rocket for a second time. ", "body": "More than half a year after its first flight, SpaceX believes it’s on the cusp of getting to launch its Starship rocket for a second time. On Friday afternoon, the company updated its website to announce that the second integrated flight test (IFT-2) of it’s towering rocket “could launch as soon as mid-November, pending regulatory approval.” Sources suggest the launch could be as soon as Nov. 13, but that’s far from set in stone. Those regulatory hurdles surrounding the fully reusable launch vehicle are now mainly centered around the conclusion of an environmental review, which is in the hands of the U.S. Fish and Wildlife Service (FWS). Earlier this week, the Federal Aviation Administration (FAA) said it had the Starship-Super Heavy . In a statement to Spaceflight Now, the agency said that “The environmental review is the last major element to complete before the FAA makes a license determination.” SpaceX will debut a number of upgrades to both the rocket itself as well as the launch infrastructure, including their new hot-stage separation system and an electronic Thrust Vector Control (TVC) system. The FWS has been evaluating one of the key upgrades since IFT-1: the water-cooled steel flame deflector aka the water deluge system. Reached for comment early Friday morning, an FWS spokesperson said they didn’t have any updates to provide regarding their progress. As was the case with the IFT-1 mission earlier this year, NASA has been eagerly watching the progress of Starship. SpaceX only has so much time to move through evolutions of Starship before it’s needed to operate as the first vehicle that will be a part of the Human Landing System Program within the overall Artemis Program. During 2024, SpaceX is expected to demonstrate its ability to transfer propellant from one Starship vehicle on orbit to another, a key milestone needed within the architecture of safely getting the spacecraft to the Moon, down to the surface and back into lunar orbit. “That will be a really key indicator as to their readiness level,” said Lisa Watson-Morgan, the HLS Program Manager. “And once they get to that point, and once that is achieved, it’s much smaller from there on out.” That propellant transfer mission will also call upon at least one additional orbital launch mount, which adds to the importance of being able to demonstrate either the success of the changes made or showcase what still needs to be adjusted. Watson-Morgan told Spaceflight Now last month that this iterative approach can be tricky to step through, but makes things more simplified by the end of the testing campaign. “And so what that means is by the time they’re at the end of their test campaign, they’re pretty much ready to fly. It’s more of a just, here’s the rest of the documentation. Let’s go in and certify,” Watson-Morgan said. “So, while yes, these are early developmental flights, and they’re not what the Human Landing System Starship will be, in that it doesn’t have our life support, it doesn’t have our comm system, it doesn’t have those aspects, but it is still very important and required. So for us, schedule is key.” We’ll see when launch number two ends up on the schedule. The next quartet bound for the International Space Station will wait a bit longer before they can punch their ticket to space after Falcon Heavy delays pushed back the launch of the next Crew Dragon mission, NASA said Tuesday. SpaceX successfully launched an oft-delayed Falcon 9 rocket mission at 6:35 p.m. EST (2335 GMT) Friday after more than a week of delays caused by issues with super-chilled liquid oxygen propellant, a boat the strayed into restricted waters offshore Cape Canaveral, and extreme upper level winds. The experimental recovery of the first stage on an ocean-going barge was not a success. A malfunction during a drop test over Nevada last month for SpaceX’s Crew Dragon program has engineers re-examining the crew capsule’s parachutes, and Boeing has also encountered parachute failures during testing for its commercial crew capsule, a senior NASA official confirmed Wednesday. Is that based in fact that FWS is near completion, or is this a PR stunt to put political pressure on FWS to force them to rush ? i.e. There has to be someone, or some agency to blame if this “poised for” launch does not happen now.  We’ve had our congressional hearing over the FAA, and now it’s time to chase after the FWS.  It’s could never be that SpaceX located their launch facility adjacent to a wildlife refuge now ( why ??) – could it, and have to deal with the complexities that every other company in our nation has to deal with – rules and regulations – that slows things down. I’d like to see articles like this be backed up with information that substantiates why they believe they will be granted permission to launch.  I’m tired of having to apply what I call the “E” exaggeration factor – take the schedule told – and multiply by 2 or 3.  Like after the April test – they mentioned they would be ready again in two months.  I took that and multiplied by 2 or 3 and said – ok, that really means 4 or 6 months.  And here we are now – about that time on the upper end.  It gets tiresome.  And boring. Why does he not build an ocean platform and launch away from the coast? Would be cheaper and less regulations. The political situation is against him suceeding. Also it would protect the enviornment. There should be a launch every 2 months to get this working right. Utterly ridiculous that a fish and wildlife organization is given the power to say when a cutting-edge, highly advanced spaceflight company can launch.  So…how is the FWS qualified for this kind of decision that will effect not only future spaceflight but national security?  It’s like letting the Girl Scouts tell the US military when to deploy to the South Pacific or to the middle east. While on the other side of the world that nation, China, that continually seeks to undermine and pilfer US technical prowess steams ahead with its massive new heavy lift rockets without a care as to any environmental regulations or to where their rocket stages land in the world, all in a mad frenzy to beat the US to the moon, which thanks to the FWS might actually happen. Perhaps NASA’s stated goal of putting the first person of color and the first woman on the moon will actually be Chinese nationals. And then China can tell the US to stay away and explore somewhere else while they prepare future military bases on the moon as they’ve done on Earth. The only thing that can prevent this possible future is Starship. So…thanks again, FWS. There should be no environmental review. Let’s go back to the times when the titans of industry could pump whatever they wanted into the waterways and air. everyone needs to relax, the FWS just got to monitor the deluge system at full pressure and I suspect max launch cadence less than two weeks ago, they need to monitor how quickly the tidal flat returns to pre deluge conditions (one to ten high tides?). once thats done they will give the aproval and all the environmental lawsuits can be tossed out.  they aren’t trying to hinder anything, not like the WDR was done months ago. they are doing the due diligence which is fine. heck, spacex was still messing with the hot ring 3 weeks ago and stacking and unstacking starship daily, just because Elon said it was ready in september doesn’t mean it was, it didn’t go through a WDR then now did it? You don’t want to get too far ahead of yourselves. Looking back; the V2 had anomalies because of vacuum across the hull at speed. The German engineers added bands around the mid section. You seem to be longer and faster than Falcon 9; so you might be facing a double whammy; ( the lac of atmospheric pressure forward and Venturi midship). Pressure sensitive equipment with command computer read outs and strain gauges might be in order. Comments are closed. © 1999-2023 Spaceflight Now Inc "}
{"title": "Private astronaut mission likely first to use SpaceX’s new crew access tower", "link": "https://spaceflightnow.com/2023/11/06/private-astronaut-mission-likely-first-to-use-spacexs-new-crew-access-tower/", "date": "November 6, 2023", "description": "A crew access arm was lifted into place at Space Launch Complex 40 at Cape Canaveral on Monday, as SpaceX races to ready the pad for its first Crew Dragon launch with astronauts as soon as January. ", "body": "A crew access arm was lifted into place at Space Launch Complex 40 at Cape Canaveral on Monday, as SpaceX races to ready the pad for its first Crew Dragon launch with astronauts as soon as January. Multiple sources tell SpaceFlight Now that Axiom Space’s third private astronaut mission to the International Space Station (ISS) will likely mark the debut of the new tower, thanks to a packed schedule at Launch Complex-39A. The mission, commanded by former NASA astronaut Michael López-Alegría, will send three European astronauts on a trip to the space station for up to 14 days. Currently, SpaceX and Russia’s agency, Roscosmos, are the only tickets to the ISS and it’s the lone option currently in the United States until Boeing’s CST-100 Starliner spacecraft enters the rotation next year. Not only that, but SpaceX currently only has one launch pad from which it can launch astronauts, as well as cargo missions, to the ISS: Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center. Over the course of 2023, SpaceX has been working to change that with the construction of a new crew and cargo access tower at its second Florida launch pad: Space Launch Complex 40 (SLC-40) at CCSFS. If the tower isn’t ready in time to support that mission, Ax-3 could still launch from LC-39A as all other SpaceX-flown astronaut missions have been going back to 2020. However, that would cause much more congestion on an already packed schedule for LC-39A. One of the key reasons why Ax-3 might be the mission that would debut the tower capabilities at SLC-40 is a pair of launches scheduled within days of each other that require the currently unique capabilities of LC-39A. No earlier than Jan. 12, a Falcon 9 rocket will be used to launch the first Commercial Lunar Payload Services (CLPS) mission from Intuitive Machines. The Nova C lander flying to the Moon’s South Pole must be fueled at the launch pad using equipment only available at 39A. In an with Spaceflight Now last month, IM’s Vice President of Lunar Access Trent Martin said that they will also conduct a wet dress rehearsal “several days before the launch.” “We want to fuel as late as possible. SpaceX has been very accommodating and they’re providing us a service that gives us liquid oxygen, liquid methane,” Martin said in October. “They’ll fill up until the very last minute, so that we’re as full as possible and we have the highest chance of success at landing on the Moon.” Those launches are boxed in on either side by other high priority missions. Starting Nov. 9, a Falcon 9 is scheduled to launch the 29th SpaceX Commercial Resupply Services (CRS-29) mission to the ISS, which will send thousands of pounds of cargo and science experiments up to the crew on orbit. That is expected to be followed by the fifth and final Falcon Heavy of 2023: the USSF-52 national security mission. It takes about three weeks to convert the launch pad from a Falcon 9 to a Falcon Heavy configuration. On the other side of Ax-3’s roughly two-week mission, the SpaceX Crew-8 quartet are expected to launch no earlier than mid-February. Commander and NASA astronaut Matthew Dominick will lead the mission alongside pilot Michael Barratt, mission specialist Jeanette Epps and mission specialist Alexander Grebenkin. Houston-based Axiom Space was planning to see its third commercial flight to the space station fly from pad 39A within a few days of the IM-1 launch and NASA wants it to go on schedule to avoid disrupting a busy space station traffic plan in early 2024. The IM-1 mission, which only has one, short launch window a month, could face long delays if it gets bumped out of its January window. Having the option to launch Ax-3 from SLC-40 would allow SpaceX to meet all of their customers’ needs and accommodate more opportunities in a smaller timeframe. That of course, relies upon the crew and cargo access tower being ready in time. On Monday, construction crews began hoisting the crew access arm into place using a series of cranes and harnesses. This is one of the last major components that needs to be in place, in addition to the emergency egress system, a zip-line-like escape system that would allow astronauts and support personnel to quickly get away from the tower, if needed. In previous press conferences with NASA and SpaceX officials, said the tower should be finished with construction by the end of 2023. While the plan right now is for Ax-3 to use SLC-40 and IM-1 to use LC-39A, it all depends on the tower’s readiness. If that doesn’t come to fruition in time though, sources tell Spaceflight Now that Ax-3 will get first priority to launch from LC-39A in January and the IM-1 mission would be delayed to a later date. Even if the new tower doesn’t get the clearance for use supporting Ax-3 in time for that mission, with increasing requests to launch more to the ISS and commercial space stations after that, it will certainly be a valuable asset for SpaceX and its customers heading into 2024 and beyond. A wide-angle view of the Space X Falcon 9 rocket test firing at Kennedy Space Center’s launch pad 39A during final preparations for it scheduled blastoff with the EchoStar 23 communications satellite. Flying through the sky at supersonic speed, a Falcon 9 rocket stage descended to a historic landing at Cape Canaveral on Monday, returning to the spaceport minutes after boosting 11 Orbcomm communications satellites toward orbit on SpaceX’s first mission since a major failure in June. The launch of another 60 Starlink internet spacecraft from Cape Canaveral Sunday thrust SpaceX past a major milestone in rocket reuse: the 10th successful flight of a Falcon 9 booster. The mission marked the fourth SpaceX launch from Florida in 16 days, with the next batch of Starlink satellites due to blast off next Saturday. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX Falcon 9 rocket lifts off on 80th orbital launch of the year", "link": "https://spaceflightnow.com/2023/11/07/live-coverage-spacex-to-launch-falcon-9-rocket-with-23-starlink-satellites-from-cape-canaveral/", "date": "November 7, 2023", "description": "SpaceX completed the Starlink delivery mission from Cape Canaveral Tuesday night, the first of two planned Falcon 9 launches in less than 48 hours. Liftoff from pad 40 occurred at 12:05 a.m. EST (0505 UTC). ", "body": "Satellites deployed. SpaceX sent up 23 Starlink satellites during a mission from Cape Canaveral just on the other side of midnight, the first of two planned Falcon 9 launches in less than 48 hours. Liftoff from pad 40 occurred at 12:05 a.m. EST (0505 UTC). Near-perfect weather was forecast for the launch of 23 more satellites for SpaceX’s Starlink internet service. U.S. Space Force meteorologists at the 45th Weather squadron said Monday there was a greater than 95-percent chance of acceptable weather for launch. It was the first launch from Space Launch Complex 40 since to a recently-constructed tower as it upgrades the facility to handle crew and cargo Dragon flights. As the Starlink mission got ready to fly, at NASA’s neighboring Kennedy Space Center, SpaceX prepared to roll out another Falcon 9 with a Cargo Dragon for a space station resupply mission, scheduled for liftoff on Thursday at 8:28 p.m. EST (0128 UTC). On the other side of the country at Vandenberg Space Force Base, California, another Falcon 9 was being prepared for a Thursday launch of the Transporter 9 mission but it has now slipped two days to Nov. 11. It will carry a multitude of small satellites on a ride-share mission. The Falcon 9 booster for Tuesday’s Starlink 6-27 mission, tail number B1073, is making its 11th flight. It entered service in May 2022 carrying a batch of 53 V1.5 Starlink satellites. In addition to making five more Starlink deliveries, it launched the SES-22 satellite, ispace’s HAKUTO-R lunar lander and the Hispasat Amazonas Nexus satellite. It also helped deliver supplies to the International Space Station on the CRS-27 Cargo Dragon flight. After lifting off from Florida’s Space Coast, the Falcon 9 will head south-easterly targeting an orbit inclined 43 degrees to the Equator. After burning its nine Merlin 1D engines for nearly two and a half minutes, the first stage will separate from the second stage and continue downrange to land on the drone ship ‘Just Read the Instructions’ in the Atlantic Ocean, about 424 miles (682 km) from the launch site. The rocket’s payload fairing halves will splashdown on parachutes a little further downrange from the drone ship and be scooped up by the support ship ‘Bob’, named after Crew Dragon Demo-2 astronaut Bob Behnken. SpaceX recently released a photograph of a payload fairing half, which had made 13 flights, being recovered from the Ocean following the last Starlink launch. Meanwhile, high above, the single vacuum Merlin engine of the second stage will fire for about six-minutes to reach a parking orbit. After coasting for about 45 minutes, the second-stage engine will re-ignite for a three-second burn to refine the orbit. Deployment of the 23 V2 Mini Starlink satellites will follow at about one hour and five minutes after launch. SpaceX says it has more than two million subscribers worldwide for its Starlink internet service. It will be SpaceX’s 80th orbital launch of the year and the 270th flight of a Falcon 9 rocket to date. Spaceflight Now’s will get underway about an hour before liftoff. You can also watch 24-7 views of launch pads at the Cape in our stream. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches Falcon 9 rocket carrying 22 Starlink satellites on its second Friday launch", "link": "https://spaceflightnow.com/2023/10/13/live-coverage-spacex-to-launch-falcon-9-rocket-carrying-22-starlink-satellites/", "date": "October 13, 2023", "description": "A Falcon 9 rocket carrying 22 Starlink satellites, delayed by upper level winds and held up for the Falcon Heavy launch of NASA’s Psyche, is scheduled to liftoff from Cape Canaveral’s pad 40 at 7:01 p.m. EDT (2301 UTC) on Friday night. ", "body": "A Falcon 9 rocket carrying 22 Starlink satellites, delayed by upper level winds and held up for the Falcon Heavy launch of NASA’s Psyche, launched from Space Launch Complex 40 at Cape Canaveral Space Force Station at 7:01 p.m. EDT (2301 UTC) Friday night. The U.S. Space Force’s 45th Weather Squadron, based at Cape Canaveral, on Thursday predicted a 60 percent chance of acceptable weather for the first of today’s launch opportunities which improved to 80 percent chance at the end of the window. A launch attempt on Oct. 8 was aborted with just 23 seconds left on the clock. SpaceX said the delay was due to upper level winds. While a West Coast Starlink launch went ahead a few hours later, SpaceX put the Cape launch on hold at the request of NASA, which wanted to prioritize the Falcon Heavy launch of the Psyche asteroid mission, which launched earlier Friday. SpaceX didn’t need any of its five back up launch opportunities Friday, which ranged from at 7:51 p.m. EDT (2351 UTC) to 10:29 p.m. EDT (0429 UTC). The Falcon 9 carried 22 second-generation satellites for SpaceX’s Starlink internet service. The company announced recently that its now had more than two million subscribers for its broadband internet in more than 60 countries. After lifting off, the Falcon 9 headed southeast, targeting an orbit inclined at 43 degrees to the equator. The first stage booster, B1067, made its 14 flight, separating from the second stage about two and a half minutes into flight and then arcing downrange for a landing on the drone ship A Shortfall of Gravitas. The barge was stationed in the Atlantic Ocean, east of the Bahamas about 420 miles (675 km) from Cape Canaveral. Two burns of the Falcon 9’s second stage will be required to place the satellites into the required 182 x 176 mile (293 x 284 km) orbit. Separation of the satellite stack is scheduled to occur just over an hour into the flight. The Dragon supply ship set for liftoff from Florida next month was the last of SpaceX’s first-generation cargo capsules off the production line, meaning future logistics deliveries to the International Space Station will fly on recycled spacecraft until a new Dragon variant is ready. On the mission’s third launch attempt, SpaceX sent a Falcon Heavy rocket aloft at 8:26 p.m. EDT Sunday (0026 UTC Monday) from NASA’s Kennedy Space Center in Florida. The nearly five-hour mission to a near-geosynchronous orbit carried the first satellite for the ViaSat 3 space-based internet network, along with two smaller rideshare payloads. A SpaceX Falcon 9 rocket, flying with a first stage booster that was previously launched and recovered in May, lifted from Cape Canaveral at 1:18 a.m. EDT (0518 GMT) Tuesday with Indonesia’s Merah Putih communications satellite. The first stage accomplished a pinpoint landing on SpaceX’s drone ship in the Atlantic Ocean. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX launches Falcon 9 rocket on 47th Starlink launch of 2023", "link": "https://spaceflightnow.com/2023/10/17/live-coverage-spacex-prepares-falcon-9-rocket-launch-of-47th-starlink-launch-of-2023/", "date": "October 17, 2023", "description": "SpaceX launched 22 of its Starlink V2 Mini satellites to low Earth orbit from Space Launch Complex 40 at Cape Canaveral Space Force Station aboard a Falcon 9 rocket at 8:39 p.m. EDT (0039 UTC on Oct. 18). ", "body": "Launch at 8:39 p.m. EDT (0039 UTC). SpaceX followed up a double launch day on Friday, Oct. 13, with an evening launch of a Falcon 9 rocket, sending up another 22 Starlink V2 Mini satellites to low Earth orbit. The Tuesday evening mission from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station launched at 8:39 p.m. EDT (0039 UTC on Oct. 18). The Starlink Group 6-23 mission came just 4 days, 1 hour and 38 minutes following the last mission to launch from SLC-40, the Starlink Group 6-22 mission, which launched Friday evening at 7:01 p.m. EDT (2301 UTC). With a successful launch on Tuesday evening, SpaceX completed its 74th launch of 2023. Put another way, that means it has launched on average once roughly every 3.92 days. The company also stated in a post at the weekend on the social media site X that following Friday’s Starlink launch, SpaceX has sent more than 900 metric tons to orbit this year. The booster launching this mission, B1062, made its 16th flight, including launching the Inspiration4 civilian astronaut mission, the Ax-1 private astronaut mission and two GPS satellites. About 8.5 minutes after launch, it landed on the droneship, “Just Read the Instructions.” Highlights from Friday's Falcon 9 launch of 22 satellites. SpaceX has delivered more than 900 metric tons to orbit so far this year — SpaceX (@SpaceX) That last launch brought SpaceX one step closer to having 5,000 satellites on orbit. According to compiled by Jonathan McDowell, an astrophysicist and expert on spaceflight activity, of the 5,265 Starlink satellites launched to LEO as of Oct. 13, 4,905 of them are still in orbit and 4,874 are currently working. There are currently 467 Starlink satellites that have been launched to the current Group 6 shell of the constellation of which 448 are listed as “working.” This all comes as SpaceX is pushing towards its second integrated flight test of its Starship rocket from its Starbase launch and testing site in South Texas. The company restacked the upper stage, dubbed Ship 25, onto Booster 9 ahead of a planned wet dress rehearsal at a yet to be announced date. The Federal Aviation Administration (FAA) has not yet issued a launch license for the IFT-2 mission. SpaceX will use Starship to launch its Starlink Version 2 satellites, though in a fireside chat at a recent conference, founder Elon Musk referenced Version 3 satellites, so it’s unclear if the company is renaming the type of satellites that Starship will launch. “I think there’s a good chance we start deploying Starlink V3 satellites next year, roughly a year from now,” Musk said during his Oct. 5 remarks. Starship fully stacked while team prepares for a launch rehearsal. We continue to work with the FAA on a launch license — SpaceX (@SpaceX) A SpaceX Falcon 9 rocket ferried a multinational crew into orbit at the break of dawn Friday with a spectacular sky-lighting launch from NASA’s Kennedy Space Center in Florida, dazzling early risers along the East Coast with a flawless start to a planned six-month expedition on the International Space Station. As SpaceX gets ready for the maiden flight of its Falcon Heavy booster, watch a live feed of launch pad 39A at the Kennedy Space Center. (Members only) Hours after calling off a launch of a different rocket from a nearby launch pad, SpaceX’s launch team loaded a Falcon 9 rocket with propellant Saturday and fired its nine main engines on pad 40 at Cape Canaveral Air Force Station, setting the stage for a liftoff with a South Korean military satellite as soon as Tuesday amid a busy stretch of missions for the California-based rocket company. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX battles regulatory process that could hold up Starship test flight for months", "link": "https://spaceflightnow.com/2023/10/18/spacex-battles-regulatory-process-that-could-hold-up-starship-test-flight-for-months/", "date": "October 18, 2023", "description": "SpaceX leadership is heading to Capitol Hill on Wednesday to lobby for greater efficiency when it comes regulatory approval from the Federal Aviation Administration (FAA). The company is hoping to streamline the process of issuing launch licenses for both Starship test flights and more routine Falcon 9 rocket missions.", "body": " SpaceX leadership is heading to on Wednesday to lobby for greater efficiency when it comes regulatory approval from the Federal Aviation Administration (FAA). The company is hoping to streamline the process of issuing launch licenses for both Starship test flights and more routine Falcon 9 rocket missions. Ahead of the hearing before the U.S. Senate Subcommittee on Space and Science, the U.S. Fish and Wildlife Service told Spaceflight Now its regulatory approval process for the second Starship test flight could potentially last until the spring of 2024. In a statement on Tuesday, a FWS spokesperson said their agency received a final biological assessment from the FAA Oct. 5 and FWS has up to 30 days to review it. This came after the FAA sent FWS a letter in August, which requested “reinitiation of .” “Under Section 7 of the Endangered Species Act, reinitiation of formal consultation is required when a project and its impacts change significantly, the amount of take issued previously is exceeded, we have new information on listed species not previously considered, or a new species is listed,” the spokesperson said. “Reinitiation involving major changes in effects analysis or changes in the [FWS’] biological opinion are addressed fully in a new consultation. For SpaceX reinitiation with FAA, we are considering the operation of a water deluge system.” That new deluge system was part of a list of 63 corrective actions created as part of the SpaceX-led mishap investigation following the failed launch of the first integrated flight test on April 20, 2023. The system has been used a few times, including on a pair of static fire tests of Booster 9, which is set to be the next to fly for SpaceX, along with Ship 25. On Tuesday, the company unstacked the rocket after stacking it just a day before. Following Monday’s stacking operation, SpaceX said in a post on the social media site X, “Starship fully stacked while team prepares for a launch rehearsal. We continue to work with the FAA on a launch license.” However, that license could still be a ways off. Following the 30-day review of the final biological assessment from the FAA, the FWS has “135 days to issue an amended biological opinion.” That 135 days is comprised of the formal consultation period, which could last up to 90 days, and the process of crafting its biological opinion, for which it has 45 days. Spaceflight Now reached out to the FAA for comment on what actions it needs to take once it receives the FWS’ amended biological opinion. A spokesperson for the FAA said the agency “will announce whether any environmental mitigations are required for the water deluge system when the environmental review is complete.” Starship fully stacked while team prepares for a launch rehearsal. We continue to work with the FAA on a launch license — SpaceX (@SpaceX) The adjusted timeline comes as Bill Gerstenmaier, SpaceX’s Vice President of Build and Flight Reliability, prepares to testify before the Senate Subcommittee on Space and Science on Wednesday in a panel focusing U.S. commercial human space activities. Testimony from Gerstenmaier and representatives from Blue Origin, Virgin Galactic, National Aerospace Solution and CS Consulting, will run the gamut from “suborbital flights to lunar surface habitats.” That last one is key for SpaceX and the Starship program. The rocket was chosen as the Human Landing System (HLS) for the Artemis 3 and Artemis 4 missions for NASA. Several demonstration flights of Starship will be required before NASA will authorize its astronauts to fly aboard Starship. Those include a ship-to-ship refueling demonstration as well as an uncrewed lunar landing. In an with Ars Technica this week, a senior SpaceX official said that a backlog with FAA work caused them to make some tough calls on what they want the agency to prioritize regarding their launch vehicles. “Licensing at this point for Starship is a critical path item for the Artemis program and for our execution,” a SpaceX official said. “Certainly looking forward into next year, we really need to operate that program at a higher cadence of flights. Six to eight months turns, that’s not great for the program.” At the rate that regulatory approval is moving, that turnaround could theoretically become a year or more. SpaceX will not be making a Falcon 9 launch attempt Tuesday night. The next opportunities to launch the Falcon 9 with 60 Starlink satellites from pad 39A at the Kennedy Space Center will come at 3:24 a.m. EST (0824 GMT) or 5:42 a.m. EST (0942 GMT) Thursday. This change in launch time suggests SpaceX will target a different orbital plane within the Starlink constellation. SpaceX founder Elon Musk detailed progress on the company’s next-generation Starship program Monday, saying the huge rocket could “probably” attempt its first launch into Earth orbit next year, and adding that the Starship will fly hundreds of missions before SpaceX puts people on-board. A Falcon 9 launcher bolted into the sky over Florida’s Space Coast on Friday, adding the brilliant orange glare of rocket exhaust to a spectacular sunset as the 229-foot-tall booster propelled the SES 9 communications satellite into orbit to serve the Asia-Pacific with high-definition television programming and connectivity on-the-go. The first ones are usually the hardest. It’s important FAA AND FWD do their proper due diligence up front so it will be more difficult for the inevitable Naysayers to have basis for continued whining. Obviously all forms of life are precious. Every species is it’s own treasure. As a human I care about every amoeba to a degree but I do not want amoeba deaths or unwanted further delay of this vital Space program. Please do your due diligence thoroughly and professionally and promptly FWS. The entire world is literally waiting on you. Go Team FREEDOM WE WILL NEVER Stop Exploring Space! NEVER to surrect planets is how to live in a universe – mars belongs to life (once it rains fish can sutvive mars nature ) melt large amounts of ice with reflectors, boiloff be greenhouse insulation and atmospheric pressure Putting the regulating of rocketry and space into the hands of the FAA is an unmitigated disaster as you can see by what they have done so far. They dont care about anything but safety as they interpret it (anyway they feel like) preferably by not having a rocket program at all. As a former pilot I have been a victim of their overreaching rules. Their name is Federal Aviation Administration and their purview is aviation not rocketry. The development of space should be under NASA not the FAA. The FAA should be involved only as far as rocket launches affect planes. Their bringing in the FWS because of a little extra water is ridiculous.  What do they do when it rains? Give god a fine? If this persists – which it will if the FAA is involved – Musk may have to find somewhere else – I am sure he is considering it right now – like cape canaveral or another country? The FAA has extended their interpretation of responsibility for safety to cover rocketry. This is overreaching beyond what their original purpose was. They have already curtailed innovation in private aircraft through crippling bureaucracy. Good luck Musk you’re going to need it. Northern Mexico is just a few miles away.  I’m sure they’d love to have SpaceX Seems like the Government is still butt hurt over Twitter files release.  It’s going to be a bumpy road until we get new administration. Time to move the Space X program down to Mexico.  As well as combustion engine cars. Let’s get this program moving forward. It’s weird how they can use the deluge system for a big static fire,  but not for a launch which more or less has the same impact on nature. Why didn’t they start the assessment at the moment they did the first deluge test, and allow the launch while they do the assesment. As they already used it several times during some static fires and just tests, and they can see the impact after the system it used. The problem here isn’t necessarily the FAA, but NEPA (the National Environmental Policy Act). That requires an exhaustive environmental impacts analysis for everything federal agencies do or approve others doing. If NASA was the lead agency, they’d still have to do all the same NEPA analysis and Fish and Wildlife consultations. This isn’t the fault of any one single agency, it’s squarely the fault of an outdated law that made the deliberate decision to prioritize protecting the environment from even the most minute impacts over all other considerations in government policy. If you’re wondering why a few endangered sea birds are able to bring out entire national space program to a screeching halt, it’s because that’s exactly what NEPA is designed to do. Things won’t change unless NEPA is repealed or else Congress grants SpaceX a blanket exemption from environmental laws. Spacex enthusiastically dangled the FAA in front of their social media machine across ’21 & into ’22, as the excuse or “fallguy” for Starship’s delays, encouraging their fans to bemoan the FAA. In reality, Starship had protracted development delays. When they suddenly launched, it looked like the FAA was actually in their pocket, snapping out the license when SpX thought they were finally ready. For those who pay attention, the credibility of SpX is gone. In addition, they were just recently still working on the rocket again (though without press conferences, we all just have to guess what the work was). The FAA is now in a lawsuit, remember, for their lax cooperation with Spacex on 4/20, and for the resulting damage to all the surrounding area. The FAA now must try to show more caution as it executes the government’s duties, as well as the other agencies, on behalf of all involved. Mexico, Mehiiicoo! When the whole planet is over populated and at the currently thousands of people die every day because of this: it seems remaekedly short sighted to be legally, to the letter of the law, concerned that these rules are being followed. Let me understand.  Releasing some fresh water at a location that experiences hurricanes requires a complete rethink of previous extensive environmental impact studies.  This is insane and punitive.  This is not only a matter of advancing civilization, but a national security issue, as development of Starship is a huge national security advantage and represents the leading edge of spaceship development and myriads of projects that depend on (much) cheaper mass to orbit and beyond. The irony is that all the recent improvements to the launch complex and specifically the launch platform have lessened environmental impact.  This is an exercise in political influenced bureaucratic extortion by environmental groups that is running out of control. I have dealt with FWS, they are the worst agency.   Nothing but a pointless bureaucratic empire built by environmental zealots.   FWS should be refunded and removed. It’s very anti-American for the incompetent government “manana” men to delay SpaceX who is serving a Vital US Interest. It’s probably equal parts biden not liking Elon for his politics and half the usual tortoise pace of entitled government workers who know they can’t be fired and have benefits the rest of us don’t get (pensions). Fired is what they actually deserve. You can attack the regulatory environment all you want, but you can’t say SpaceX didn’t know the hurdles from the start. The main issue leading to this delay is Elon Musk’s insistence early on (while he still ran the Boca Chica operation) that there be no deluge system.  If SpaceX engineers had been allowed to design and implement the proper deluge system from the start, it could have been considered in the initial ER and we would not have this delay now. I am so glad Elon no longer runs the Starship program because he is clearly not competent on many of the technical aspects. The deluge system was part of the PEA. This is just slow walking by the government. I am tired of this current government stopping progress. Other countries are making us look bad. Not to mention they will be getting ahead of us if something is not done soon. SpaceX is kicking ass in this industry but soon they will fall behind by having their hands tied up. Let SpaceX fly. This could be Greenmail. Expect some environmental consultancy groups will prosper handsomely by this delay. I’m thinking that SpaceX should move it’s flight operations (including all launching activities) to Panama.  Not just for Starship, but for all SpaceX space vehicle activities.  Not only would this solve a huge bunch of bureaucratic issues but would lower costs and provide a more efficient launch location.  Oh and I would also relocate Starlink to a country that is more supportive of building a world class space space commercial data infrastructure. Yea, they should move…we can always fly to the moon from another country… The FAA and FWS are old antiquated agencies that have NO BUSINESS being in charge of any space related activities! If NASA wants SpaceX involved with the Artimis Mission they better get these FAA and FWS people off their dead asses! I swear it almost looks like these regulatory agencies are working with the Chinese communist party to help China catch up and pass SpaceX. These people are out of control and are a national security danger to the United States. All so that some birds and frogs don’t get scared from the noise. If you want a rocket that will allow real space exploration, then that thing is going to have to be big enough that it scares some wildlife. China will not let this stand in their way and they are catching up. These people are adding about seven or eight years at least onto the development process just for their ego. They will speaking mandarin on the moon a mars if Elon has to deal with the FAA. It’s a shit show. They’re not n the least bit interested  in getting it in the air. Now they’re waiting for the fish an game report really, Whats next. LET Elon fly or is it in the US INTEREST TO HOLD UP INNOVATION of anyone who doesn’t fit there mold. Comments are closed. © 1999-2023 Spaceflight Now Inc "}
{"title": "Commercial space companies say cut red tape or U.S. will lose its lead in spaceflight", "link": "https://spaceflightnow.com/2023/10/19/commercial-space-companies-say-cut-red-tape-or-u-s-will-lose-its-lead-in-spaceflight/", "date": "October 19, 2023", "description": "Blue Origin, SpaceX and Virgin Galactic representatives all called for improvements to the regulatory framework that governs spaceflight operations during a Senate subcommittee hearing on Wednesday, Oct. 18, 2023. ", "body": "The three companies who have flown people to space and back, Blue Origin, SpaceX and Virgin Galactic, joined two experts at a Congressional hearing to press for regulatory improvements, warning the U.S. risks losing its lead in spaceflight. The 1.5-hour-long hearing before the U.S. Senate Subcommittee on Space and Science was mainly focused on a regulatory framework called “Part 450,” which was designed to help streamline the process of issuing launch licenses under the Federal Aviation Administration (FAA) Office of Commercial Space Transportation, which goes by the acronym AST. The five witnesses argued that not only is the current regulatory framework not achieving its ideal goals, but it is stifling growth and innovation in the commercial launch market. “I want to state clearly that AST is an outstanding and important organization that needs more resources and immediate regulatory direction from Congress,” said Bill Gerstenmaier, SpaceX’s Vice President of Build and Flight Reliability in his opening remarks. “AST’s role is critical to enabling safe space transportation, but we’re at a breaking point.” “Licensing, including environmental approval, often takes longer than rocket development. This should never happen and it’s only getting worse,” he added. Currently, SpaceX is working through the regulatory review process in order to get a launch license modification for a second test flight of its Starship rocket. However, certain upgrades made since the first launch are still being reviewed by both the FAA and the U.S. Fish and Wildlife Service (FWS). In his , Gerstenmaier said that Starship has been ready to fly since mid-September and SpaceX is prepared to conduct the second integrated test flight “as soon as the end of this month,” but they have to wait until the regulatory process is concluded. “In order to successfully execute on its commitments, SpaceX plans to conduct at least two more Starship flights this year, with a higher flight rate in 2024 and beyond, pus and estimated 30 more Falcon flights for various customers, including the U.S. Government, before the end of the year,” he wrote. “The test and flight cadence across multiple vehicle families for SpaceX alone is most certainly not possible if Congress does not provide AST with additional resources, direction, and legislative guidance.” Starship also has great importance to NASA, since it was selected as the Human Landing System (HLS) vehicle to bring humans to the surface of the Moon on the Artemis 3 and 4 missions. “These delays may seem small in the big scheme of things, but a continuous delay of each and every test flight just adds up and eventually, we’ll lose our lead and we’ll see China land on the Moon before we do,” Gerstenmaier said. When asked by Sen. Ted Cruz (R-Texas) about the timeline for the HLS version of Starship, Gerstenmaier said it was hard to pin that down. “The burden should be put on us as a private company, put on SpaceX. Let us develop at the fastest pace,” Gerstenmaier said. “We should be the ones that are driving the development, not being driven by regulatory oversight.” The representatives from Blue Origin and Virgin Galactic, which both fly suborbital, crewed missions, agreed with SpaceX that regulation for human spaceflight should ensure safety for passengers and those who work on the program, adding that the so-called learning period before more regulations are added should not be allowed to expire on Jan. 1, 2024. That grace period was established through the Commercial Space Launch Amendments Act of 2004 has been extended a handful of times. , it prohibits the agency from “regulating the safety of individuals on board” commercial spacecraft. Caryn Schenewerk, the president of CS Consulting and a former employee of both SpaceX and Relativity Space, told the subcommittee that current FAA regulations do in fact protect crew members as part of the vehicle’s flight safety team and passengers have protections via their “training and acceptance of risk.” “Given the limited number of private human spaceflights, three orbital and ten suborbital, the ongoing opportunities for thoughtful engagement between the FAA and industry, as the FAA’s challenges with implementing its existing regulations, the original premise underpinning the learning period still appears solid,” Schenewerk said. Despite it being the focus of much of Wednesday’s hearing, the FAA wasn’t invited to participate in the discussion. “The FAA did not receive an invitation to testify at the hearing,” an FAA spokesperson said in a statement to Spaceflight Now. In his comments to the subcommittee, Phil Joyce, Blue Origin’s senior vice president of the New Shepard Business Unit, offered three points of suggestion to modify the FAA’s regulation over the commercial space sector: “Beyond the FAA, Congress should think broadly about how to build a framework for mission authorization. This should be correctly scoped to draw clear boundaries between agencies,” Joyce said. “We also recommend Congress designate a single agency as the hub for authorization of commercial space activity.” Sirisha Bandla, Virgin Galactic’s vice president of Government Affairs and Research, said an extension of at least eight years would be their recommendation. “I completely agree that we should not be moving the goalposts just to move the goalposts, but now’s the time because we have data, we have operators to discuss what that framework looks like. That’s the important part,” Bandla said. “The learning period should not lapse without having a blueprint for what a safety framework looks like for human spaceflight so that we can look at what areas need to be regulated, what are the consequences of that, making sure it’s still light touch to allow innovation and also, importantly, that the FAA’s resourced with the funds and expertise to carry out that framework.” Forecasters expect good weather on Florida’s Space Coast for liftoff of a Falcon 9 rocket early Tuesday with an Indonesian communications satellite. The first launch for Iridium’s next-generation mobile communications fleet has been pushed back four months — from December until April — to resolve a technical problem inside the spacecraft’s Ka-band communications payload. A Falcon 9 rocket powered by a recycled first stage lit its main engines for a hold-down firing on a launch pad Tuesday at Vandenberg Air Force Base in California in preparation for launch with an Argentine radar satellite on a mission that will feature the first SpaceX booster landing on the West Coast. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX Falcon 9 launches 21 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/10/21/live-coverage-spacex-falcon-9-to-launch-21-starlink-satellites-from-california/", "date": "October 21, 2023", "description": "A SpaceX Falcon 9 rocket lifted off with 21 Starlink satellites from Vandenberg Space Force Base in California at 1:23 a.m. PDT (4:23 a.m. EDT, 0823 UTC). It was the first of two Starlink delivery missions planned for Saturday. ", "body": "Falcon 9 launched A SpaceX Falcon 9 rocket lifted off with 21 Starlink satellites from Vandenberg Space Force Base in California at 1:23 a.m. PDT (4:23 a.m. EDT, 0823 UTC). It was the first of two Starlink delivery missions planned for Saturday. The Falcon 9 set off on a south-easterly trajectory after lifting off from Space Launch Complex 4 East (SLC-4E). It was SpaceX’s 22nd mission from the West Coast this year and its 75th orbital launch of 2023 overall. The first stage booster was making its 16th flight. It previously launched the Crew-1, Crew-2, SXM-8, CRS-23, IXPE, Transporter-4, Transporter-5, Globalstar FM15 and ISI EROS C-3 missions, plus six Starlink delivery flights. After completing its main burn, lasting about two and a half minutes, the first stage continued downrange to land on the drone ship ‘Of Course I still Love You’ stationed about 400 miles downrange (644km) in the Pacific Ocean offshore of Baja California. Deployment of the 21 V2 Mini Starlink satellites occured just over an hour after launch. The V2 Mini model is much larger than the previous V1.5 satellites. Equipped with upgraded antennae and larger solar panels, these next generation spacecraft can delivery four times the bandwidth of the previous satellites. This is the 28th launch of the V2 Minis since they were introduced in February this year. A second Falcon 9 is scheduled to launch on Saturday, this one from Cape Canaveral Space Force Station in Florida. Liftoff is scheduled for 10:17 p.m. EDT (0217 UTC) with 23 Starlinks aboard, the most V2 Mini satellites to be carried aloft on single mission. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX Falcon 9 launches 23 Starlink satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/10/21/live-coverage-spacex-falcon-9-to-launch-23-starlink-satellites-from-cape-canaveral/", "date": "October 21, 2023", "description": "A SpaceX Falcon 9 rocket launched from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station at 10:17 p.m. EDT (0217 UTC on Oct. 22) carrying 23 Starlink satellites. ", "body": "The Falcon 9 rocket launched on the first launch opportunity of the evening. SpaceX aced its second launch of the day with another Falcon 9 rocket, this time launching from the East Coast. The Starlink Group 6-24 mission lifted off at 10:17 p.m. EDT (0217 UTC). The mission was the 150th orbital launch for SpaceX from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station and the 58th launch from Florida’s Space Coast in 2023, breaking the record of 57 launches set last year. SpaceX is launching on average once every four days. The company is aiming to ratchet up their launch cadence substantially in 2024, as it recently announced it would aim to launch 12 times per month or 144 times over the course of the year using its Falcon 9 and Falcon Heavy rockets. Saturday night’s launch was the first time SpaceX has launched 23 of its Starlink V2 Mini satellites in one batch. The first-stage booster supporting the mission, tail number B1080, will be making its fourth flight after previously launching the Ax-2 mission to the International Space Station, the European Space Agency’s Euclid telescope and the Starlink Group 6-11 mission. About eight-and-a-half minutes after liftoff, the booster landed on the droneship, “A Shortfall of Gravitas.” This mission follows the , which launched from SLC-4E at Vandenberg Space Force Base at 1:23 a.m. PDT (4:23 a.m. EDT, 0823 UTC). SpaceX completed another another launch to add to the company’s Starlink broadband network Thursday. A Falcon 9 rocket lifted off at 8:46 a.m. EDT (1246 GMT) Thursday from pad 39A at NASA’s Kennedy Space Center in Florida. Hours after calling off a launch of a different rocket from a nearby launch pad, SpaceX’s launch team loaded a Falcon 9 rocket with propellant Saturday and fired its nine main engines on pad 40 at Cape Canaveral Air Force Station, setting the stage for a liftoff with a South Korean military satellite as soon as Tuesday amid a busy stretch of missions for the California-based rocket company. There were more successful space launches in 2014 than in any year since 1992, with Russia, the United States and China responsible for more than 80 percent of global launch activity. © 1999-2023 Spaceflight Now Inc "}
{"title": "NASA begins to chart path forward on its Mars Sample Return architecture following independent review", "link": "https://spaceflightnow.com/2023/10/24/nasa-begins-to-chart-path-forward-on-its-mars-sample-return-architecture-following-independent-review/", "date": "October 24, 2023", "description": "NASA is aiming to make a determination about the path forward for Mars Sample Return by the end of March 2024. ", "body": "The next decade will be a critical time for the exploration of Mars with the multi-agency Mars Sample Return (MSR) being the marquee mission. The undertaking has been decades in the making, but an independent review of the MSR architecture raised some key questions about the feasibility and cost. An overview of that and how NASA intends to respond to it was the focus of the fall meeting of the Mars Exploration Program Analysis Group (MEPAG) Steering Committee (SC). Members met virtually on Friday, Oct. 20, to discuss the findings. “The entire planetary science community sees the value of sample return as a means of addressing high priority science in the solar system,” said Dr. Vicky Hamilton, the current SC chair and planetary geologist at the Southwest Research Institute. “And while the MSR may be the first mission that would demonstrate the feasibility of robotically selecting and returning samples, it’s not the only destination.” “That said, independent of the scientific value of sample return, there are of course practical realities. And I think that’s really why we’re here today (Friday) and that is because doing sample return is hard,” Hamilton added. “There are technological hurdles, it’s going to cost more money than we’re accustomed to spending on the average Mars mission and there may be changes to what we’ve become used to as our Mars Exploration Program.” MSR will rely on components from both NASA and the European Space Agency (ESA) among others. In May 2023, NASA established its second Independent Review Board (IRB-2) to comb through its portion of the plan and create a third-party evaluation of the costs, technical saliency and the schedule set forth by NASA to make it all happen. During his remarks on Friday, Orlando Figueroa, the IRB-2 chair, noted that this committee was formed in part because the former MSR plans evaluated by the IRB-1 (chartered in 2020) were found to be “virtually non-executable.” “Technical issues indicated to us that the early planning dates for a ’27 or ’28 launch were simply not credible, a near zero probability that we’d be able to do it,” Figueroa said. “Moving to 2030 offers an opportunity, and looks it is possible, but the President’s budget doesn’t quite support that.” Figueroa pointed to one of the key challenges for MSR: budgeting. As he referenced, the Biden Administration’s proposal for NASA’s budget in FY24 included about $3.4 billion for Planetary Science, a roughly 5.7 percent increase from FY23 funding levels. Of that, MSR would be allotted $949 million, up from $822.3 million the previous year. But with the one, two punch of ballooning mission costs and a Congress that could either freeze spending at FY23 levels or reduce spending further current cost estimates are likely to pose a big challenge. The IRB-2 report noted that in order to hit a Launch Readiness Date (LRD) in 2030 for both the Sample Retrieval Lander (SRL) and the Earth Return Orbiter (ERO), they would need to spend between $8-9.6 billion “with funding in excess of $1 billion per year to be required for three or more years starting in 2025.” “This pushes the experience base of SMD (Science Mission Directorate). [James Webb Space Telescope] is the only large mission or flagship mission of this kind that required high levels of funding, but never exceeded $1 billion,” Figueroa said. “So, this puts a lot of stress on SMD, unless there is a relief valve provided somewhere and thus, one of the reasons for the recommendation for the agency to look at what other options may be available.” One of the options, Figueroa said, would be to put the launches of the SRL and the ERO on track for separate dates. Currently, the MSR architecture consists of four main buckets: Another suggestion in the report is to pass off the responsibility for ERO to the European Space Agency, noting that “This arrangement will allow [Goddard Space Flight Center] to work with ESA and Airbus without going through [Jet Propulsion Lab].” “Alternative architectures, I alluded to them in the programmatic analysis, they should be examined with clear guidelines provided by NASA headquarters for what is a reasonable and realistic yearly budget constraint, once again acknowledging that the price tag of all the options that we examine were in the $8-11 billion range regardless of architectural choices,” Figueroa said. “It may be closer to the lower end or to the upper end, depending on those decisions, but it behooves the agency to look at it carefully, so that you can come up with a realistic, technical and programmatic plan,” he added. “In our view, this mission should not be baselined until those things are resolved because otherwise, everyone is living under unrealistic expectations. That’s what put us in this situation to begin with.” NASA has quite a bit of headwind to face when it comes to charting a path forward on MSR. Sandra Connelly, the deputy associate administrator for NASA’s Science Mission Directorate, reiterated in her comments that the mission remains a high priority for NASA and stated that in 2024, the agency would “determine the budget alignment for the sustainable program.” “It does need to be sustainable fro ma cost, schedule and technical perspective and ultimately, we’re gonna focus on our partnerships with ESA and we need to make sure we have buy in across the board,” Connelly said. Jeff Gramling, the MSR Program Director, said as they navigate unknown budget constraints for FY24, they are bringing Steve Tebow from the Applied Physics Lab (APL) to be the chief engineer at the headquarters level. “He brings fresh eyes and he’s the one that’s leading the integrated team. As we go off and look at ways to not only add resiliency as Orlando spoke about, but how we also look at whether there are ways we can reduce cost,” Gramling said. “Orlando and his team, for instance, explicitly said we need to look at mission element phasing, for instance, to live within annual funding constraints. That’s something we’ll be looking at.” Dr. Lori Glaze, the director of NASA’s Science Mission Directorate’s Planetary Science Division, emphasized that gaining access to pristine samples from Mars is important towards the goal of studying the current or former presence of water as well as searching for signs of life. While discussing the funding challenges that PSD faces, Glaze said they would endeavor to stick to the guidance of the decadal report and not let the MSR costs exceed 35 percent of that office’s budget. “I actually find that guidance to be not only really practical, but really useful. It’s certainly something that Jeff Gramling and myself, in collaboration with Nicky Fox and Sandra at the SMD level, have really kept in mind as we think about, you know, how are we going to achieve and execute Mars Sample Return so that it doesn’t impact, in a negative way, the rest of the planetary portfolio,” Glaze said. She added that an important job for them is to keep what she termed “confirmed missions” on track. Those missions that have passed confirmation reviews include Psyche, Europa Clipper, VIPER and the Near Earth Objects (NEO) Surveyor missions. She said those are ones that have agreements with Congress on both cost and schedule. Glaze said they are also trying to protect the research and analysis programs’ budget as they consider cost-cutting efforts. She reiterated a that if the tighter federal budgets come to fruition, the New Frontiers program’s Announcement of Opportunity (AO) would slip to no earlier than 2026. “ and are also unlikely to be offered as long as these budgets are really tight. So, unlikely to come out over the next couple of years,” Glaze said. Connelly said NASA intends to respond to the recommendations of the IRB-2 report by the end of March 2024. On its second launch attempt after a propulsion problem prevented its light-class air-dropped rocket from reaching space last year, Virgin Orbit will try to deliver 10 experimental CubeSats into orbit as soon as Sunday on a mission booked by NASA five years ago for $4.7 million. An Airbus-owned, German-built outdoor science deck is set for launch Friday night from Cape Canaveral aboard a SpaceX Dragon cargo capsule, heading for the International Space Station to make the orbiting research outpost more accessible for commercial space experiments. Astronauts Doug Hurley and Bob Behnken say SpaceX’s Falcon 9 rocket was a “very pure flying machine” as it sped their Crew Dragon spaceship into orbit, but they said they were surprised by the rougher-than-expected ride on the Falcon 9’s powerful upper stage. © 1999-2023 Spaceflight Now Inc "}
{"title": "Spacewalking cosmonauts find radiator coolant leak", "link": "https://spaceflightnow.com/2023/10/25/russian-spacewalkers-to-inspect-leaking-radiator/", "date": "October 25, 2023", "description": "Two Russian spacewalkers floated outside the International Space Station Wednesday and isolated a leaking radiator as planned, apparently causing residual coolant still trapped inside to make its way to the leak site and spew out into space. ", "body": "Two Russian spacewalkers floated outside the International Space Station Wednesday and isolated a leaking radiator as planned, apparently causing residual coolant still trapped inside to make its way to the leak site and spew out into space. Cosmonaut Oleg Kononenko planned to sop up the pooling coolant with a cloth towel, but was told to leave the area immediately when he reported some of the liquid had made it onto a safety tether. He said none had reached his suit. The tether was secured in a bag and procedures were already in place to make sure the cosmonauts’ spacesuits were clear of any such contamination before they re-entered the space station at the end of the spacewalk. In the meantime, Kononenko and crewmate Nikolai Chub pressed ahead with work to attach a small synthetic aperture radar antenna to the hull of the Nauka module. One of its four panels failed to fully deploy and lock in place, and officials said adjustments would be made in a future spacewalk. Finally, Kononenko and Chub released a small student-built “nanosatellite,” but the solar sail propulsion system it was designed to test failed to deploy. After making a final attempt to coax the balky radar panel into place, the cosmonauts called it a day. Kononenko, making his sixth spacewalk, and Chub, making his first, began the excursion at 1:49 p.m. EDT when they opened the side hatch of the Poisk airlock compartment to the vacuum of space. The radiator in question was launched with the Russian Rassvet module aboard the space shuttle Atlantis in May 2010. The radiator and a small experiment airlock remained stored on Rassvet until earlier this year when spacewalking cosmonauts attached both to the Nauka multi-purpose laboratory module. The radiator’s installation went normally and valves were opened to route coolant from Nauka into its unfolded panels. But on Oct. 9, flight controllers noted flakes streaming from the area of the radiator. The flakes turned out to be frozen coolant that was spewing overboard. Kononenko and Chub checked and reset coolant loop valves, adjusting them to isolate the radiator from supply lines and photographing the leak site to help engineers figure out what caused it. Kononenko initially reported “the radiator is clean. I don’t see anything … I do not see any traces of coolant.” But he reported numerous “black spots” on one radiator panel and after the valves used to isolate the radiator from its coolant lines were adjusted, droplets of coolant could be seen leaking from a line connecting two radiator panels. The droplets combined to form a fairly large bubble around the leaking coolant line. Kononenko said the bubble was too large to sop up with the towel he had planned to use. Instead, the cosmonauts simply left it as is while engineers on the ground began considering possible courses of action. What might have ruptured the coolant line in the first place was not immediately known. It was the third coolant leak in less than a year for the Russians, starting with a massive rupture that disabled a Soyuz crew ferry ship last December. A similar leak developed on an unpiloted Progress cargo carrier earlier this year. The presumed cause of the Soyuz leak was a micrometeoroid impact. The Russians have not addressed the possible cause of the Progress leak or the one affecting the Nauka radiator. But it seems extremely unlikely micrometeoroids could have caused three such incidents in similar systems. In any case, shortly after the latest leak occurred the Russian space agency Roscosmos said in a post on Telegram that the lab’s primary coolant loop was not affected and “the crew and the station are not in any danger.” Kononenko and Chub were not planning any sort of repair. Their primary objective was to find and document where the leak originated and to isolate the radiator from coolant supply lines to prevent any future problems. © 1999-2023 Spaceflight Now Inc "}
{"title": "On-time Artemis landings by SpaceX, Blue Origin possible, but face “great challenges”", "link": "https://spaceflightnow.com/2023/10/27/on-time-artemis-landings-by-spacex-blue-origin-possible-but-face-great-challenges/", "date": "October 27, 2023", "description": "The head of NASA’s Human Landing System program sat down with Spaceflight Now to discuss the progress of getting humans back to the Moon for the first time since 1972. ", "body": "After a successful mission with Artemis 1 in November, 2022, and with the pieces of the Artemis 2 architecture coming together for a launch targeting late 2024, NASA continues to simultaneously push towards the big items that are key to the future missions. One of the biggest outstanding feats is getting ready to actually bring humans to the surface of the Moon. Overseeing that aspect of the missions, starting with Artemis 3, is Dr. Lisa Watson-Morgan, the manager of the (HLS) program operating at NASA’s Marshall Space Flight Center in Huntsville, Alabama. In a sit-down interview with Spaceflight Now amid the , Watson-Morgan said getting these landers ready for their debuts on the Artemis 3 and Artemis 5 mission respectively for SpaceX and Blue Origin provide both numerous challenges as well as unique opportunities. “I think we have great, great challenges in front of us,” Watson-Morgan said. “Right now, today, I don’t see anything that’s stopping us, but that’s today.” She pointed to some of the leaps forward in rocket capabilities from SpaceX as a barometer for pulling off the lunar landing capability of its Starship rocket. Watson-Mogran also noted that the Blue Origin-led team has Lockheed Martin as a partner, which brings expertise from the Orion program with it. “That’s the beauty of our model. We take the best of what our government does, our expertise, and then we take a leap with the technological innovation that industry says, ‘We need to do this in order to save costs and make a business case out of this and give you the value and the good price that we are,’” Watson-Morgan said. “That’s where it’s such an engineering art in that we have to balance what they need to do to be successful from a business standpoint and ensure paramount, tantamount that we’re doing all we can for crew safety. And the crew is lock-and-step with us on both Blue and on SpaceX.” Up to bat first for the HLS program is SpaceX with Starship. The vehicle is the upper stage of the two-stage rocket currently undergoing testing at Starbase near Boca Chica Beach in south Texas. SpaceX’s approach to its launch programs, whether its Starship or Falcon, has been a combination of flying, learning, fixing and trying again to get it right. During a fireside chat moderated by Watson-Mogran on Wednesday, Benji Reed, SpaceX’s Senior Director of Human Spaceflight Programs, phrased it as “launch is signal and everything else is noise.” “And really, when we say ‘launch,’ we’re talking about launching safely, we’re talking about launching reliably, but you’ve got to launch and you’ve got to do a lot,” Reed said. “And the beautiful thing about the Artemis program, and all of the different players and everyone working together under Artemis, is that all of these tests and all of these launches and all of these vehicles and everything that’s happening are all part of that signal of launch and test and go.” Watson-Morgan said her past experience as the deputy director of the Engineering Directorate at MSFC and more than 30 years as an engineer and manager leads her to “fully support and cherish” SpaceX’s approach to getting its lander ready. However, she added that, “I would be remiss if I didn’t say we’re concerned about the SpaceX schedule for HLS and the concern is that our critical path, even today, goes through these test flights.” SpaceX stated in a post on X on Tuesday, following a wet dress rehearsal, that they are ready for the second integrated flight test (IFT-2) “pending regulatory approval.” Thursday morning, the U.S. Fish and Wildlife Service (FWS) released its own statement, noting that it formally reinitiated Endangered Species Act consultation with the Federal Aviation Administration (FAA). “We have up to 135 days to issue an amended biological opinion, but do not expect to take the full amount of time,” the agency said. The opinion is concerning the water deluge system added to the Starship launch pad following the IFT in April. Starship and Super Heavy were loaded with more than 10 million pounds of propellant today in a flight-like rehearsal ahead of launch — SpaceX (@SpaceX) Watson-Morgan and her team are eager to see SpaceX return to flight, stating that they’d like to see around 15 to 17 launches of Starship en route to the crewed landing during the Artemis III mission. She said because SpaceX ticks off a number of objectives with each flight instead of getting everything done before launching once, these test flights are critical for developing the hardware that will eventually be used to support the HLS program. “Schedule for us is key and we are working very closely with SpaceX on ensuring that this next test, making sure that they’re ready for it, understanding what they hope to achieve from it and understanding the risk. And they are all high risk,” Watson-Morgan said. Watson-Morgan said in addition to the more highly visible flight test campaign, the HLS program and SpaceX have been stepping through some of the development milestones needed to support the version of Starship for the Artemis program. “We had a cold-start Raptor Vacuum test that was recently completed. They’re also working on smaller thrusters. We’re working through medical kit testing, training system delivery, testing crew displays. We’ve worked through how we’re going to handle mission authority on day of launch,” Watson-Morgan said. “So, in parallel, while the world stage sees all these magnificent tests, we are working closely with SpaceX on all the mission unique items and milestones and that is going along very smoothly. And they actually haven’t missed any of those.” This week, they are conducting a docking test. It’s a critical feature, since Starship will first have to be able to dock with the Orion spacecraft on the Artemis 3 mission and then with the Lunar Gateway during Artemis 4. In 2024, Watson-Morgan said seeing the propellant transfer demonstration is going to be a key factor. That will not only demonstrate an essential piece of SpaceX’s design for the Moon, Mars and beyond, but it will also call upon new assets for the launch company that have yet to debut. “That’s where we’re going to get to see multiple launches from multiple pads go into orbit and transfer some amount of fuel between the two. And that will be a really key indicator as to their readiness level,” Watson-Morgan said. “And once they get to that point and once that is achieved, it’s much smaller from there on out.” Looking ahead to 2024, they will also continue working on items within the crew cabin. “We’re working through flammability testing, to make sure, with our oxygen and pressure values that we’ll have for our exploration systems,” Watson-Morgan said. “[Checking] that the clothing, the laptops, they’re bagged properly and what happens if something gets out? So, we’re going through all kinds of testing with SpaceX and internally to NASA and then combining our data.” While Starship will be a very different vehicle from SpaceX’s other human-rated vehicle, its Dragon spacecraft, both Reed and Watson-Morgan said there is some overlap between the two. As Reed discussed some of the challenges they will face regarding lighting both while on the Moon and in transit to the lunar surface, there are a number of lessons that can be gleamed from Dragon. “We’ve been docking a lot of Dragons to Space Station. We’ve flown Dragon through a number of lighting conditions as we go through the LEO orbit, whether it’s going to Space Station or some of our free-flyer missions,” Reed said. “We’ve had a lot of opportunities to develop that.” Watson-Morgan said while standing up the HLS program, she said it was important to garner expertise from the Commercial Crew Program (CCP), for which the Dragon transports astronauts to and from the International Space Station. “I received a lot of good advice to try to keep your program office small, to keep some pointed experts up there and to be very close to the decision making. And I have followed suit with that’s exactly how we’re set up,” Watson-Morgan said. “We’re growing and it’s hard and I’ll tell you, some of the days are just so long, but I do think that that has served us well to date.” She added that as they were developing the contracts for the HLS program, they borrowed another item from CCP: having “unfettered access to the contractors’ and the providers’ base data so we can go search it. And if we can’t find it, we ask, ‘Hey we need to know where this is.’” “And they’re a lot more responsive because, in the Commercial Crew days, all that was kind of new and so, there was a lot of searching to try to get the information,” Watson-Morgan said. “Because if we can get that data to our civil servants, to our government team who has a lot of the expertise, then we can say, ‘Yes, this is acceptable. Use as is’ or ‘No, we need to material review board this and we need to determine whether or not its is still usable.” In addition to developing Starship for the HLS program, Watson-Morgan and her team are now also closely working with the Blue Origin-led National Team, which consists of Lockheed Martin, Draper, Boeing, Astrobotic and Honeybee Robotics. They are developing the Blue Moon Mark 2 (MK2) lander. It will be capable of transporting 20 metric tonnes in a reusable configuration and 30 metric tonnes, if it’s only going one way, according to John Couluris, the Senior Vice President of Lunar Transportation at Blue Origin. He said during the fireside chat on Wednesday that a lighter capability MK1 lander will be “announced shortly.” While the National Team wasn’t formally brought on board until May 2022 when it was awarded the landing contract on the Artemis 5 mission, they have the same set of mission requirements as SpaceX. Watson-Morgan said her team is spending roughly equal time between the SpaceX and Blue Origin-led teams, which are working on similar, but different technology challenges. “We have one team that’s not too terribly big, but certainly big enough to go in and do deeper risk-based insight dives on things like propellant transfer, because both Blue Origin and SpaceX have that,” Watson-Morgan said. “Different fuels and different architectures, but still, at the end of the day when you look at it, the cryo-fluid management is going to be key for both of them.” “The thermal properties of that is going to be key to that. And then, how long can they store the propellant and keep it on orbit? It’s basically the same type of skill required, although we know SpaceX is with methane and Blue Origin is with hydrogen.” Couluris said being able to crack that nut will be key not only for their lunar lander, but also for future solar system exploration. “If we can make hydrogen a storable propellant, zero boil-off systems, we’re now not only unlocking lunar resources, but the potential to open up things, such as NTP (nuclear thermal propulsion) or other propulsion technologies that go beyond,” Couluris said during Wednesday’s fireside chat. Watson-Morgan said her team holds weekly insight meetings with Blue Origin and more often, if needed, as they begin to work through their milestones, of which, it has completed two. One of those was the delivery of what Watson-Morgan called a “low-fidelity mock-up,” which she called “fantastic.” “I’m so excited to see Blue Origin here because the whole resiliency and competition part helps to keep each of the providers – it helps to keep their attention and their focus, I think, on what’s key to us and to NASA, which is a great benefit to the American public too,” Watson-Morgan said. She added that NASA’s HLS folks are traveling to see the mockup as well as a training simulator. Coming up in the near future Watson-Morgan said they will begin a certification baseline review with the National Team, which she described as akin to a system requirements review. “It’s where we go in and make sure they fully understand the requirements set that NASA laid out and we do an analytical assessment and review and review their analytical assessment of whether their requirements can actually meet what we said the needed to meet,” Watson-Morgan said. She said that’s coming up in two or three weeks and that her team is already reviewing the data ahead of that. “And then early next year, they’re going to have a preliminary design review. So, they’re hustling,” Watson-Morgan said. Both SpaceX and Blue Origin are off to the races with their landers, but the clock is ticking before they’re needed to be called up. Watson-Morgan doesn’t look past the practical hurdles that lie ahead for both landers, but remains confident that the thorough work being done for both will carry the day in the end. During her panel appearance on Wednesday, Watson-Morgan emphasized that NASA approach with this partnership is different from other undertakings when it comes to helping commercialize the Moon. She said to be successful, they need to “get very deep down into how they are doing things” and to do that work “upfront.” “We do it upfront so there are not questions or concerns or confusion as to how the system should be built in order for, later on, for our team to come in and be able to human-rate the system,” Watson-Morgan said. “So it’s super challenging. It’s super exciting. And all the time I get asked how do you sleep at night an I’m gonna tell you, I sleep very well because I take it one day at a time.” SpaceX launches its first Dragon capsule into orbit on a demonstration flight for NASA’s Commercial Orbital Transportation Services (COTS) program on December 8, 2010. (Membership Required) SpaceX launched a Falcon 9 rocket from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station at 11:38 p.m. EDT (0338 UTC), sending 22 Starlink satellites up to low Earth orbit. The successful maiden flight of SpaceX’s Falcon Heavy rocket in February was enough for the U.S. Air Force to certify the huge booster to carry the military’s most precious cargo into orbit, beginning with the mid-2020 launch of a classified payload under a $130 million contract awarded last week. © 1999-2023 Spaceflight Now Inc "}
{"title": "Intuitive Machines targets launch to the Moon in mid-January", "link": "https://spaceflightnow.com/2023/10/27/intuitive-machines-targets-launch-to-the-moon-in-mid-january/", "date": "October 27, 2023", "description": "The first lunar lander aiming for a touchdown at the Moon’s south pole has a new launch date. Intuitive Machines said Friday it is targeting the launch of its Nova-C lander on the IM-1 mission for no earlier than January 12, 2024.", "body": "The first lunar lander aiming for a touchdown at the Moon’s south pole has a new launch date. Intuitive Machines said Friday it is targeting the launch of its Nova-C lander on the IM-1 mission for no earlier than January 12, 2024. Trent Martin, the Vice President of Lunar Access at Intuitive Machines, told Spaceflight Now it’s a good feeling to finally reach this point. “We began this journey on IM-1 back in 2019. Hoping to launch a little bit earlier. We ran into some technical difficulties and solving those problems means getting to this point, where you have a vehicle and it’s ready to go launch, make it even more exciting because you know you solved some problems, some really technical, difficult problems,” said Martin, who was attending the von Braun Space Exploration Symposium in Huntsville, Alabama. “We’re ready and the vehicle’s tested and checked out. Everything we need to do is wrapped up and ready to go. Just getting ready to ship it down to the Cape.” Martin said the Nova-C lander will be transported from the company’s facilities in Houston, Texas, down to Florida in late November for final pre-launch processing. The IM-1 mission is bound for the Moon’s South Pole and is targeting a landing site near the Malapert A crater, which is located at 80.4 degrees south and was chosen for its generally flat landscape. That is helping to drive both the launch date and the length of the launch window, Martin said. In general, he said each month has a window around three to six days. They would land around five to seven days after launching from the Cape. For IM-1, Martin said Jan. 12 is the start of the planned launch window that month and they are working alongside their launch partner, SpaceX, to further refine the full scope of that. Each day of the launch window holds an instantaneous launch opportunity. “It is a really hard orbital dynamics problem that requires not only my GNC (guidance, navigation and control) team, but also my landing team because we’re looking at the trajectories, we’re looking at the position of the Moon relative to the Earth at launch and then we’re looking at what is the position of the Sun and the Earth at landing on the Moon,” Martin said. “So, you want to make sure that we have sunlight so we can power our systems and make sure we have communication back to the Earth.” Martin said the first couple of missions to the Moon for them will use direct-to-Earth transmissions for their communications. The IM-1 mission is part of NASA’s (CLPS) initiative, a series of indefinite delivery, indefinite quantity contracts that have a total maximum value of $2.6 billion over a 10-year period. The undertaking was announced back in April 2018 with the first task orders issued on March 26, 2019, to nine companies. Intuitive Machines has been three missions to date The lander for the IM-1 mission carries with it for NASA: NASA described its suite of payloads as having a “focus on plume-surface interactions, space weather/lunar surface interactions, radio astronomy, precision landing technologies, and a communication and navigation node for future autonomous navigation technologies.” “In some cases, on the NASA payloads, we have a couple of payloads that are operational during the landing,” Martin said. “And for those payloads, we’re gathering that data and we’ll send it back once we land on the Moon.” There are also a series of commercial payloads on board the lander, including one of Martin’s favorites: a camera system dubbed “EagleCam,” which was developed by students at Embry-Riddle Aeronautical University in Daytona Beach, Florida. Intuitive Machines’ founder, Steve Altemus, issued a challenge to build the camera during a campus visit in 2019. The camera is designed to capture a third-person perspective of the Nova-C lander touching down on the Moon’s surface. “As we’re coming down, we’ll be about 30 meters above the surface, we fire EagleCam off with a CubeSat deployer and the camera itself is actually multiple cameras, four cameras. So as this 1U CubeSat tumbles, it’s taking video imagery as it falls to the surface of the Moon,” Martin said. “From that, within a day or two, we’ll have video of us landing on the Moon. So, I’m super excited for that one.” Martin said it will take roughly five to seven days after launch for the lander to get to the Moon and then about a day before touching down on the surface, although the timeline will continue to be refined as launch day approaches. Operations will be run out of Intuitive Machine’s “Nova Control” center at the company’s headquarters in Houston. About 90 seconds after spacecraft separation from the Falcon 9’s second stage, the lander will be powered on and begin to acquire telemetry and other data about the health of the spacecraft. Martin said within a few hours of that time, they will also conduct an initial checkout of the engine with a test firing. “We then do multiple trajectory burns to slightly update our trajectory on the way to the Moon,” Martin said. The final trajectory burn will put them in orbit about 100 kilometers above the Moon’s surface where they will remain for about 24 hours as they plan their powered descent down to the ground, which lasts about 15 minutes. The lander is intended to be in orbit around the Moon for roughly 24 hours since they have a cryogenic system. The longer they stay in orbit, the warmer the propellants become. “Once we begin that burn, we do not turn off the rocket engine. It stays lit the entire time all the way to the surface. We do have the ability to adjust the thrust on our vehicle, so we can actually throttle down from our 100 percent burn down to almost 20-25 percent of the overall thrust,” Martin said. While they do have a target landing site in mind, there are backups and they will aim for the safest one for the lander. After touchdown, they will vent off remaining fuel before beginning other operations. The duration of the mission will run between six and 14 days, depending on where they land, and will be in operation 24-hours a day until it goes dark during lunar nighttime. “When it goes dark, we fully intend, on these first missions, we will definitely lose power to the spacecraft and because of that, it is very likely that it won’t turn back on,” Martin said. “We will attempt to turn it back on after the first night, but if it doesn’t come back on, our goal is to complete all of our science objectives during the first [lunar] day.” While SpaceX was able to use its launch pad at Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station for ispace’s Moon-bound lander, Intuitive Machine’s Nova-C lander needs to launch from Launch Complex 39A (LC-39A) at NASA’s Kennedy Space Center. The special accommodations are because the IM-1 lander uses a propellant mix of liquid oxygen and liquid methane and needs to be fueled at the launch pad in the run-up to launch. But to do that, they need to have access to the payload, which is where the crew and cargo access tower comes into play. Another such tower is in the works at SLC-40, but it won’t be fully operational in time for this mission. “We actually do a wet dress rehearsal several days before the launch. So we will actually do a full fuel of our vehicle to ensure we have the timeline down,” Martin said. “We want to fuel as late as possible. SpaceX has been very accommodating and they’re providing us a service that gives us liquid oxygen, liquid methane. They’ll fill up until the very last minute, so that we’re as full as possible and we have the highest chance of success at landing on the Moon.” The significance of launching their mission to the Moon from the same pad used during the Apollo era is also not lost on Martin or his team. “39A is Apollo 11. Come on, you can’t beat that! You’ve got Apollo, you’ve got Space Shuttle. I launched… payloads that I flew on Space Shuttle off of that. It’s kind of coming home for me,” Martin said. “It’s the future with Artemis and CLPS and it’s the past with Apollo — all in a culmination of two new space companies with SpaceX and Intuitive Machines launching off an Apollo pad.” With Martin’s decades long experience both in the government and private space sectors, he’s seen numerous payloads head up to space. But he said it doesn’t diminish the feeling he gets whenever it gets down to launch time. “When it gets there and it’s actually at the pad, and it’s rolled up and you can see it, it’s like watching ‘The Right Stuff.’ It’s like watching any of the space movies,” Martin said. “You almost feel the music, the same music that they play in Hollywood. You like feel it in your soul as you’re watching your spacecraft put on board a launch vehicle knowing that the next destination, in this case, the next destination is the Moon. In our case, landing at the South Pole of the Moon.” While the historical parallels are enticing, Martin said they’re also not losing sight of the daunting challenge that landing safely on the Moon presents. He said surmounting those challenges will be the key to opening up a successful Earth-Moon economy. “You plan for years and you develop hardware for years and software for years that you think will be exactly what you need, only to find it’s not exactly what you need. And so, those lessons that we’re going to learn on this first mission will apply to IM-2 and to IM-3,” Martin said. “I’m sure we will learn something that will change the way we operate the next vehicle, that will change the way build a piece of technology that we have in the next vehicle.” “Hopefully we don’t have something that leads to a catastrophic failure, but it’s possible, right? It’s a risky business that we’re in. We did our best to minimize the risk as best possible, but half the missions to the Moon have failed, even from the sovereign nations,” Martin added. “The fact that the Russians just tried just a few months ago and failed, tells you that it is hard.” Martin said as they’ve gone along, they’ve looked at the missions that succeeded in landing on the Moon, but also in particular the ones that failed. He said it’s key to understand why those failed and learn from the mistakes of those who came before them. “We’re excited to go try these shots on goal and our hope is that we’re Michael Jordan — we hit every one — but there is risk involved in the space business.” Forecasters predict near-ideal weather conditions Monday night for the first launch at Cape Canaveral this year, when SpaceX plans to send another 60 Starlink broadband satellites into orbit atop a Falcon 9 rocket. Astronauts Mike Hopkins and Victor Glover floated back outside the International Space Station Monday and completed solar array battery replacement work that began four years ago. They also installed three new video cameras and made preparations for upcoming work to install new roll-out solar blankets to upgrade the lab’s power system. NASA announced Monday that the launch of the first operational crew rotation mission to the International Space Station on SpaceX’s Crew Dragon spacecraft is set for the predawn hours of Halloween, eight days later than previously planned. © 1999-2023 Spaceflight Now Inc "}
{"title": "Simple settings tweak should save Psyche asteroid mission from overheating thrusters", "link": "https://spaceflightnow.com/2023/10/02/simple-settings-tweak-should-save-psyche-asteroid-mission-from-overheating-thrusters/", "date": "October 2, 2023", "description": "NASA’s Psyche spacecraft, now scheduled for launch on Oct. 12, will dial down the power of its maneuvering system after engineers discovered its thrusters were in danger of overheating during its eight-year expedition to explore a metallic asteroid. ", "body": "NASA’s Psyche spacecraft, now scheduled for launch on Oct. 12, will dial down the power of its maneuvering system after engineers discovered its thrusters were in danger of overheating during its eight-year expedition to explore a metallic asteroid. The $1.2 billion mission was just two weeks from the opening of its launch window when testing of a spare thruster in a ground test bed revealed higher than expected temperatures. At first, engineers based at NASA’s Jet Propulsion Laboratory (JPL) suspected it was an isolated problem with the test bed equipment, but it soon became clear the thrusters installed on Psyche were also affected. “The data that had come from the subcontractor about these cold gas thrusters was incorrect,” said Lindy Elkins-Tanton, Psyche’s Principal Investigator. The way the spacecraft was designed to operate was based on those specifications. It was potentially another major blow for a project already delayed a year by late software, that had also faced challenges developing and building a spacecraft during the COVID-19 pandemic. When thruster problem was discovered, the Psyche spacecraft was nearing the end of pre-launch preparations at the AstroTech processing facility in Titusville, Florida, near Kennedy Space Center. If any hardware changes were required, the mission could have missed its 20-day launch window and faced another long delay or even cancellation. “It did pass through my mind: can we not catch a break?” said Elkins-Tanton. But it was quickly determined that the overheating could be avoided by a relatively simple change to one of the parameters governing the thrusters. Instead of operating at the planned 80 percent of their maximum rated thrust, they would be limited to 30 percent. “Thank god we’ve got this great team,” said Elkins-Tanton. “I have really transisted to a place of total gratitude that they found this before we launched. And it was just fortuitous.” If engineers had not caught the problem, the higher than expected temperatures could have damaged the thrusters. “It could have had a real mission impact,” said Elkins-Tanton. Psyche’s 12 thrusters use pulses of nitrogen to turn and orient the spacecraft. These so-called cold gas thrusters are a separate system from the xenon-fueled ion engines that will propel the spacecraft on its journey to the asteroid belt. Operating at the lower thrust level will mean the spacecraft will turn at a slower rate, such as when it manuevers to point its antenna at Earth or to focus its science instruments on the asteroid. The mission team has been running simulations and tests to ensure the fix does not have any unintended consequences. NASA delayed the launch of Psyche by a week to complete the testing. “We’ve been working 24/7 and it looks like it’s all going to work,” said Elkins-Tanton. “At the moment, all the tests that we’ve run — continuous, thousands of tests — have shown we’re okay at 30 percent.” Once all the testing and validation is completed, the revised thrust setting will be included in an already planned pre-launch update of the mission’s parameters. If all goes according well, Psyche will be encapsulated inside the two halves of its 43-foot-tall (13.1 meter) payload fairing on Tuesday, Oct. 3. It will be moved to launch complex 39A at the Kennedy Space Center and attached to its SpaceX Falcon Heavy rocket on Monday, Oct. 9. Liftoff is scheduled for Thursday, Oct. 12 at 10:16 a.m. EDT (1416 UTC). The mission has a launch opportunity every day up to and including Oct. 25, after which its 2023 launch window closes. The Psyche mission will be the firs to explore a rare metallic asteroid, thought to be the remnants of a protoplanet that was stripped to its core by a giant impact. The asteroid, officially titled 16 Psyche, is irregular in shape, with an average diameter of about 140 miles (226 kilometers), and is made up of mostly of nickel and iron metals. It resides in the outer part of the asteroid belt, which lies between the orbits of Mars and Jupiter. The probe will spend 26 months orbiting the asteroid after arriving in the summer of 2029. The scientist in charge of NASA’s OSIRIS-REx mission hopes to apply more than $30 million in leftover funding toward reducing the risk of the probe’s touch-and-go maneuver to snag a piece of asteroid Bennu, then eventually hire more experts to analyze the primordial specimens when they return to Earth in 2023. In the ten years since its launch from Cape Canaveral, NASA’s Dawn spacecraft has orbited the two largest worlds in the asteroid belt and overcome defective components that threatened to derail the mission on its 4 billion-mile voyage, discovering unexpectedly rich geologic tapestries suggesting both destinations have a watery past. NASA’s $1.2 billion Psyche mission to a metal-rich asteroid has lifted off atop a SpaceX Falcon Heavy rocket. Launch from pad 39A at NASA’s Kennedy Space Center is occurred at 10:19 a.m. EDT (1419 UTC) Friday. © 1999-2023 Spaceflight Now Inc "}
{"title": "Northrop Grumman leaves behind solo commercial space station venture, partners with Nanoracks on ‘Starlab’", "link": "https://spaceflightnow.com/2023/10/05/northrop-grumman-leaves-behind-solo-commercial-space-station-venture-partners-with-nanoracks-on-starlab/", "date": "October 5, 2023", "description": "About a year and a half after signing a Space Act Agreement with NASA to develop a commercial space station, Northrop Grumman formally withdrew from its solo plans in order to partner with Nanoracks, a subsidiary of Voyager Space. ", "body": "About a year and a half after signing a Space Act Agreement with NASA to develop a commercial space station, Northrop Grumman formally withdrew from its solo plans in order to partner with Nanoracks, a subsidiary of Voyager Space. Under this new venture, Northrop Grumman will provide cargo transportation services for the commercial space station dubbed “Starlab.” To that end, the Cygnus spacecraft will be upgraded to allow for autonomous docking with the future space station. It’s a feature currently available on the SpaceX Cargo Dragon spacecraft as well as Roscosmos’ Progress spacecraft. Currently, Northrop Grumman’s Cygnus spacecraft is berthed to the International Space Station using the Canadarm2 robotic arm. “This collaboration is a major step forward for the Starlab program,” said Dylan Taylor, Chairman and CEO of Voyager Space in a statement. “Northrop Grumman’s technical capability and proven success in cargo resupply services will play a pivotal role as we accelerate Starlab’s development. We’re proud to be supporting advanced docking systems that push LEO transportation operations forward and advance critical technology for deep space exploration. We are thrilled to have Northrop Grumman on our Starlab team.” In addition to upgrading Cygnus, Northrop agreed to deliver cargo to Starlab over a five-year period. “We are fully committed to the future of commercial LEO. Our new role with Starlab supports NASA’s initiatives to encourage commercial space station development as part of a growing LEO economy,” said Steve Krein, Vice President of Civil and Commercial Space at Northrop Grumman, in a statement. Back on Dec. 2, 2021, Northrop Grumman was one of three free-flying commercial space stations designed to garner financial support from NASA as part of the Commercial Low-Earth Orbit Development program along with Blue Origin and Nanoracks. The three were awarded a combined $415.6 million from the agency under a milestone-based agreement: Separately on Feb. 28 2020, NASA awarded Axiom Space a firm-fixed price, indefinite-delivery, indefinite-quantity contract of up to $140 million to provide at least one habitable commercial module that would attach to the ISS. In his selection statement letter dated Dec. 1, 2021, Philip McAlister, NASA’s director of commercial space, ranked all of the free-flying space station proposals on a scale of confidence with blue representing “Very High Level of Confidence” and red representing “Very Low Level of Confidence” with green, white and yellow being the gradient in between. Northrop Grumman’s proposal received a green rating for its technical approach, noting that its strengths including initial operating capacity supporting four crew members, a modular architecture and a robotic arm. The plan scored a yellow rating for its business plan, brought on by what McAlister describes as having “very low private investment, an unsubstantiated financing plan and no schedule provided past (Preliminary Design Review).” Northrop Grumman’s plans included up to six docking ports, crew capacity for up to eight people in its second stage configuration and science facilities, among other things. “Under this agreement, the Northrop Grumman team will deliver a free flying space station design that is focused on commercial operations to meet the demands of an expanding LEO market,” said Steve Krein, Northrop Grummans’ vice president of civil and commercial space, in a 2021 statement. In a statement about the new arrangement, NASA said that to date, $36.6 million of the $125.6 million potential had been awarded for reaching certain milestones: In a March 2023 blog post, which has since been removed from its website, Northrop Grumman described some of these milestones, stating that in January it “provided an update on our marketing and business development strategy and business model to attract customers and add additional partners to help develop the commercial LEO economy.” Northrop Grumman also said that it had completed its System Requirements Review (SRR) by then as well. “The SRR with NASA examined the functional, technical, performance, and security requirements for our concept,” Northrop Grumman said in the now deleted post. “It marks a tangible step forward that, paired with our ongoing outreach to commercial partners, brings our station concept one step closer to reality.” McAlister argued that Northrop Grumman’s shift away from its own station is not a bad thing. “This is a positive development for the commercial low Earth orbit destinations effort,” McAlister said in a statement on Wednesday. “Northrop Grumman has determined that its best strategy is to join the Nanoracks team and NASA respects and supports that decision.” “We continue to see a strong competitive landscape for future commercial destinations and I am pleased that Northrop is staying with the program.” Regarding the remaining $89 million that was part of Northrop’s original award, NASA said it will take that money “and other program funding to add milestone to the agency’s existing agreements with the other currently funded destination partners including Voyager Space/Nanoracks, Blue Origin and Axiom Space, assuming NASA and the companies can agree on the additional milestones and value.” “Commercial destinations are a critical capacity for NASA as we transition low Earth orbit operations to private industry and open access to space. Refining strategies and evolving partnerships are part of the process as we build a robust low Earth orbit economy where NASA is one of many customers,” said Angela Hart, the manager of commercial low Earth orbit development program at NASA’s Johnson Space Center. “This opportunity provides us the ability to reduce risks and have more insight into our partners’ technical designs.” Watch as a Falcon 9 rocket with the first Crew Dragon capsule atop, briefly fired its engines for a crucial pre-launch test on Jan. 24, 2019. Astronauts will likely perform a previously-unplanned demonstration of the Orion spacecraft’s deep space rendezvous capabilities in a high-altitude orbit around Earth on the crew capsule’s first piloted test flight, now scheduled for 2023. Former astronaut Al Worden, who orbited the moon and performed the first spacewalk in deep space in 1971, died Wednesday in Texas. He was 88. © 1999-2023 Spaceflight Now Inc "}
{"title": "Atlas 5 delivers first Amazon internet satellites to orbit on Friday", "link": "https://spaceflightnow.com/2023/10/05/atlas-5-to-deliver-first-amazon-internet-satellites-to-orbit-on-friday/", "date": "October 5, 2023", "description": "Amazon is getting its own delivery fulfilled this Friday, adding to an extensive portfolio that includes its online marketplace, streaming video, grocery and cloud services, with the launch of two prototype relay stations for a space-based internet service it calls Project Kuiper. ", "body": " The Atlas 5 rocket successfully lifted off on Friday afternoon at 2:06 p.m. EDT (1806 UTC). Shortly before 3 p.m. EDT (1900 UTC), ULA stated that they had “precisely” delivered the payload to orbit, marking the company’s 158th launch. ULA said that their next launch will be for their Vulcan rocket, launching the Astrobotic lunar lander, Peregrine. Amazon is getting its own delivery fulfilled this Friday, adding to an extensive portfolio that includes its online marketplace, streaming video, grocery and cloud services, with the launch of two prototype relay stations for a space-based internet service it calls Project Kuiper. The satellites, dubbed KuiperSat-1 and KuiperSat-2, are set to launch on Friday, Oct. 6 during a two-hour launch window that opens at 2 p.m. EDT (1600 UTC). They are hitching a ride to low Earth orbit atop a United Launch Alliance (ULA) Atlas 5 rocket. This will be the 20th ULA launch for a non-government, commercial customer. It’s also the 99th launch of an Atlas 5 rocket to date and the 8th launch in the 501 configuration, which doesn’t use side-mounted solid rocket boosters. The rocket rollout out to the launch pad at Space Launch Complex 41 (SLC-41) at Cape Canaveral Space Force Station Thursday morning. ULA said in a Sept. 29 that about 18 minutes after liftoff, the pair of satellites will be deployed at an altitude of 311 miles, or 500 kilometers above the Earth’s surface, at an inclination of 30 degrees. At the request of Amazon, ULA will not provide live coverage after the Centaur upper stage separates from the first stage. The prototype duo will not become a long-term part of the constellation of more than 3,200 satellites Amazon plans to deployed over six years, starting in the first half of 2024. The company said the test satellites will be commanded to de-orbited “at the end of the mission,” which is expected to last one year. During that time, Amazon will work on producing its full-production satellites while it learns from the demonstration versions. “We’ve done extensive testing here in our lab and have a high degree of confidence in our satellite design, but there’s no substitute for on-orbit testing,” said Rajeev Badyal, Project Kuiper’s vice president of technology, in a statement. “This is Amazon’s first time putting satellites into space, and we’re going to learn an incredible amount regardless of how the mission unfolds.” Amazon stated that they made an initial investment of $10 billion for Project Kuiper. Recent investments include their that’s being constructed on property leased by Space Florida at NASA’s Kennedy Space Center and a new, 172,000-square-foot manufacturing facility in Kirkland, Washington, which Amazon said will enable the production of five satellites per day. Amazon’s foray into the satellite internet game puts it in direct competition with other large satellite constellations, like SpaceX’s Starlink service and the newly combined forces of Eutelsat and OneWeb, now collectively known as “Eutelsat Group.” The Federal Communications Commission (FCC) granted approval for Amazon to deploy and operate its Ka-band, non-geostationary satellite orbit (NGSO) constellation (Kuiper-Ka System) which will consist of 3,232 satellites. Their initial request was for 3,236, but Amazon requested to reduce that number in a . According to a 2019 FCC filing, the satellites will operate in 98 orbital planes at altitudes of 590 km, 610 km and 630 km. The Kuiper System will use frequency bands from 17.7-19.3 GHz for customer links and 19.3-20.2 GHz along with 27.5-28.35 GHz for its gateway Earth stations. The FCC limited operations in the 17.7-17.8 GHz band to outside the U.S. With its initially proposed 3,236 satellites, Amazon intends to use the following altitudes and inclinations:  Amazon noted in that filing, that customer service would begin following the deployment of the first 578 operational satellites, dubbed “Phase 1,” which will head to an altitude of 630 km with an inclination of 51.9 degrees. “Coverage begins at 56 degrees North and 56 degrees South latitudes and quickly expands toward the equator as more satellites are launched,” Amazon said in its filing. There are five planned phases in this initial collection of satellites. The company said it expected to be in beta testing with early commercial customers by the end of 2024. In an FCC filing approving of Kuiper Systems LLC’s orbital debris mitigation plan, the agency stated that Kuiper has to provide semi-annual reports by January 1 and July 1 each year describing things like the number of conjunction events during each six-month period (how often a Kuiper satellite come close to another on-orbit object); how often and why satellites were removed from operation; and disposal failures. Kuiper also needs to submit annual reports to the FCC regarding cooperation with the National Space Foundation (NSF) on its efforts to mitigate impacts to optical astronomy. Amazon is also mandated to launch 50 percent of the proposed maximum satellites and have them in operation no later than July 30, 2026, with the remaining satellites launched and operational by July 20, 2029. To do so, Amazon contracted 77 launches, with as many as 92 launches, between Arianespace, Blue Origin and ULA: Much surrounding the Project Kuiper satellites remains a mystery. The company has not disclosed basic specifications, like the satellites’ dimensions, nor has it published photos or renderings of the spacecraft themselves. It did confirm that the two prototype satellites launching on Friday were manufactured at Amazon’s 219,000-square-foot facility in Redmond, Washington. In the run-up to launch, Amazon shared a photo of the satellites’ shipping containers featuring gag warning labels reading “Danger Velociraptor Containment: Carnivore handlers only within 50 feet.” One of the crates also featured stickers of claw marks. However, regulatory filings do help fill in some of the blanks. Regarding propulsion, Amazon previously noted that each Project Kuiper satellite uses a Hall-effect thruster, a type of ion engine in which propellant is accelerated by an electrical field. A from Amazon stated that the propellant is Krypton, one of the noble gasses. That same filing stated that the launch of KuiperSat-1 and KuiperSat-2 will be “directly injecting both satellites into the 590 km altitude at 33-degree inclination” with an orbital period of 96.5 minutes. This information differs from the 30-degree inclination ULA has stated. The prototype satellites will communicate with a gateway Earth station antenna located in McCulloch County, Texas, which is about 150 miles northwest of San Antonio. Amazon published a visual representation of its planned testing sequence: Each of the two prototype satellites include a series of antennas and receivers: Amazon will also be testing customer terminals as part of this mission. The tech giant said it would “perform a propulsive de-orbit at the end of the mission, resulting in expected demise within one year.” If that proves unsuccessful, Amazon said a passive de-orbit would occur within roughly 3.5 years. Amazon said once the service is available, it will allow delivery of “fast, affordable broadband from space,” but so far has not disclosed the cost of the service. As it prepares for its first on-orbit satellite demonstration, Amazon is already pushing for future, further expansion. In a , Amazon is requesting approval for its second-generation constellation using V- and Ku-band frequencies dubbed “the Kuiper-V System.” The proposal notes it would consist of “7,774 satellites in five altitude and inclination combinations between 590 and 650 km, including two polar shells.” The company argues that expanding its satellite internet service pole-to-pole would help address the FCC’s goal of closing the digital divide. “Amazon’s customer obsession and commitment to long-term initiatives make it uniquely well-positioned to help expand broadband access to tens of millions of global customers who do not currently have quality connectivity,” Amazon said in the filing. The first 3,236 satellites in the Kuiper-V System would supplement the Kuiper-Ka System satellites with V-band payloads.  So far, the FCC has not made a determination regarding the Kuiper-V System expansion request. The United Launch Alliance Atlas 5 rocket, standing 191 feet tall and and weighing 745,000 pounds, generates 860,000 pounds of thrust from its main engine to launch NASA’s Tracking and Data Relay Satellite-M. This is a collection of images taken during the three previous flights of the U.S. Air Force’s X-37B Orbital Test Vehicle mini space shuttle. United Launch Alliance teams ran through an 11-hour countdown Friday at Cape Canaveral to rehearse procedures before the first flight of a modified Atlas 5 rocket with Boeing’s Starliner crew capsule Dec. 20. © 1999-2023 Spaceflight Now Inc "}
{"title": "Rideshare mission on deck for penultimate Vega rocket as Vega-C successor remains sidelined", "link": "https://spaceflightnow.com/2023/10/06/rideshare-mission-on-deck-for-penultimate-vega-rocket-as-vega-c-successor-remains-sidelined/", "date": "October 6, 2023", "description": "A pair of Earth observation satellites along with ten auxiliary payloads will launch aboard Arianespace’s penultimate Vega rocket into sun-synchronous orbit on Friday. Vega lifted off at 9:36 p.m. EDT (0138 UTC) on Sunday after a two-day delay. ", "body": "Vega lifted off at 9:36 p.m. EDT (0138 UTC) on Sunday after a two-day delay. A pair of Earth observation satellites along with ten auxiliary payloads will launch aboard Arianespace’s penultimate Vega rocket into sun-synchronous orbit on Friday. The light launch vehicle, which began flying in 2012, is set to liftoff from Europe’s Spaceport in French Guiana on Oct. 6 at 10:36 p.m. local time (9:36 p.m. EDT, 0136 UTC). The main payloads consist the Thailand Earth Observation System-2 (THEOS-2) for the Geo-Informatics and Space Technology Development Agency (GISTDA) and the spacecraft (also known as Formosat-7R) for the Taiwan Space Agency (TASA). THEOS-2 is considered the primary payload and is described as “a high-resolution Earth observation optical satellite,” which uses 0.5-meter ground resolution imagery to support the operations of THEOS-1, which launched back in 2008. The project was approved back in 2017 by the Thai government with a price tag of about $238 million, according to the European Space Agency (ESA). “The platform will host and exploit multi-source data in an interoperable and integrated manner,” said Dr. Anond Snidvongs, the executive director of GISTDA, in a statement. “The resulting insights will be key sources of information for Thai leaders and will help them deliver Actionable Intelligence Policy (AIP): tools for area-based management and decision-making.” The spacecraft weighs about 425 kg (approx. 937 lbs.) and is designed to orbit the Earth at 621 km and is designed to last for a decade. It can be tilted 45 degrees for photography. The secondary payload, Triton, nicknamed the “Wind-Hunter Satellite” by TASA, weighs about 250 kg (approx. 551 lbs.) and features an instrument called the Global Navigation Satellite System-Reflectometry (GNSS-R). It collects GNSS data from the ocean to establish wind fields and better research things like air-sea interactions and typhoon intensities. Also onboard the Vega rocket will be ten additional payloads on behalf of six customers: Friday’s launch will be the penultimate flight for the Vega rocket in its current iteration. A spokesperson with Arianespace confirmed to Spaceflight Now on Thursday that the final Vega rocket is expected to launch in the first quarter of 2024. ESA and Arianespace were in the midst of transitioning to the upgraded Vega-C rocket, but plans have stalled for now after the rocket was grounded thanks to an in-flight failure during the rocket’s second mission. About 151 seconds into the VV22 mission on Dec. 20, 2022, there was “a progressive decrease in the chamber pressure” on the second stage of the rocket (Zeifro40). An Independent Enquiry Commission (IEC) was formed following the mishap, which resulted in the loss of a pair of Earth observation satellites from Airbus. A task force established to implement the suggested improvements by the commission determined that they would aim for a return to flight mission by the end of 2023. Another big setback came on June 28, 2023 during a static fire test of the modified Zefiro40 engine. Investigators determined that “the combination of the geometry of the Carbon-Carbon throat insert and the different thermo-mechanical properties of the new material” led to a failure of the engine nozzle at the Salt di Quire test facility in Italy. On Oct. 2, ESA announced additional recommendations from the IEC, including: The new requirements mean that the return to flight of Vega-C will now push back to the fourth quarter of 2024. The struggles of the Vega-C rocket and its predecessor has forced customers to make changes. The Italian Space Agency (ASI) pointed to first generation Vega rocket failures in 2019 and 2020, which delayed the maiden flight of the Vega-C rocket when they shifted their COSMO SkyMed Second Generation (CSG-2) satellite from a planned 2021 Vega-C flight onto a SpaceX Falcon 9 rocket, which successfully launched in January 2022. The EarthCARE ESA mission was also shifted from the Vega-C to the Falcon 9, which will launch sometime in 2024. Europe’s Sentinel 2A land imaging satellite designed to glimpse cities, farms and forests from orbit launched aboard a Vega rocket. The 2,500-pound satellite lifted off at 0151:58 GMT Tuesday (9:51:58 p.m. EDT Monday). Fresh off the successful launch and initial checkout of two of its spacecraft earlier this month, Israel’s top satellite manufacturer sees a robust global market for new low-altitude reconnaissance payloads, but little international demand for its communications satellites. The French government has signaled its intention to sell its stake in Arianespace, a major step in consolidating the European launcher industry under the control of a joint venture formed by Airbus and rocket engine manufacturer Safran. © 1999-2023 Spaceflight Now Inc "}
{"title": "Atlas 5 launches Amazon Kuiper satellites for tests of space-based internet service", "link": "https://spaceflightnow.com/2023/10/07/atlas-5-launches-amazon-kuiper-satellites-for-tests-of-space-based-internet-service/", "date": "October 7, 2023", "description": "A United Launch Alliance Atlas 5 rocket blasted off Friday and boosted a pair of prototype internet satellites into orbit for Amazon’s Kuiper program, the latest entry in the increasingly competitive space-based broadband market currently dominated by SpaceX. ", "body": "A United Launch Alliance Atlas 5 rocket blasted off Friday and boosted a pair of prototype internet satellites into orbit for Amazon’s Kuiper program, the latest entry in the increasingly competitive space-based broadband market currently dominated by SpaceX. “We’ve done extensive testing here in our lab and have a high degree of confidence in our satellite design, but there’s no substitute for on-orbit testing,” Rajeev Badyal, Project Kuiper’s vice president of technology, said in a statement. “This is Amazon’s first time putting satellites into space, and we’re going to learn an incredible amount.” The Atlas 5’s Russian-built RD-180 first-stage engine roared to life at 2:06 p.m. EDT, throttled up and smoothly powered the 196-foot-tall rocket away from pad 41 at the Cape Canaveral Space Force Station, arcing away to the east over the Atlantic Ocean. The rocket’s first stage fell away as planned after propelling the vehicle out of the dense lower atmosphere, and the flight continued with the Centaur upper stage. In a departure from normal practice for commercial, unclassified flights, ULA ended its realtime coverage shortly after stage separation, at the request of Amazon. The rocket company did, however, confirm the successful deployment of the Kuipersat 1 and 2 prototypes. In any case, Amazon Kuiper engineers planned to monitor deployment of the satellites’ solar panels and confirm on-board systems were performing normally. They also planned to test the program’s networking technology, relaying data to and from the satellites and ground “gateway” stations connected to the internet. The launching came two days after arch-rival SpaceX, the clear leader in the space-based internet market, launched its 113th Starlink mission, boosting the total number of satellites launched to date to 5,222. Of that total, more than 4,800 are believed to be operating. SpaceX now offers commercial service in countries around the world and plans to launch thousands more Starlinks in the years ahead to increase its global coverage. Amazon plans to launch 3,236 Kuiper satellite, with internet service beginning after the first 578 data relay stations are in orbit. The company has signed contracts totaling $10 billion for 38 launches using ULA’s new Vulcan rocket, 18 flights of the European Ariane 6 booster and at least 12 using New Glenn rockets built by Amazon founder Jeff Bezos’ Blue Origin. All of those rockets are in development and none have yet flown. “Our FCC (Federal Communications Commission) license requires that we deploy and operate at least half of our satellite constellation by July 2026,” the company says on its web page. “We expect to provide service to the earliest Project Kuiper customers by the end of 2024.” The Kuiper satellites, SpaceX’s Starlinks and OneWeb’s higher-altitude relay stations, along with other systems now in the planning stages, are designed to provide broadband access anywhere in the world using large numbers of small satellites in low-Earth orbit. As the satellites race by overhead, they receive input from customers, relay the data satellite-to-satellite and then down to gateway ground stations tied into high-speed internet circuits. Responses are then relayed back to the customer, providing uninterrupted, relatively high-speed service. The Kuiper program has released few details about its satellites other than to say they will be launched into three orbital shells at altitudes between 370 and 390 miles and that the first 578, making up phase 1, will populate orbital planes tilted 51.9 degrees to the equator. “We’re designing the system to balance performance and affordability, and we plan to provide choice and flexibility by offering a range of options for customers,” the company says. “Our ultra-compact (terminal) provides speeds of up to 100 megabits per second, our standard model delivers up to 400 Mbps and our largest model, which is intended for enterprise, government and telecommunications applications, delivers up to 1 gigabit per second.” Amazon has not yet announced how much it will charge for Kuiper service, “but affordability is a key principle,” the company says. “Amazon has a longstanding commitment to low prices, and lots of experience building popular, low-cost devices. … We’re applying a similar approach with Project Kuiper.” © 1999-2023 Spaceflight Now Inc "}
{"title": "Strong winds stymie back-to-back SpaceX launch plans; Vandenberg launch successful", "link": "https://spaceflightnow.com/2023/10/08/live-coverage-spacex-falcon-9-rockets-to-launch-from-florida-and-california-with-starlink-satellites/", "date": "October 8, 2023", "description": "SpaceX planned a pair of back-to-back Falcon 9 launches from both coasts but upper level winds scrubbed the liftoff from Florida. A Falcon 9 was able to launch from Vandenberg Space Force Base at 12:43 a.m. PDT (0743 UTC). ", "body": "A Falcon 9 lifted off from Vandenberg Space Force Base, California, at 12:43 a.m. PDT (0743 UTC). Its first stage booster, making its 14th flight, landed successfully on a drone ship in the Pacific. Upper level winds forced SpaceX to scrub the Starlink 6-22 mission from Cape Canaveral. SpaceX was hoping to kick off the second week of October with a pair of back-to-back Falcon 9 launches, lifting off from both of its Space Force-based launch pads. However, at about T-23 seconds, a hold was called by the launch director. Minutes later, SpaceX said they were standing down from the Starlink 6-22 launch attempt from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station in Florida due to strong upper-level winds. SpaceX had been targeting a liftoff at 11:38 p.m. EDT (0338 UTC) to send up 22 Starlink V2 Mini satellites up to low Earth orbit. The launch had already been delayed twice as pre-launch preparations had fallen behind schedule. The scrub was followed less than 4.5 hours later by the Starlink 7-4 mission, which successfully launched at 12:43 a.m. PDT (3:43 a.m. EDT, 0743 UTC) from Space Launch Complex 4 East (SLC-4E) at Vandenberg Space Force Base in California. Because of its trajectory, its payload consists of a slightly smaller load of 21 Starlink V2 Mini satellites. Both mission featured Falcon 9 rockets. The two first-stage boosters, B1067 at SLC-40 and B1063 at SLC-4E, were each aiming to launch for a 14th time. The Starlink 6-22 is now looking to launch no earlier than Monday, Oct. 9, at 8:42 p.m. EDT (0042 UTC). SLC-40 continues to be a workhorse launch pad for SpaceX. Following the Starlink 6-22 mission, the company will have used it to launch a total of 148 times, a majority of the 263 Falcon 9 launches that will have taken place by that point. SpaceX is also greatly ramping up activity at Vandenberg. Following the Starlink 7-4 mission, it will account for 21 out of the 22 industry launches from VSFB so far in 2023. The other mission was Firefly Aerospace’s Victus Nox launch in September. The privately-funded Israeli Beresheet lunar lander is ready for its historic mission to the moon, aiming to become the first space probe to land on another planetary body without government funding. SpaceX’s first Falcon Heavy rocket is expected to roll out to pad 39A at NASA’s Kennedy Space Center for the first time next month for a hold-down firing of its 27 Merlin main engines, but the mega-rocket’s inaugural test launch will slip into January, officials confirmed Tuesday. Seattle-based Spaceflight Industries has purchased a SpaceX Falcon 9 rocket for launch in 2017 with a mash-up of satellites in the first such commercial arrangement for a rideshare mission on a U.S. launcher, the company announced Wednesday. © 1999-2023 Spaceflight Now Inc "}
{"title": "Russian space station laboratory module coolant leak under investigation", "link": "https://spaceflightnow.com/2023/10/09/leak-detected-onboard-russian-segment-of-international-space-station/", "date": "October 9, 2023", "description": "An apparent exterior coolant leak from a Russian laboratory module at the International Space Station has been reported by the crew. It follows similar leaks that struck a Russian Soyuz crew ferry craft and a Progress cargo ship within the past year. ", "body": "An apparent exterior coolant leak from a Russian laboratory module at the International Space Station has been reported by the crew. It follows similar leaks that struck a Russian Soyuz crew ferry craft and a Progress cargo ship within the past year. This latest incident was reported by Mission Control Center at NASA’s Johnson Space Center in Houston to NASA space station crew member Jasmin Moghbeli around 1 p.m. EDT (1700 UTC). “We’re seeing flakes outside. Need a crew to go to the cupola, look toward the aft side, we think windows five or six, and confirm any visual flakes,” mission control requested. Moghbeli, the commander of the SpaceX Crew-7 mission and current ISS flight engineer, said she would go check it out herself. She was asked if she could confirm the point of origin, since it was difficult to see that from the ground perspective. “Yeah, there’s a leak coming from the radiator on the MLM,” Moghbeli said. The MLM is the Multipurpose Laboratory Module, also called “Nauka.” It’s the newest module of the space station, having launched on a Russian Proton rocket on July 21, 2021. “We copy and we think we concur. We just confirmed it with video and they’re seeing it here on the ground,” Mission Control replied. “Jaws [a nickname for Moghbeli], can you please close the cupola shutters?” Less than a minute later, Moghbeli confirmed the shutters were closed. This was presumably to prevent the surface of the windows being contaminated by the leaking coolant. About 20 minutes after that, ISS Commander and European Space Agency (ESA) astronaut Andreas Mogensen confirmed to Mission Control that the gym and lab shutters on the U.S. side of the space station were also closed. NASA stated in a blog post that “The crew aboard station was never in any danger.” The leak was determined to have originated from the backup radiator on the Nauka module, which launched to the ISS during the STS132 space shuttle mission in 2010. Because of the ongoing leak investigation, planned spacewalks that were originally scheduled for Thursday, Oct. 12 and Friday, Oct. 20 have been postponed. New dates have not been determined. NASA and Northrop Grumman officials have not set a new target date for the launch of the ICON ionospheric research satellite aboard an air-launched Pegasus XL rocket following a mission abort Wednesday, and it could be weeks before the the long-delayed science probe has another chance to head into orbit off Florida’s east coast. Launching for the 20th time from the jungle of South America, a Russian-built Soyuz booster rocketed into orbit Wednesday with a new eye in the sky for the French military, the first in a series of upgrades planned for the country’s defense satellites over the next five years. With Hurricane Isaias threatening Florida’s East Coast, astronauts Doug Hurley and Bob Behnken are awaiting a go-ahead on plans to undock from the International Space Station Saturday, setting up a fiery plunge to splashdown Sunday, presumably in the Gulf of Mexico, to close out a 64-day flight. © 1999-2023 Spaceflight Now Inc "}
{"title": "Weather delays launch of NASA’s billion-dollar Psyche mission to Friday", "link": "https://spaceflightnow.com/2023/10/11/weather-remains-watch-item-for-launching-nasas-billion-dollar-mission-to-asteroid-psyche/", "date": "October 11, 2023", "description": "Due to a poor weather forecast for the Thursday launch attempt, NASA and SpaceX are rescheduling the Psyche asteroid mission launch to Friday morning at 10:19 a.m. EDT (1419 UTC). ", "body": "NASA delays launch to Friday due to weather. With the exception of the weather, NASA and SpaceX said at a prelaunch news conference Wednesday everything was ready for the launch the Psyche mission at 10:16 a.m. EDT (1416 UTC) on Thursday, Oct. 12. on a seven-year mission to an asteroid of the same name. Arlena Moses, the launch weather officer with the 45th Weather Squadron, said the launch forecast for Thursday remains only 20 percent favorable for liftoff, but she said there were a couple elements that made her somewhat hopeful for a Thursday liftoff. “It looks right now that warm front is going to be a little north of us as we go into the first part of tomorrow morning and what that’s going to kind of help us out with is that it should take a lot of the heaviest rainfall and best chances of storms north of us,” Moses said. “However, we still will have a very unstable atmosphere, so there still may be some storms and rainfall around, probably lots of cloud cover, all of these things that we have concern for with our rocket launches and our lightning commit criteria,” she added. Moses said that winds could pick up quickly out of the southwest of 20 to 25 miles per hour for the Thursday launch window. Looking at the 24-hour backup opportunity, there are lower winds of only 7 to 12 miles per hour and a 50 percent probability of ‘go’ weather. The launch will be the seventh mission with SpaceX for NASA’s Launch Services Program (LSP) and the first using a Falcon Heavy rocket. Julianna Scheiman, SpaceX’s Director of Civil Satellite Missions, said this mission will also be the first time they are flying what’s called a “category three certification” mission, which she said is “the highest tier of certification one can get on a launch vehicle.” “It demonstrates that the launch vehicle is ready for NASA’s most important science missions,” Scheiman explained. “That means Falcon Heavy has been through the wringer, whether that’s design reviews, qualification testing, acceptance testing, post-flight data reviews, independent verification/validation work. Falcon Heavy is ready and we are so excited to be supporting the Psyche mission.” The spacecraft will spend the next few years making its way out to the asteroid 16 Psyche, which is one of only nine such asteroids that researchers believe to be mostly heavy metals. The billion-dollar spacecraft was hoisted into launch position early Wednesday morning out at Launch Complex 39A. On launch day, Dr. Henry Stone, the Psyche project manager at NASA’s Jet Propulsion Laboratory (JPL), said the spacecraft will power up about five hours before liftoff. About an hour into the flight, the Psyche spacecraft will separate from the Falcon Heavy’s second stage and then the solar arrays will deploy autonomously. The vehicle will then orient towards the Sun, shifting the power from the battery to the solar panels. Then the vehicle will rotate to point the low gain antenna in an orientation that will allow for ground communication with the spacecraft. Ground teams will then send a command to Psyche to reorient again for continuous communications. “It’s really going to be those set of operations that are going to take roughly two hours or so after separation before we are assured or have high confidence that we will have locked-in view position to get started, get actual telemetry,” Stone said. Stone, as well as many across NASA, are eager to see Psyche finally launch after its and then due to the need to adjust flight parameters to prevent the spacecraft’s cold gas thrusters from over-heating. “We wanted to make sure we took the time and we did a week to make sure, run all of our testing and verification again, that the adjustments to those parameters would be appropriate,” Stone said. “This is a huge investment, a mission like this, and we wanted to be absolutely, absolutely sure that we were ready to go.” “We lost seven days of the launch window, but we discovered this asteroid in 1852 and people have been waiting a long time to see this asteroid,” said Dr. Nicky Fox, NASA’s associate administrator for the Science Mission Directorate. “And when you put all this effort into your mission, you take that extra time to make sure it’s perfected. So, I think the team deserves a lot of credit for doing that work to make sure this mission is successful.” Psyche is expected to reach its namesake asteroid in 2029 after which it will spend about 26 month in orbit, conducting a suite of science observations regarding this unique celestial body. Japan’s Hayabusa 2 spacecraft is preparing to release three hopping robots to land on asteroid Ryugu in the coming month, with tiny instruments scientists hope will explore the airless world’s boulder-strewn landscape and return the first images from the surface of an asteroid. NASA’s Cassini spacecraft sped through a gap between Saturn and its rings for the second time Tuesday after data from the probe’s first perilous passage through the unexplored region last week found it to contain fewer potentially hazardous dust particles than expected. A threatening layer of clouds stayed away from SpaceX’s launch pad at Vandenberg Air Force Base in California on Tuesday, allowing for clear viewing of a spectacular Falcon 9 launch carrying commercial and scientific satellites into polar orbit. The fairing looks flight-proven as well. GO PSYCHE!!! BONA FORTUNA PSYCHE! delayed until  Firday the 13th … is that a good thing? Comments are closed. © 1999-2023 Spaceflight Now Inc "}
{"title": "Another Falcon 9 hits 17-flight milestone with Starlink launch", "link": "https://spaceflightnow.com/2023/09/23/live-coverage-another-falcon-9-gets-ready-to-hit-the-17-flight-milestone/", "date": "September 23, 2023", "description": "A SpaceX Falcon 9 launched from Cape Canaveral Saturday night with a first-stage booster making its 17th flight. It was only the second to reach this milestone. Liftoff, with 22 Starlink satellites occurred at 11:38 p.m. EDT (0338 UTC Sunday). ", "body": "Liftoff occurred at 11:38 p.m. EDT (0338 UTC). Falcon 9 booster 1060 landed on the drone ship about eight and a half minutes after launch. A SpaceX Falcon 9 is scheduled to launch from Cape Canaveral Saturday night with a booster making its 17th flight. It will be only the second to reach this milestone and the 200th time SpaceX has launched a previously flown Falcon 9 first stage. Liftoff, with 22 Starlink satellites inside its payload fairing, is now scheduled for 11:38 p.m. EDT (0338 UTC Sunday). SpaceX pushed back the launch time from the original T-0 of 9:07 p.m. (0107 UTC) after the Falcon 9 went upright Saturday evening later than planned. There is one additional launch opportunity at 12:05 a.m. EDT (0405 UTC). Another four launch opportunities are available Sunday night. The first stage for this Starlink 6-18 mission, is booster 1060, which first flew in June 2020 carrying the GPS 3-3 satellite for the U.S. Space Force and went on to fly the Turksat 5A, Transporter-2, Intelsat G-33/G-34 and Transporter-6 mission, plus 11 Starlink delivery flights. Just four days ago, booster 1058 became the first Falcon 9 first stage to make a 17th flight on the Starlink 6-17 mission. SpaceX had previously identified B1060 as the first stage for that mission but corrected the error on its website after the launch. SpaceX recently re-certified its Falcon 9 first-stage fleet for 20 reuses, five more than the previous rating. Excellent weather is forecast for Saturday night. U.S. Space Force meteorologists, in a forecast issued Friday, predicted only a 5-percent chance of a weather rule violation. After lifting off from Space Launch Complex 40 at Cape Canaveral Space Force Station, the Falcon 9 will roll and pitch on to a trajectory that will take it south-east. Following stage separation, about two and half minutes into flight, booster 1060 will arc towards a landing on the drone ship “Just Read the Instructions” which will be stationed about 420 miles (675 km) downrange in the Atlantic east of the Bahamas. The single Merlin Vacuum engine of the second stage will burn for about six minutes to reach a parking orbit. A two-second burn 53 minutes 57 seconds into flight will refine the orbit before the 22 Starlink satellites are deployed into a 185×178 mile (297x286km) orbit. Separation of the V2 Mini Starlink satellites will occur about one hour five minutes after launch. © 1999-2023 Spaceflight Now Inc "}
{"title": "As it happened: Seven-year asteroid adventure ends with sample return", "link": "https://spaceflightnow.com/2023/09/24/live-coverage-seven-year-asteroid-adventure-to-end-with-sample-return/", "date": "September 24, 2023", "description": "Live coverage as a capsule lands in the U.S. Army test range in the Utah desert carrying samples from the surface of asteroid Bennu. NASA’s OSIRIS-REx (short for the Origins, Spectral Interpretation, Resource Identification, and Security-Regolith Explorer) mission has been on a seven-year journey to Bennu and back. If all goes according to plan the capsule will land under a parachute at about 10:55 a.m. EDT (1455 UTC) on Sunday. ", "body": "Live coverage as a capsule lands in the U.S. Army test range in the Utah desert carrying samples from the surface of asteroid Bennu. The OSIRIS-REx (short for the Origins, Spectral Interpretation, Resource Identification, and Security-Regolith Explorer) has been on a seven-year journey to Bennu and back. If all goes according to plan the capsule will land under a parachute at about 10:55 a.m. EDT (1455 UTC) on Sunday. © 1999-2023 Spaceflight Now Inc "}
{"title": "Interview: Talking asteroid sample return", "link": "https://spaceflightnow.com/2023/09/24/talking-asteroid-sample-return/", "date": "September 24, 2023", "description": "Spaceflight Now’s Will Robinson-Smith speaks with some of the key figures at Lockheed Martin, who helped bring the OSIRIS-REx mission to life and will continue working with both the spacecraft and the asteroid samples after the return capsule lands in the Utah desert. ", "body": "Spaceflight Now’s Will Robinson-Smith speaks with some of the key figures at Lockheed Martin, who helped bring the OSIRIS-REx mission to life and will continue working with both the spacecraft and the asteroid samples after the return capsule lands in the Utah desert. © 1999-2023 Spaceflight Now Inc "}
{"title": "OSIRIS-REx sample return capsule safely lands in Utah", "link": "https://spaceflightnow.com/2023/09/24/osiris-rex-sample-return-capsule-safely-lands-in-utah/", "date": "September 24, 2023", "description": "A saucer-shaped capsule carrying asteroid fragments that may hold clues about the birth of the solar system slammed into Earth’s atmosphere Sunday and descended to an on-target parachute-assisted touchdown in Utah in the final chapter of a dramatic seven-year, four-billion-mile voyage. ", "body": "A saucer-shaped capsule carrying asteroid fragments that may hold clues about the birth of the solar system slammed into Earth’s atmosphere Sunday and descended to an on-target parachute-assisted touchdown in Utah in the final chapter of a dramatic seven-year, four-billion-mile voyage. Released from the OSIRIS-REx mothership four hours earlier, the 110-pound 31-inch-wide sample return capsule, loaded with a half-pound of rocks and soil collected in 2020 from an asteroid known as Bennu, hit the top of the discernible atmosphere, 82 miles up, at a blistering 27,000 mph 10:42 a.m. EDT. Over the next two minutes, rapidly decelerating in a hellish blaze of atmospheric friction, the capsule’s heat shield endured re-entry temperatures of more than 5,000 degrees and a braking force 32 times the force of gravity as it streaked toward landing at the Utah Test and Training Range west of Salt Lake City. With scientists and engineers holding their collective breath — a similar capsule crash landed in Utah in 2004 when its parachutes failed to open — the OSIRIS-REx sample return capsule survived its trial by fire and presumably deployed a stabilizing drogue parachute at an altitude of 20 miles. The capsule’s 24-foot-wide main capsule was expected to unfurl and inflate at an altitude of 5,000 feet, but NASA said it actually deployed at 20,000 feet. That may have contributed to a slightly earlier-than-expected touchdown, but in any case, the main chute appeared to lower the sample return capsule to an expected 11-mph landing at 10:52 a.m. EDT, the final step in a nail-biting descent. Recovery crews from prime contractor Lockheed Martin Space and the Utah Test and Training Range were on the scene within minutes to document the condition of the capsule, looking for any signs of a breach that could cause contamination of the pristine samples inside. Also on hand: University of Arizona Principal Investigator Dante Lauretta, part of a team assigned to collect nearby soil samples to thoroughly document the chemical makeup of the landing zone. Just in case. The recovery plan called for the team to haul the capsule to a temporary air-filtered “clean room” to begin disassembly and to make preparations to ship the hardware and the samples to an environmentally “clean” laboratory at the Johnson Space Center in Houston. Lauretta said the collected samples — the largest U.S. collection of extraterrestrial material since the Apollo moon program — are representative of the raw material that formed the sun and its retinue of planets 4.5 billion years ago. “We’re going back to the dawn of the solar system, we’re looking for clues as to why Earth is a habitable world, this rare jewel in outer space that has oceans, it has a protective atmosphere,” he said. “We think all of those materials were brought (to Earth) by these carbon-rich asteroids very early in our planetary system formation. “And of course, the biggest question, the one that drives my scientific investigations, is the origin of life. What is life? How did it originate? And why was the Earth the place that it occurred? … We believe that we’re bringing back that kind of material, maybe representatives of the seeds of life that these asteroids delivered at the beginning of (Earth’s history).” Two Japanese spacecraft returned small samples from asteroids in 2010 and 2020, but OSIRIS-REx — a convoluted acronym that stands for Origins, Spectral Interpretation, Resource Identification and Security Regolith Explorer — is the first such mission mounted by NASA. After initial analysis in Houston, NASA will share samples of Bennu with researchers around the world. “This is a gift to the world,” Lauretta said. “We have laboratories on four continents, 16 timezones, hundreds of researchers, over 60 laboratories that have been getting ready to get this material, and we are ready to begin the final science campaign of the OSIRIS REx prime mission.” Equipped with three cameras, two spectrometers, a laser altimeter and an X-ray imaging system developed by college students, the OSIRIS-REx spacecraft and sample return capsule were launched atop a United Launch Alliance Atlas 5 rocket from Cape Canaveral on Sept. 8, 2016. To reach Bennu, which orbits in a plane tilted six degrees from Earth’s, OSIRIS-REx looped around the sun and then made a velocity-boosting gravity-assist flyby of Earth on Sept. 22, 2017. The spacecraft finally slipped into orbit around Bennu in late 2018. Scientists were stunned at what they found. Instead of a more typical body, with fine-grained soils and rocks atop a more or less solid interior, Bennu, about as wide as the Empire State Building is tall, turned out to be a loosely compacted rubble pile that behaved more like a fluid than a solid. After extensive mapping to identify a safe sample-collection point, OSIRIS-REx slowly descended toward the surface on Oct. 20, 2020, its pie pan-shaped “Touch-And-Go Sample Acquisition Mechanism,” or TAGSAM, poised at the end of an 11-foot-long robot arm. On contact, the probe fired a jet of nitrogen gas around the interior of the 12-inch-wide TAGSAM, stirring up the soil and small rocks underneath and blowing some of the material into collection filters before the spacecraft reversed course and backed away. “It behaved very much like a fluid, there was no resistance to the downward motion of the spacecraft,” Lauretta said in an interview. “We sank in about 50 centimeters (20 inches) and if we hadn’t fired the back-away thrusters, I think we would have just gone right into the asteroid and disappeared.” After backing away from Bennu, the TAGSAM mechanism and its precious samples were stowed inside the OSIRIS-REx return capsule for the long flight back to Earth and Sunday’s dramatic re-entry. After course corrections to line up on the Utah landing site, the OSIRIS-REx mothership released the sample return capsule at 6:42 a.m. EDT. With the capsule safely on its way, the OSIRIS-REx spacecraft fired its thrusters 20 minutes later, ensuring it would safely miss Earth by about 484 miles. The “divert” maneuver put the craft on course for a close encounter with the asteroid Apophis in 2029. Roughly 1,200 feet across, Apophis will come within a scant 20,000 miles of Earth in 2029, a very near miss in astronomical terms. The OSIRIS-REx spacecraft, now known as the OSIRIS-Apophis Explorer, will brake into orbit around Apophis shortly after the asteroid’s Earth flyby, kicking off extended observations. © 1999-2023 Spaceflight Now Inc "}
{"title": "SpaceX Falcon 9 launches Starlink satellites from California", "link": "https://spaceflightnow.com/2023/09/25/live-coverage-spacex-falcon-9-to-launch-starlink-satellites-from-california/", "date": "September 25, 2023", "description": "SpaceX launched its 42nd Starlink delivery mission of the year with a Falcon 9 lifting off from the West Coast carrying a batch of 21 satellites at 1:48 a.m. PDT (4:48 a.m. EDT / 0848 UTC) Monday morning. ", "body": "Adding successful Satellite deployment. SpaceX launched its 42nd Starlink delivery mission of the year with a Falcon 9 lifting off from the West Coast carrying a batch of 21 satellites at 1:48 a.m. PDT (4:48 a.m. EDT / 0848 UTC) Monday morning. The Falcon 9 headed in a south-easterly direction from Space Launch Complex 4E at Vandenberg Space Force Base in California targeting a 185×178 mile (297×286 km) orbit, inclined at 53 degrees to the equator. The first stage booster, making its sixth flight, previously launched the first Tranche 0 mission for the U.S. military’s Space Development Agency and flew four previous Starlink delivery missions. After completing its burn, the first stage landed on the drone ship ‘Of Course I still Love You’ stationed about 400 miles downrange (644km) in the Pacific Ocean off the coast of Baja California. Deployment of the 21 V2 Mini Starlink satellites occurred just over an hour after launch. The V2 Mini model was introduced earlier this year and is much larger than the V1.5 satellites. Equipped with upgraded antennae and larger solar panels, the latest models can deliver four times the bandwidth of the previous satellites. SpaceX recently announced it had signed up over two million subscribers in more than 60 countries for its Starlink internet service. Since 2019 it has launched 5,178 satellites according to statistics compiled by Jonathan McDowell, an astronomer at the Harvard-Smithsonian Center for Astrophysics, who maintains a . Of those satellites 4,828 remain in orbit and prior to today’s launch 4,776 appear to be working normally. © 1999-2023 Spaceflight Now Inc "}
