{"title": "Super Heavy-Starship climbs high but falls short on second test flight", "link": "https://spaceflightnow.com/2023/11/18/super-heavy-starship-climbs-high-but-falls-short-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX’s gargantuan Super Heavy-Starship, the most powerful rocket ever built, blasted off on its second test flight Saturday and while the initial stages of the mission went smoothly, the first stage broke apart moments after separation from the Starship upper stage, which then blew itself up as it neared space.", "body": "SpaceX’s gargantuan Super Heavy-Starship, the most powerful rocket ever built, blasted off on its second test flight Saturday and while the initial stages of the mission went smoothly, the first stage broke apart moments after separation from the Starship upper stage, which then blew itself up as it neared space. Viewed as a successful learning experience by SpaceX, it was the second failure in a row to get the Starship upper stage into space, a frustrating disappointment for Elon Musk’s rocket company and a potentially major setback for NASA, which is counting on the Starship to carry Artemis astronauts to the surface of the moon in the next few years. While SpaceX’s philosophy is to fly frequently, learn from mistakes and fly again, NASA will require a long string of successful missions before the agency will deem it safe to put astronauts aboard. SpaceX will no doubt resolve the issues that derailed Saturday’s flight, but every delay poses a threat to NASA’s moon landing timeline. But SpaceX, at least, viewed the launching as more of a success than a failure. “Congratulations to the entire SpaceX team on an exciting second integrated flight test of Starship!” the company posted on X. “Starship successfully lifted off under the power of all 33 Raptor engines on the Super Heavy booster and made it through stage separation” Shattering the morning calm at SpaceX’s Boca Chica launch site on the Texas Gulf Coast, the Super Heavy’s 33 methane-burning Raptors ignited with a torrent of flame at 8:03 a.m. EST, instantly engulfing the rocket in billowing clouds of dust and steam. Gulping more than 40,000 pounds of methane and liquid oxygen per second, the 397-foot-tall rocket slowly climbed skyward, thrilling thousands of area residents, tourists and journalists who looked on from nearby South Padre Island. The launching came nearly seven months after an April 20 maiden test flight ended in a spectacular conflagration four minutes after liftoff, triggered by multiple first stage engine failures, problems separating the Starship from the Super Heavy and a catastrophic tumble. Maximum altitude: 24 miles. The second time around, the rocket got farther and several of the systems that derailed the first test flight appeared to work normally. All 33 Raptor engines powering the first stage fired throughout the boost phase of the flight and a new “hot staging” system, in which the Starship’s engines ignited before separation, work as designed. Moments after separation, the first stage flipped around and began lining up for a planned controlled splashdown in the Gulf of Mexico,, closer to the Texas coast. But moments later, it suddenly broke apart, possibly due to stresses imposed by the hot-staging technique. The Starship, however, continued the climb toward space on the power of its six Raptor engines. All went well until about eight-and-a-half minutes into the flight when controllers lost contact with the rocket. The vehicle had disappeared from view in long-range tracking cameras by that point, but a sudden, shimmering disturbance in the atmosphere may have been a sign of the rocket’s destruction. “We have lost the data from the second stage,” reported SpaceX engineer John Insprucker. SpaceX founder Elon Musk could be seen huddling with flight controllers, looking at computer monitors to get a sense of what might have happened. Moments later, Insprucker said “the automated flight termination system on the second stage appears to have triggered very late in the burn as we were headed downrange out over the Gulf of Mexico.” It’s not yet known why the Super Heavy booster broke apart or why the Starship upper stage apparently failed just before or after engine shutdown. But SpaceX commentators said the primary goal of the flight, testing the hot-staging systen for separating the upper and lower stages, appeared to work as planned. Likewise, all 33 Raptor engines in the Super Heavy and the six powering the Starship appeared to fire normally for as long as the vehicles were visible. How other upgrades implemented in the wake of the April failure performed Saturday remains to be seen. NASA is spending billions for a variant of the Starship to carry Artemis astronauts back to the surface of the moon. SpaceX is counting on the rocket to vastly expand its fleet of Starlink internet satellites and to power eventual low-cost government and commercial flights to the moon, Mars and beyond in keeping with founder Elon Musk’s drive to make humanity a “multi-planet species.” Multiple test flights will be needed to demonstrate the reliability required for astronaut flights and it’s not yet clear how long that might take. While Saturday’s launch was far from a complete success, it did demonstrate solid engine performance and successful stage separation. In the April flight, the pad was seriously damaged, the Super Heavy suffered multiple premature engine shutdowns, the stage separation system did not work and the rocket’s self-destruct system took longer than expected to activate. The rocket reached a maximum altitude 24 miles, well below the 50-mile altitude NASA considers the “boundary” of space, before tumbling back toward Earth and exploding in a fireball of burning propellant. The Federal Aviation Administration investigated the failure and cited “multiple root causes of the … mishap and 63 corrective actions SpaceX must take to prevent mishap reoccurrence.” Musk said the company implemented “well over a thousand” changes” to improve safety and performance. The company finally received the required FAA launch license earlier this week after a final review of the rocket’s possible impact on area wildlife. Along with hot staging, SpaceX added a powerful water deluge system to the launch pad to reduce the acoustic shock of engine ignition and the effects of their combined thrust. During the April launch, the base of the pad was heavily damaged, with steel and concrete debris blasted into the surrounding area. Other major upgrades include the replacement of hydraulic actuators with an electrically-driven engine steering system and an improved, faster-acting self-destruct system. Musk believes the Super Heavy-Starship will open a new era in space transportation. It is by far the largest, most powerful rocket ever built, standing 40 stories tall and tipping the scales at more than 11 million pounds when fully loaded with propellants. Burning methane with liquid oxygen, the rocket is capable of generating a staggering 16.7 million pounds of thrust, more than twice the power of NASA’s Space Launch System moon rocket and the legendary Apollo-era Saturn 5. The Super Heavy first stage alone stands 230 feet tall while the Starship upper stage, designed to carry cargo, passengers or both, towers another 164 feet and is equipped with six Raptor engines of its own. It is capable of lifting up to 150 tons of cargo to low-Earth orbit. Getting the Super Heavy-Starship flying on a regular basis is critical to NASA’s Artemis moon program. NASA gave SpaceX a $2.9 billion contract in 2021 to develop a variant of the Starship upper stage to carry astronauts down to the lunar surface in the next two to three years. To send a Starship to the moon, SpaceX must first refuel it in low-Earth orbit, robotically transferring thousands of gallons of super-cold cryogenic propellants carried up by multiple Starship “tankers.” The number of tankers required is not yet known, but senior NASA managers have said more than a dozen will be needed for each Starship sent to the moon. \nNASA’s contract requires one unpiloted lunar test flight before astronauts will make a landing attempt. Artemis managers continue to officially target late 2025 for the first lunar landing with astronauts on board, but that’s not remotely feasible given SpaceX’s pace developing the Starship system. It’s also not known when SpaceX might be ready to launch paying customers aboard the new rocket. NASA’s moon program aside, at least three all-civilian missions have been booked to date. Billionaire Jared Isaacman, who charted the first private Crew Dragon flight to low Earth orbit in 2019, plans to be aboard for the first piloted orbital flight of a Starship as part of his Polaris Dawn program. Japanese billionaire Yusaku Maezawa, who paid the Russians for a visit to the International Space Station in 2021, also has chartered a Starship flight — “Dear Moon” — to carry him, an assistant and 10 artists and influencers on a privately funded around-the-moon voyage. A third civilian Starship flight carrying 12 passengers, including space station veteran Dennis Tito and his wife, also has been booked. Tito paid the Russians an estimated $20 million for a visit to the International Space Station in 2001 and says he can’t wait to get back into space and share the experience with his wife. It’s not known what SpaceX might be charging for a privately chartered Starship flight."}
{"title": "Capitol Hill budget battle may limit initial funding of some National Security Space Launch missions", "link": "https://spaceflightnow.com/2023/11/08/capitol-hill-budget-battle-may-limit-initial-funding-of-some-national-security-space-launch-missions/", "date": "November 8, 2023", "description": "The U.S. Space Systems Command revealed the details of its latest batch of launch contracts for national security missions shared between United Launch Alliance and SpaceX.", "body": "The U.S. Space Systems Command revealed the details of its latest batch of launch contracts for national security missions shared between United Launch Alliance and SpaceX. This marks the fifth and final year of the Phase 2 National Security Space Launch (NSSL) Service Task Order awards has been issued. It also sets the stage for more launch companies to join in the mix in the future. NSSL missions help protect U.S. assets both in orbit as well as on the ground. They also host technology demonstrations and advancements in various defense capabilities. However, financial uncertainty on Capitol Hill means that not all of the proposed missions may get funding for some time, including a demonstration of a nuclear thermal rocket. Among the 21 missions that have been assigned to ULA and SpaceX, only eight are anticipated to be ordered under a continuing resolution scenario, according to the U.S. Space Systems Command: ULA SpaceX The Space Development Agency’s (SDA) T1TL-F mission is the sixth and final mission of the Tranche 1 Transport Layer launches, which “will provide assured, resilient, low-latency military data and connectivity worldwide to the full range of warfighter platforms,” according to SSC. T1TR-A and T1TR-E are the two final Tranche 1 Tracking Layer launches, which “provide global indications, warning, tracking, and targeting of advanced missile threats, including hypersonic missile systems.” The launch sites for the eight missions are split evenly between the Eastern Range in Florida and the Western Range in California and will use ULA’s forthcoming Vulcan rocket and SpaceX’s Falcon 9 rocket. As far as how these eight missions were chosen to be the ones likely recommended for funding through the continuing resolution, Maj. Christopher Box, the SSC chief of Phase 2 Launch Service Procurement told Spaceflight Now that, “These are the first eight missions expected to launch chronologically.” Currently, the federal government is being funded by a short-term continuing resolution that was passed on Sept. 30 to avoid a government shutdown but it will expire on Nov. 17, once again raising the prospect of a shutdown. In order to fully fund the government through fiscal year (Oct. 1, 2023 through Sept. 30, 2024), Congress needs to pass 12 appropriation bills. As of Tuesday,  , three bills have passed the Senate from a bipartisan so-called “minibus” package and House Republicans have passed seven partisan bills. Like in September, Congress could pass another continuing resolution while they hammer out the appropriations bills for the full FY24 budget, but a consensus has yet to be reached. On Oct. 31, SSC announced the planned 21 missions that will close out the NSSL Phase 2 Launch Service Procurement. This collection of launch contracts was first announced back on Aug. 7, 2020, when the Space and Missile Systems Center (officially renamed SSC on Aug. 13, 2021) when the two Firm-Fixed-Price, Indefinite Delivery Requirement contracts were awarded to ULA and SpaceX in a roughly 60-40 split. “Over the five-year Phase 2 contract, we will have ordered a total of 48 missions, a significant increase over the 34 missions originally estimated leading up to Phase 2,” said Brig. Gen. Kristin Panzenhagen, program executive officer, Assured Access to Space, in a statement.  “The increase in launch tempo is a clear reminder of how vital space-based capabilities are in providing our warfighters and our nation’s decision-makers with the information needed to stay ahead of and to deter adversarial forces.” Following the   assigned concurrent with the Phase 2 announcement, SSC went on to assign four missions for  , eight missions for  , 12 missions for   and 21 missions for  . The price tag of all the planned mission is approximately $5.6 billion with roughly $3.1 billion awarded to ULA and $2.5 billion awarded to SpaceX. When the Phase 2 contracts were first announced in 2020, Dr. William Roper, Assistant Secretary of the Air Force for Acquisition, Technology and Logistics, said at the time that it was a “groundbreaking” advancement in launch procurement alongside the National Reconnaissance Office. “Maintaining a competitive launch market, servicing both government and commercial customers, is how we encourage continued innovation on assured access to space,” Roper said in a statement at the time. “Today’s awards mark a new epoch of space launch that will finally transition the Department off Russian RD-180 engines.” All of the Phase 2 missions granted to ULA using its forthcoming Vulcan rocket. However, the USSF-51 mission, which was awarded in 2020 for Vulcan, will instead be flown using an Atlas 5 rocket due to delays with the debut of Vulcan. That will launch no earlier than 2024. Our inaugural   is now outfitted with both of its GEM 63XL solid rocket boosters that will provide extra thrust at liftoff for the   mission to launch a commercial lunar lander to the Moon and a memorial payload into deep space. Launch is targeted for Dec. 24!  — ULA (@ulalaunch)  The final batch of Phase 2 missions will see three Vulcan rockets launch from Vandenberg Space Force Base, a capability that is still in development. There will also be three launches for SpaceX using its Falcon Heavy rocket, including to support a next generation GPS satellite. The GPS 3 Follow-On (GPS 3F) series of satellites feature upgrades like Regional Military Protection Capability and a new search and rescue payload. Lockheed Martin was   in September 2018 to build up 22 of the GPS 3F satellites for a total contract value of up to $7.2 billion, with the first dubbed GPS 3F SV (Space Vehicle) 11. Most recently, SSC opted for its  to procure SVs 18, 19 and 20 for about $774 million. Also in the mix is Defense Advanced Research Projects Agency’s (DARPA) Demonstration Rocket for Agile Cislunar Operations (DRACO), designated mission USSF-25. It will demonstrate the abilities of a nuclear thermal rocket in space, powered by high-assay low enriched uranium (HALEU), which researchers believe will have two to three times the efficiency of a typical combustion engine. The U.S. Nuclear Regulatory Commission   as “uranium enriched so that the concentration of the fissile isotope uranium-235 (U-235) is between 5% and 20% of the mass of uranium.” That mission is expected to launch in March 2027, according to a presentation by Tabitha Dodson, the DRACO program manager, during the von Braun Space Exploration Symposium last month. The SSC confirmed that it will launch on a Vulcan rocket. 10/ This is an overview of the flight profile.👇🏾  — Will Robinson-Smith🚀 (@w_robinsonsmith)  Another new technology will launch with the USSF-95 mission onboard another Vulcan rocket. That will be the first launch of a prototype Missile Track Custody satellite, which SSC said, “will evaluate the ability of various Next Generation Overhead Persistent Infrared sensor designs to meet missile tracking requirements.” There are also five missions launching in this batch on behalf of the NRO. “We maintain a close partnership with our mission customers and our domestic launch industry to protect our nation,” said Col. Chad Melone, SSC senior materiel leader, Mission Solutions Space Acquisition Delta, in a statement. “Under our Phase 2 contract, ULA and SpaceX have been committed partners, and our combined team remains dedicated to delivery of critical assets to our warfighters as we complete this phase of the NSSL program and embark on NSSL Phase 3 starting in FY25.” Phase 3 will see new entrants into the competition for NSSL awards. Companies like Blue Origin and Relativity Space are expected to vie for the forthcoming launches."}
{"title": "U.S. military’s X-37B  mini-shuttle to launch on SpaceX Falcon Heavy for the first time", "link": "https://spaceflightnow.com/2023/11/09/u-s-militarys-x-37b-mini-shuttle-to-launch-on-spacex-falcon-heavy-for-the-first-time/", "date": "November 9, 2023", "description": "The U.S. military’s experimental spaceplane will soon soar to orbit using a SpaceX Falcon Heavy rocket for the first time, a Pentagon news release announced. The X-37B spacecraft will launch from NASA’s Kennedy Space Center no earlier than December 7.", "body": "The U.S. military’s experimental spaceplane will soon soar to orbit using a SpaceX Falcon Heavy rocket for the first time, a Pentagon news release announced. The X-37B spacecraft will launch from NASA’s Kennedy Space Center no earlier than December 7. The Falcon Heavy launch will mark the seventh flight of the X-37B Orbital Test Vehicle. The mini-shuttle is operated by Department of the Air Force Rapid Capabilities Office, in partnership with the United States Space Force. The mission was previously dubbed USSF-52 by the U.S. Space Force. “We are excited to expand the envelope of the reusable X-37B’s capabilities, using the flight-proven service module and Falcon Heavy rocket to fly multiple cutting-edge experiments for the Department of the Air Force and its partners,” said Lt. Col. Joseph Fritschen, the X-37B Program Director, in a statement. The news release said the mission would see the spaceplane operate in “new orbital regimes” without any specific details. Previous X-37B missions have operated in low Earth orbit. The spaceplane is designed for long-duration missions on orbit for various tests and experiments on behalf of the Space Force as well as NASA. This upcoming flight, OTV-7, will include a radiation experiment called “Seeds-2,” which will study the impacts of radiation on various plant seeds during long-duration spaceflight. The upcoming flight will also be “experimenting with future space domain awareness technologies” in order to ensure “safe, stable, and secure operations in space for all users of the domain.” OTV-7 will mark the first launch of the X-37B on a Falcon Heavy rocket. The fifth flight of the spaceplane took off on a Falcon 9 Block 4 rocket back on Sept. 7, 2017. The other four launches used a ULA Atlas 5 rocket to get to orbit. While the length of this upcoming flight has not been disclosed, each previous mission of the X-37B got progressively longer. The most recent flight launched back on May 17, 2020, and landed on Nov. 12, 2022 at Space Florida’s Launch and Landing Facility at KSC. That mission was the first to include a service module, which attached to the rear of the spaceplane, allowing for more experiments to fly onboard. It too included a seeds experiment for NASA as well as the FalconSat-8, a satellite built and operated by U.S. Air Force Academy cadets, which remains in orbit. There are two spaceplanes currently in the X-37B program, thought it was not disclosed which one will be launching on this upcoming mission. This mission also continues the relationship between USSF and SpaceX to further validate its launch capabilities. The Falcon Heavy side boosters that will launch on this mission, B1064 and B1065, will make their fifth flight. They were first used on USSF-44, which launched on Nov. 1, 2022, and have subsequently flown on USSF-67, Jupiter-3/EchoStar-24 and NASA’s Psyche missions. The launch contract with SpaceX for this mission is valued at $154,726,072, according the U.S. Space Systems Command. SpaceX and NASA said they plan to use these side boosters one last time in October 2024 to support the Europa Clipper mission to send a spacecraft to study one of Jupiter’s moons. That launch will take the full power of the Falcon Heavy and so, the side boosters and the core stage will all be expended."}
{"title": "SpaceX Falcon 9 rocket launches 22 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/10/28/live-coverage-spacex-falcon-9-rocket-to-launch-22-starlink-satellites-from-california/", "date": "October 28, 2023", "description": "The first of two Falcon 9 missions SpaceX is planning for Sunday carried into orbit the largest batch of second-generation Starlink satellites to be launched from the West Coast. It was the 50th Starlink launch of the year.", "body": "The first of two Falcon 9 missions SpaceX is planning for Sunday carried into orbit the largest batch of second-generation Starlink satellites to be launched from the West Coast. It was the 50th Starlink launch of the year. The Falcon 9 lifted off from Space Launch Complex 4 East (SLC-4E) at Vandenberg Space Force Base in California at 2 a.m. PDT (5 a.m. EDT / 0900 UTC) with 22 satellites aboard. The California launch will be followed on Sunday by another Starlink delivery mission carrying 23 satellites, which will launch from pad 40 at Cape Canaveral Space Force Station at 7:45 p.m. EDT (2345 UTC).  The Starlink 7-6 mission was the first time a Falcon 9 has carried 22 of the so-called V2 Mini satellites from the West Coast. Previously, missions from there had been limited to 15 or 21 Starlinks, depending on the orbit. On the East Coast, a Falcon 9 launched 23 V2 Minis a week ago on Oct. 21, one more than the previous maximum load for a mission from the Cape. SpaceX has not explained how it is achieving this extra delivery capacity. It’s possibly due an improvement in the rated performance of the Falcon 9 or perhaps a manufacturing change that has reduced the satellites’ total weight. The Falcon 9 first-stage booster, tail number B1075, was making its seventh flight. It entered service in January of this year carrying 51 older generation Starlinks into orbit. It went on to launch the Tranche 0 Flight 1 mission for the U.S. military’s Space Development Agency and then made four more Starlink delivery flights. It last flew prior to today’s launch on Sept. 25, making for a 34-day turnaround. After separating from the Falcon 9 second stage, B1075 continued downrange for a landing on the droneship Of Course I Just Love You, which was stationed in the Pacific off shore of Baja California. The 22 Starlink satellites will be released from the second-stage just over an hour into flight. A successful deployment will bring the total number of Starlink satellites in orbit to 4,989, according to  . SpaceX has accomplished 25 orbital missions from Vandenberg in the last 365 days, an average of one launch every 14.6 days. Including launches from Cape Canaveral, it was the 89th orbital mission for SpaceX in the last 365 days, a launch every 4.1 days on average."}
{"title": "Falcon 9 launch scrubbed 30 seconds before liftoff with 23 Starlink satellites", "link": "https://spaceflightnow.com/2023/10/29/live-coverage-spacex-falcon-9-rocket-to-launch-from-cape-canaveral-with-23-starlink-satellites/", "date": "October 29, 2023", "description": "A scrub was called at T-30 seconds to liftoff. The launch team will target its next launch attempt with a 24-hour recycle. The launch window opens at 7:20 p.m. EDT (2320 UTC).", "body": "A scrub was called at T-30 seconds to liftoff. The launch team will target its next launch attempt with a 24-hour recycle. The launch window opens at 7:20 p.m. EDT (2320 UTC). SpaceX is gearing up to launch 23 more satellites for its Starlink internet service from Cape Canaveral on Sunday, its second Falcon 9 launch of the day. Liftoff from pad 40 is scheduled for 8:17 p.m. EDT (0017 UTC). Earlier Sunday, a Falcon 9 lofted 22 Starlinks from Vandenberg Space Force Base in California. That launch brought the number of Starlink satellites currently in orbit to 4,989, according to  . If all goes according to plan, SpaceX will have more than 5,000 Starlink satellites in orbit by the end of the day. A forecast issued by the 45th Weather Squadron at Cape Canaveral on Saturday gave the Falcon 9 an 85-percent chance of favorable conditions for launch. The main concerns are violations of liftoff wind limits and rules associated with lightning-triggering cumulus clouds. There was a low to moderate risk of poor weather in the booster recovery area near the Bahamas. SpaceX has five back up launch opportunities on Sunday night if needed, the last of which is at 10:47 p.m. EDT (0247 UTC). Spaceflight Now will bring you live coverage from the Cape, starting about an hour before launch. After lifting off from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station, the Falcon 9 will pitch and roll onto a south-easterly trajectory as it targets an orbit inclined at 43 degrees to the equator. The first-stage booster, making its eighth flight, will touch down on the drone ship ‘Of Course I Still Love you’ about eight and a half minutes after launch. The booster, tail number B1077, first flew in October 2022, carrying Crew 5 to the International Space Station aboard Dragon Endurance. It went on to fly the GPS III F6, Inmarsat I6-F2, CRS-28, and Intelsat G-37 missions, plus two Starlink delivery flights. Deployment of the 23 Starlink satellites into a 182×177 mile (293×285 km) orbit is scheduled to occur 1 hour, 5 minutes and 38 seconds after launch. Tonight’s launch will be the 90th orbital mission for SpaceX in the last 365 days, roughly a launch every four days on average. Company officials have said they hope to accelerate the pace of launches and make 100 flights in 2023, surging to a total of 144 in 2024."}
{"title": "SpaceX launches Falcon 9 rocket carrying 22 Starlink satellites on its second Friday launch", "link": "https://spaceflightnow.com/2023/10/13/live-coverage-spacex-to-launch-falcon-9-rocket-carrying-22-starlink-satellites/", "date": "October 13, 2023", "description": "A Falcon 9 rocket carrying 22 Starlink satellites, delayed by upper level winds and held up for the Falcon Heavy launch of NASA’s Psyche, launched from Space Launch Complex 40 at Cape Canaveral Space Force Station at 7:01 p.m. EDT (2301 UTC) Friday night.", "body": "A Falcon 9 rocket carrying 22 Starlink satellites, delayed by upper level winds and held up for the Falcon Heavy launch of NASA’s Psyche, launched from Space Launch Complex 40 at Cape Canaveral Space Force Station at 7:01 p.m. EDT (2301 UTC) Friday night. The U.S. Space Force’s 45th Weather Squadron, based at Cape Canaveral, on Thursday predicted a 60 percent chance of acceptable weather for the first of today’s launch opportunities which improved to 80 percent chance at the end of the window. A launch attempt on Oct. 8 was aborted with just 23 seconds left on the clock. SpaceX said the delay was due to upper level winds. While a West Coast Starlink launch went ahead a few hours later, SpaceX put the Cape launch on hold at the request of NASA, which wanted to prioritize the Falcon Heavy launch of the Psyche asteroid mission, which launched earlier Friday. SpaceX didn’t need any of its five back up launch opportunities Friday, which ranged from at 7:51 p.m. EDT (2351 UTC) to 10:29 p.m. EDT (0429 UTC). The Falcon 9 carried 22 second-generation satellites for SpaceX’s Starlink internet service. The company announced recently that its now had more than two million subscribers for its broadband internet in more than 60 countries. After lifting off, the Falcon 9 headed southeast, targeting an orbit inclined at 43 degrees to the equator. The first stage booster, B1067, made its 14 flight, separating from the second stage about two and a half minutes into flight and then arcing downrange for a landing on the drone ship A Shortfall of Gravitas. The barge was stationed in the Atlantic Ocean, east of the Bahamas about 420 miles (675 km) from Cape Canaveral. Two burns of the Falcon 9’s second stage will be required to place the satellites into the required 182 x 176 mile (293 x 284 km) orbit. Separation of the satellite stack is scheduled to occur just over an hour into the flight."}
