{"title": "Super Heavy-Starship climbs high but falls short on second test flight", "link": "https://spaceflightnow.com/2023/11/18/super-heavy-starship-climbs-high-but-falls-short-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX’s gargantuan Super Heavy-Starship, the most powerful rocket ever built, blasted off on its second test flight Saturday and while the initial stages of the mission went smoothly, the first stage broke apart moments after separation from the Starship upper stage, which then blew itself up as it neared space. "}
{"title": "Live Coverage: SpaceX to launch Starship/Super Heavy Booster on second test flight", "link": "https://spaceflightnow.com/2023/11/18/live-coverage-spacex-to-launch-starship-super-heavy-booster-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX is counting down for the second test flight of its mammoth Starship launch vehicle. Liftoff from Starbase in Texas is scheduled for 7 a.m. CST / 8 a.m. EST (1300 UTC). If all goes according to plan the Starship will travel around the world before splashing down in the Pacific near Hawaii. "}
{"title": "SpaceX launches Falcon 9 rocket from Cape Canaveral with 23 Starlink satellites", "link": "https://spaceflightnow.com/2023/11/18/live-coverage-spacex-to-launch-falcon-9-rocket-from-cape-canaveral-with-23-starlink-satellites/", "date": "November 18, 2023", "description": "A Falcon 9 rocket is to launch tonight with another batch of satellites for SpaceX’s Starlink internet service. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 11:15 p.m. EDT (0415 UTC). "}
{"title": "FAA clears SpaceX for second Super Heavy-Starship test flight", "link": "https://spaceflightnow.com/2023/11/16/faa-clears-spacex-for-second-super-heavy-starship-test-flight/", "date": "November 16, 2023", "description": "SpaceX’s huge Super Heavy-Starship rocket has been cleared for a second test flight in an attempt to boost the unpiloted Starship upper stage into space for the first time, the company announced Wednesday. On Thursday Elon Musk announced the launch has slipped to Saturday to replace a grid fin actuator. "}
{"title": "SpaceX Falcon 9 rocket launches 3rd pair of O3b mPOWER satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/11/12/live-coverage-spacex-falcon-9-rocket-to-launch-3rd-pair-of-o3b-mpower-satellites-from-cape-canaveral/", "date": "November 12, 2023", "description": "The launch of the SES O3b mPOWER satellites a day after the Transporter-9 rideshare mission from California. The Boeing-built O3b mPOWER 5&6 satellites launched from Space Launch Complex 40 (SLC-40) at the start of the 89-minute window that opened at 4:08 p.m. EST (2108 UTC). "}
{"title": "SpaceX launches more than a hundred payloads on Falcon 9 mission from Vandenberg", "link": "https://spaceflightnow.com/2023/11/11/live-coverage-spacex-to-launch-90-payloads-on-transporter-9-falcon-9-mission-from-vandenberg/", "date": "November 11, 2023", "description": "A SpaceX Falcon 9 launched from Vandenberg Space Force Base in California on a rideshare mission to low Earth orbit with a multitude of small payloads. The Transporter-9 mission lifted off into a clear blue sky at 10:49 a.m. PST (18:49 UTC)."}
{"title": "SpaceX launches Dragon cargo ship to space station", "link": "https://spaceflightnow.com/2023/11/10/spacex-launches-dragon-cargo-ship-to-space-station/", "date": "November 10, 2023", "description": "Lighting up the night sky, a SpaceX Falcon 9 rocket streaked into orbit in spectacular fashion Thursday, kicking off a 32-hour rendezvous with the International Space Station to deliver 6,500 pounds of research gear, crew supplies and needed equipment. "}
{"title": "SpaceX launches Falcon 9 rocket on 29th resupply mission to the Space Station", "link": "https://spaceflightnow.com/2023/11/09/live-coverage-spacex-to-launch-falcon-9-rocket-on-29th-resupply-mission-to-the-space-station/", "date": "November 9, 2023", "description": "Rodents, water filters and a laser relay are among the 6,500 pounds of science and equipment that will launch to the International Space Station on Thursday evening. A Falcon 9 rocket launched carrying a SpaceX Cargo Dragon at 8:28 p.m. EST (0128 UTC on Nov. 10) from Launch Complex 39A at NASA’s Kennedy Space Center. "}
{"title": "U.S. military’s X-37B  mini-shuttle to launch on SpaceX Falcon Heavy for the first time", "link": "https://spaceflightnow.com/2023/11/09/u-s-militarys-x-37b-mini-shuttle-to-launch-on-spacex-falcon-heavy-for-the-first-time/", "date": "November 9, 2023", "description": "The U.S. military’s experimental spaceplane will soon soar to orbit using a SpaceX Falcon Heavy rocket for the first time, a Pentagon news release announced. The X-37B spacecraft will launch from the Kennedy Space Center no earlier than December 7. "}
{"title": "Capitol Hill budget battle may limit initial funding of some National Security Space Launch missions", "link": "https://spaceflightnow.com/2023/11/08/capitol-hill-budget-battle-may-limit-initial-funding-of-some-national-security-space-launch-missions/", "date": "November 8, 2023", "description": "Among the 21 missions set to be ordered in the fifth year of Phase 2 task orders, only eight are anticipated to be ordered under a continuing resolution. "}
{"title": "SpaceX Falcon 9 rocket lifts off on 80th orbital launch of the year", "link": "https://spaceflightnow.com/2023/11/07/live-coverage-spacex-to-launch-falcon-9-rocket-with-23-starlink-satellites-from-cape-canaveral/", "date": "November 7, 2023", "description": "SpaceX completed the Starlink delivery mission from Cape Canaveral Tuesday night, the first of two planned Falcon 9 launches in less than 48 hours. Liftoff from pad 40 occurred at 12:05 a.m. EST (0505 UTC). "}
{"title": "Private astronaut mission likely first to use SpaceX’s new crew access tower", "link": "https://spaceflightnow.com/2023/11/06/private-astronaut-mission-likely-first-to-use-spacexs-new-crew-access-tower/", "date": "November 6, 2023", "description": "A crew access arm was lifted into place at Space Launch Complex 40 at Cape Canaveral on Monday, as SpaceX races to ready the pad for its first Crew Dragon launch with astronauts as soon as January. "}
{"title": "SpaceX poised for ‘mid-November’ launch of second Starship test flight", "link": "https://spaceflightnow.com/2023/11/04/spacex-poised-for-mid-november-of-second-starship-test-launch/", "date": "November 4, 2023", "description": "More than half a year after its first flight, SpaceX believes it’s on the cusp of getting to launch its Starship rocket for a second time. "}
{"title": "SpaceX launches Falcon 9 booster from Cape Canaveral on recording-breaking 18th flight", "link": "https://spaceflightnow.com/2023/11/03/live-coverage-spacex-to-launch-falcon-9-booster-from-cape-canaveral-on-recording-breaking-18th-flight/", "date": "November 3, 2023", "description": "SpaceX broke another re-flight record on Friday evening with the launch of 23 more Starlink satellites on a Falcon 9 booster making its 18th flight. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 8:37 p.m. EDT (0037 UTC on Nov. 4). "}
{"title": "Mixed results for spacewalkers after time lost dealing with difficult-to-loosen bolts", "link": "https://spaceflightnow.com/2023/11/01/mixed-results-for-spacewalkers-after-time-lost-dealing-with-difficult-to-loosen-bolts/", "date": "November 1, 2023", "description": "Astronauts Jasmin Moghbeli and Loral O’Hara worked outside the International Space Station Wednesday to replace a bearing assembly in one of the lab’s solar array rotation mechanisms. But the task took longer than expected and they were unable to retrieve a failed electronics box as planned. "}
{"title": "Astrobotic’s Peregrine lander arrives in Florida ahead of Christmas Eve Moon-bound launch", "link": "https://spaceflightnow.com/2023/11/01/astrobotics-peregrine-lander-arrives-in-florida-ahead-of-christmas-eve-moon-bound-launch/", "date": "November 1, 2023", "description": "The first payload teed up for NASA’s industry-led missions to the Moon has arrived in Florida. Astrobotic’s Peregrine lunar lander was unpacked inside a clean room on the Space Coast after leaving the company’s facilities in Pittsburgh, Pennsylvania, on Friday. "}
{"title": "FAA concludes SpaceX Starship safety review, continues environmental review", "link": "https://spaceflightnow.com/2023/10/31/faa-concludes-spacex-starship-safety-review-continues-environmental-review/", "date": "October 31, 2023", "description": "SpaceX’s highly anticipated second test flight of its Starship super heavy lift rocket is one step closer to liftoff from South Texas. On Tuesday, the Federal Aviation Administration announced the conclusion of its safety review. The FAA said it is still working with the U.S. Fish and Wildlife Service to complete an environmental review. "}
{"title": "Falcon 9 adds 23 satellites to Starlink network, pushes total in orbit over 5,000", "link": "https://spaceflightnow.com/2023/10/30/live-coverage-spacex-to-launch-23-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral/", "date": "October 30, 2023", "description": "SpaceX successfully launched a Falcon 9 carrying 23 more satellites for its Starlink internet service from Cape Canaveral. Liftoff from pad 40 occurred at 7:20 p.m. EDT (2320 UTC).  "}
{"title": "Falcon 9 launch scrubbed 30 seconds before liftoff with 23 Starlink satellites", "link": "https://spaceflightnow.com/2023/10/29/live-coverage-spacex-falcon-9-rocket-to-launch-from-cape-canaveral-with-23-starlink-satellites/", "date": "October 29, 2023", "description": "SpaceX encountered an issue with the stage separator prior to launching 23 more satellites for its Starlink internet service from Cape Canaveral. The backup launch window on Monday, Oct. 30, begins at 7:20 p.m. EDT (2320 UTC). "}
{"title": "SpaceX Falcon 9 rocket launches 22 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/10/28/live-coverage-spacex-falcon-9-rocket-to-launch-22-starlink-satellites-from-california/", "date": "October 28, 2023", "description": "The first of two Falcon 9 missions SpaceX is planning for Sunday carried into orbit the largest batch of second-generation Starlink satellites to be launched from the West Coast."}
{"title": "Intuitive Machines targets launch to the Moon in mid-January", "link": "https://spaceflightnow.com/2023/10/27/intuitive-machines-targets-launch-to-the-moon-in-mid-january/", "date": "October 27, 2023", "description": "The first lunar lander aiming for a touchdown at the Moon’s south pole has a new launch date. Intuitive Machines said Friday it is targeting the launch of its Nova-C lander on the IM-1 mission for no earlier than January 12, 2024."}
{"title": "On-time Artemis landings by SpaceX, Blue Origin possible, but face “great challenges”", "link": "https://spaceflightnow.com/2023/10/27/on-time-artemis-landings-by-spacex-blue-origin-possible-but-face-great-challenges/", "date": "October 27, 2023", "description": "The head of NASA’s Human Landing System program sat down with Spaceflight Now to discuss the progress of getting humans back to the Moon for the first time since 1972. "}
{"title": "Spacewalking cosmonauts find radiator coolant leak", "link": "https://spaceflightnow.com/2023/10/25/russian-spacewalkers-to-inspect-leaking-radiator/", "date": "October 25, 2023", "description": "Two Russian spacewalkers floated outside the International Space Station Wednesday and isolated a leaking radiator as planned, apparently causing residual coolant still trapped inside to make its way to the leak site and spew out into space. "}
{"title": "NASA begins to chart path forward on its Mars Sample Return architecture following independent review", "link": "https://spaceflightnow.com/2023/10/24/nasa-begins-to-chart-path-forward-on-its-mars-sample-return-architecture-following-independent-review/", "date": "October 24, 2023", "description": "NASA is aiming to make a determination about the path forward for Mars Sample Return by the end of March 2024. "}
{"title": "SpaceX Falcon 9 launches 23 Starlink satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/10/21/live-coverage-spacex-falcon-9-to-launch-23-starlink-satellites-from-cape-canaveral/", "date": "October 21, 2023", "description": "A SpaceX Falcon 9 rocket launched from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station at 10:17 p.m. EDT (0217 UTC on Oct. 22) carrying 23 Starlink satellites. "}
{"title": "SpaceX Falcon 9 launches 21 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/10/21/live-coverage-spacex-falcon-9-to-launch-21-starlink-satellites-from-california/", "date": "October 21, 2023", "description": "A SpaceX Falcon 9 rocket lifted off with 21 Starlink satellites from Vandenberg Space Force Base in California at 1:23 a.m. PDT (4:23 a.m. EDT, 0823 UTC). It was the first of two Starlink delivery missions planned for Saturday. "}
{"title": "Commercial space companies say cut red tape or U.S. will lose its lead in spaceflight", "link": "https://spaceflightnow.com/2023/10/19/commercial-space-companies-say-cut-red-tape-or-u-s-will-lose-its-lead-in-spaceflight/", "date": "October 19, 2023", "description": "Blue Origin, SpaceX and Virgin Galactic representatives all called for improvements to the regulatory framework that governs spaceflight operations during a Senate subcommittee hearing on Wednesday, Oct. 18, 2023. "}
{"title": "SpaceX battles regulatory process that could hold up Starship test flight for months", "link": "https://spaceflightnow.com/2023/10/18/spacex-battles-regulatory-process-that-could-hold-up-starship-test-flight-for-months/", "date": "October 18, 2023", "description": "SpaceX leadership is heading to Capitol Hill on Wednesday to lobby for greater efficiency when it comes regulatory approval from the Federal Aviation Administration (FAA). The company is hoping to streamline the process of issuing launch licenses for both Starship test flights and more routine Falcon 9 rocket missions."}
{"title": "SpaceX launches Falcon 9 rocket on 47th Starlink launch of 2023", "link": "https://spaceflightnow.com/2023/10/17/live-coverage-spacex-prepares-falcon-9-rocket-launch-of-47th-starlink-launch-of-2023/", "date": "October 17, 2023", "description": "SpaceX launched 22 of its Starlink V2 Mini satellites to low Earth orbit from Space Launch Complex 40 at Cape Canaveral Space Force Station aboard a Falcon 9 rocket at 8:39 p.m. EDT (0039 UTC on Oct. 18). "}
{"title": "SpaceX launches Falcon 9 rocket carrying 22 Starlink satellites on its second Friday launch", "link": "https://spaceflightnow.com/2023/10/13/live-coverage-spacex-to-launch-falcon-9-rocket-carrying-22-starlink-satellites/", "date": "October 13, 2023", "description": "A Falcon 9 rocket carrying 22 Starlink satellites, delayed by upper level winds and held up for the Falcon Heavy launch of NASA’s Psyche, is scheduled to liftoff from Cape Canaveral’s pad 40 at 7:01 p.m. EDT (2301 UTC) on Friday night. "}
{"title": "Falcon Heavy launches NASA’s Psyche asteroid probe", "link": "https://spaceflightnow.com/2023/10/13/falcon-heavy-launches-nasas-psyche-asteroid-probe/", "date": "October 13, 2023", "description": "Getting off to a ground-shaking start, NASA’s $1.2 billion Psyche asteroid probe roared into space atop a Falcon Heavy rocket Friday, setting off on a 2.2-billion-mile voyage to a rare, metal-rich asteroid that may hold clues about how the cores of rocky planets like Earth first formed. "}
{"title": "Live coverage: SpaceX Falcon Heavy launches NASA’s Psyche on mission to a metal asteroid", "link": "https://spaceflightnow.com/2023/10/13/live-coverage-spacex-falcon-heavy-to-launch-nasas-psyche-mission-to-a-metal-asteroid/", "date": "October 13, 2023", "description": "NASA’s $1.2 billion Psyche mission to a metal-rich asteroid has lifted off atop a SpaceX Falcon Heavy rocket. Launch from pad 39A at NASA’s Kennedy Space Center is occurred at 10:19 a.m. EDT (1419 UTC) Friday. "}
{"title": "Weather delays launch of NASA’s billion-dollar Psyche mission to Friday", "link": "https://spaceflightnow.com/2023/10/11/weather-remains-watch-item-for-launching-nasas-billion-dollar-mission-to-asteroid-psyche/", "date": "October 11, 2023", "description": "Due to a poor weather forecast for the Thursday launch attempt, NASA and SpaceX are rescheduling the Psyche asteroid mission launch to Friday morning at 10:19 a.m. EDT (1419 UTC). "}
{"title": "Russian space station laboratory module coolant leak under investigation", "link": "https://spaceflightnow.com/2023/10/09/leak-detected-onboard-russian-segment-of-international-space-station/", "date": "October 9, 2023", "description": "An apparent exterior coolant leak from a Russian laboratory module at the International Space Station has been reported by the crew. It follows similar leaks that struck a Russian Soyuz crew ferry craft and a Progress cargo ship within the past year. "}
{"title": "Strong winds stymie back-to-back SpaceX launch plans; Vandenberg launch successful", "link": "https://spaceflightnow.com/2023/10/08/live-coverage-spacex-falcon-9-rockets-to-launch-from-florida-and-california-with-starlink-satellites/", "date": "October 8, 2023", "description": "SpaceX planned a pair of back-to-back Falcon 9 launches from both coasts but upper level winds scrubbed the liftoff from Florida. A Falcon 9 was able to launch from Vandenberg Space Force Base at 12:43 a.m. PDT (0743 UTC). "}
{"title": "Atlas 5 launches Amazon Kuiper satellites for tests of space-based internet service", "link": "https://spaceflightnow.com/2023/10/07/atlas-5-launches-amazon-kuiper-satellites-for-tests-of-space-based-internet-service/", "date": "October 7, 2023", "description": "A United Launch Alliance Atlas 5 rocket blasted off Friday and boosted a pair of prototype internet satellites into orbit for Amazon’s Kuiper program, the latest entry in the increasingly competitive space-based broadband market currently dominated by SpaceX. "}
{"title": "Rideshare mission on deck for penultimate Vega rocket as Vega-C successor remains sidelined", "link": "https://spaceflightnow.com/2023/10/06/rideshare-mission-on-deck-for-penultimate-vega-rocket-as-vega-c-successor-remains-sidelined/", "date": "October 6, 2023", "description": "A pair of Earth observation satellites along with ten auxiliary payloads will launch aboard Arianespace’s penultimate Vega rocket into sun-synchronous orbit on Friday. Vega lifted off at 9:36 p.m. EDT (0138 UTC) on Sunday after a two-day delay. "}
{"title": "Atlas 5 delivers first Amazon internet satellites to orbit on Friday", "link": "https://spaceflightnow.com/2023/10/05/atlas-5-to-deliver-first-amazon-internet-satellites-to-orbit-on-friday/", "date": "October 5, 2023", "description": "Amazon is getting its own delivery fulfilled this Friday, adding to an extensive portfolio that includes its online marketplace, streaming video, grocery and cloud services, with the launch of two prototype relay stations for a space-based internet service it calls Project Kuiper. "}
{"title": "Northrop Grumman leaves behind solo commercial space station venture, partners with Nanoracks on ‘Starlab’", "link": "https://spaceflightnow.com/2023/10/05/northrop-grumman-leaves-behind-solo-commercial-space-station-venture-partners-with-nanoracks-on-starlab/", "date": "October 5, 2023", "description": "About a year and a half after signing a Space Act Agreement with NASA to develop a commercial space station, Northrop Grumman formally withdrew from its solo plans in order to partner with Nanoracks, a subsidiary of Voyager Space. "}
{"title": "Simple settings tweak should save Psyche asteroid mission from overheating thrusters", "link": "https://spaceflightnow.com/2023/10/02/simple-settings-tweak-should-save-psyche-asteroid-mission-from-overheating-thrusters/", "date": "October 2, 2023", "description": "NASA’s Psyche spacecraft, now scheduled for launch on Oct. 12, will dial down the power of its maneuvering system after engineers discovered its thrusters were in danger of overheating during its eight-year expedition to explore a metallic asteroid. "}
{"title": "Launch of NASA’s Psyche asteroid mission slips a week due to spacecraft issue", "link": "https://spaceflightnow.com/2023/09/28/launch-of-nasas-psyche-asteroid-mission-slips-a-week-due-to-spacecraft-issue/", "date": "September 28, 2023", "description": "The launch of NASA’s Psyche asteroid mission is being delayed a week due to allow “verifications” of parameters used by the spacecraft’s thrusters, the space agency confirmed Thursday. Liftoff on a SpaceX Falcon Heavy rocket is now scheduled for no earlier than Oct. 12. "}
{"title": "Soyuz lands safely in Kazakhstan to end record-breaking mission; Rubio: “It’s good to be home”", "link": "https://spaceflightnow.com/2023/09/27/soyuz-lands-safely-in-kazakhstan-to-end-record-breaking-mission/", "date": "September 27, 2023", "description": "NASA astronaut Frank Rubio and two Russian cosmonauts undocked from the International Space Station and plunged back to Earth early Wednesday, landing on the steppe of Kazakhstan to close out an unexpected yearlong stay in space, the longest single flight in U.S. space history. "}
{"title": "Live coverage: Space station crew return to Earth after 371-day mission", "link": "https://spaceflightnow.com/2023/09/27/live-coverage-space-station-crew-to-return-to-earth-after-371-day-mission/", "date": "September 27, 2023", "description": "Two Russian cosmonauts and a NASA astronaut return to Earth after an extended tour of duty aboard the International Space Station. The landing marked the end of a 370-day-21-hour-22-minute-long mission. It was the third longest human space flight in history and the longest by a U.S. astronaut. "}
{"title": "Rapid response Victus Nox launch success open new possibilities for Space Force, commercial space industry", "link": "https://spaceflightnow.com/2023/09/27/rapid-response-victus-nox-launch-success-open-new-possibilities-for-space-force-commercial-space-industry/", "date": "September 27, 2023", "description": "Nearly two weeks after the successful launch of a payload for the U.S. Space Force’s Space System Command, leaders from the branch along with launch provider, Firefly Aerospace, and satellite manufacturer, Millennium Space Systems, touted the importance and details of the mission during a press briefing on Tuesday. "}
{"title": "Two cosmonauts, NASA astronaut head for Wednesday landing after yearlong mission", "link": "https://spaceflightnow.com/2023/09/26/two-cosmonauts-nasa-astronaut-head-for-wednesday-landing-after-yearlong-mission/", "date": "September 26, 2023", "description": "Outgoing space station commander Sergei Prokopyev and his two Soyuz crewmates, co-pilot Dmitri Petelin and NASA astronaut Frank Rubio, packed up Tuesday for a fiery plunge back to Earth early Wednesday to close out a yearlong stay in orbit, the longest flight in U.S. space history. "}
{"title": "SpaceX Falcon 9 launches Starlink satellites from California", "link": "https://spaceflightnow.com/2023/09/25/live-coverage-spacex-falcon-9-to-launch-starlink-satellites-from-california/", "date": "September 25, 2023", "description": "SpaceX launched its 42nd Starlink delivery mission of the year with a Falcon 9 lifting off from the West Coast carrying a batch of 21 satellites at 1:48 a.m. PDT (4:48 a.m. EDT / 0848 UTC) Monday morning. "}
{"title": "OSIRIS-REx sample return capsule safely lands in Utah", "link": "https://spaceflightnow.com/2023/09/24/osiris-rex-sample-return-capsule-safely-lands-in-utah/", "date": "September 24, 2023", "description": "A saucer-shaped capsule carrying asteroid fragments that may hold clues about the birth of the solar system slammed into Earth’s atmosphere Sunday and descended to an on-target parachute-assisted touchdown in Utah in the final chapter of a dramatic seven-year, four-billion-mile voyage. "}
{"title": "Interview: Talking asteroid sample return", "link": "https://spaceflightnow.com/2023/09/24/talking-asteroid-sample-return/", "date": "September 24, 2023", "description": "Spaceflight Now’s Will Robinson-Smith speaks with some of the key figures at Lockheed Martin, who helped bring the OSIRIS-REx mission to life and will continue working with both the spacecraft and the asteroid samples after the return capsule lands in the Utah desert. "}
{"title": "As it happened: Seven-year asteroid adventure ends with sample return", "link": "https://spaceflightnow.com/2023/09/24/live-coverage-seven-year-asteroid-adventure-to-end-with-sample-return/", "date": "September 24, 2023", "description": "Live coverage as a capsule lands in the U.S. Army test range in the Utah desert carrying samples from the surface of asteroid Bennu. NASA’s OSIRIS-REx (short for the Origins, Spectral Interpretation, Resource Identification, and Security-Regolith Explorer) mission has been on a seven-year journey to Bennu and back. If all goes according to plan the capsule will land under a parachute at about 10:55 a.m. EDT (1455 UTC) on Sunday. "}
{"title": "Another Falcon 9 hits 17-flight milestone with Starlink launch", "link": "https://spaceflightnow.com/2023/09/23/live-coverage-another-falcon-9-gets-ready-to-hit-the-17-flight-milestone/", "date": "September 23, 2023", "description": "A SpaceX Falcon 9 launched from Cape Canaveral Saturday night with a first-stage booster making its 17th flight. It was only the second to reach this milestone. Liftoff, with 22 Starlink satellites occurred at 11:38 p.m. EDT (0338 UTC Sunday). "}
{"title": "NASA is bringing an asteroid sample back to Earth – here’s when, how and why", "link": "https://spaceflightnow.com/2023/09/22/nasa-is-bringing-an-asteroid-sample-back-to-earth-heres-when-how-and-why/", "date": "September 22, 2023", "description": "The sample of asteroid Bennu collected by the OSIRIS-REx spacecraft is set to return to Earth the morning of Sept. 24. "}
{"title": "Artemis 2 astronauts go to the launch pad for launch day practice", "link": "https://spaceflightnow.com/2023/09/22/artemis-2-astronauts-go-to-the-launch-pad-for-launch-day-practice/", "date": "September 22, 2023", "description": "Ahead of launching the Artemis 2 mission no earlier than November 2024, the four astronauts donned test flight suits to go through a pre-launch simulation. They rode to launch pad 39B in Canoo electric vehicles and climbed the Mobile Launcher tower. "}
{"title": "NASA astronaut looks forward to family hugs, peace and quiet, after yearlong flight", "link": "https://spaceflightnow.com/2023/09/22/nasa-astronaut-looks-forward-to-family-hugs-peace-and-quiet-after-yearlong-flight/", "date": "September 22, 2023", "description": "If NASA had asked astronaut Frank Rubio, well in advance, if he would like to spend a full year aboard the International Space Station, he likely would have turned it down. But that’s how it turned out anyway, when trouble with his crew’s Soyuz ferry ship forced them to extended a six-month stay to 12. "}
{"title": "SpaceX launches Falcon 9 on record-breaking 17th flight for booster", "link": "https://spaceflightnow.com/2023/09/20/live-coverage-spacex-to-launch-falcon-9-on-record-breaking-17th-flight-for-booster/", "date": "September 20, 2023", "description": "SpaceX continued to push the boundaries of booster reusability Tuesday night with the launch of a Falcon 9 using a first stage rocket making its 17th flight. Liftoff from pad 40 at Cape Canaveral with 22 satellites for the Starlink internet network occurred at 11:38 p.m. EDT (0338 UTC). "}
{"title": "Radar-imaging satellite lost as Rocket Lab Electron rocket suffers launch failure", "link": "https://spaceflightnow.com/2023/09/19/radar-imaging-satellite-lost-as-rocket-lab-electron-rocket-suffers-launch-failure/", "date": "September 19, 2023", "description": "A Rocket Lab Electron rocket, carrying a radar-imaging satellite for Capella Space, failed on Tuesday after a problem occurred two and half minutes into flight. It was the fourth failure in 41 flights for the small satellite launcher. "}
{"title": "Radar-imaging satellite lost as Rocket Lab Electron rocket fails", "link": "https://spaceflightnow.com/2023/09/18/rocket-lab-electron-rocket-to-launch-cloud-piercing-radar-satellite/", "date": "September 18, 2023", "description": "Rocket Lab’s Electron rocket failed to launch a radar-imaging satellite for Capella Space on Tuesday after a problem occurred shortly after separation of the first stage about two and a half minutes into flight. "}
{"title": "Russian-US crew launches on Soyuz rocket to International Space Station", "link": "https://spaceflightnow.com/2023/09/15/live-coverage-russian-us-crew-to-launch-on-soyuz-rocket-to-international-space-station/", "date": "September 15, 2023", "description": "Two Russian cosmonauts and a NASA astronaut lifted off from the Baikonur Cosmodrome at 11:44 a.m. EDT (1544 UTC) to relieve a space station crew that unexpectedly served a year in space. Russian commander Oleg Kononenko, Russian flight engineer Nikolai Chub and NASA astronaut Loral O’Hara took a fast-track trajectory to the station to dock at about 2:56 p.m. EDT (1856 UTC). "}
{"title": "FAA closes SpaceX-led Starship mishap investigation", "link": "https://spaceflightnow.com/2023/09/12/faa-closes-spacex-led-starship-mishap-investigation/", "date": "September 12, 2023", "description": "The FAA has closed the SpaceX-led mishap investigation following the first Starship Integrated Test Flight (IFT). SpaceX founder Elon Musk also published the checklist of 63 items to be completed before the company can apply for a launch license modification for IFT-2. "}
{"title": "Falcon 9 rocket launches another batch of Starlink satellites from California", "link": "https://spaceflightnow.com/2023/09/12/live-coverage-falcon-9-rocket-to-launch-another-batch-of-starlink-satellites-from-california/", "date": "September 12, 2023", "description": "SpaceX launched another batch of satellites for the company’s Starlink internet service from Vandenberg Space Force Base in California at 11:57 p.m. PDT Monday (2:57 a.m. EDT / 0657 UTC Tuesday). "}
{"title": "Most powerful Atlas 5 rocket launches national security mission", "link": "https://spaceflightnow.com/2023/09/10/live-coverage-most-powerful-atlas-5-rocket-to-launch-on-a-national-security-mission/", "date": "September 10, 2023", "description": "ULA’s Atlas 5 rocket supporting the NROL-107 mission for the Silentbarker program launched Sunday, Sept. 10 at 8:47 a.m. EDT (1247 UTC) from Space Launch Complex-41 at Cape Canaveral Space Force Station. "}
{"title": "SpaceX launches Falcon 9 rocket with 22 Starlink satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/09/08/live-coverage-spacex-to-launch-falcon-9-rocket-with-22-starlink-satellites-from-cape-canaveral/", "date": "September 8, 2023", "description": "A SpaceX Falcon 9 rocket launched 22 second-generation Starlink internet satellites at 11:12 p.m. EDT on Sept. 8 (0312 UTC on Sept. 9) from pad 40 at Cape Canaveral Space Force Station. "}
{"title": "Next-generation X-ray space telescope and lunar lander launches from Japan", "link": "https://spaceflightnow.com/2023/09/06/live-coverage-next-generation-x-ray-space-telescope-and-lunar-lander-to-launch-from-japan/", "date": "September 6, 2023", "description": "A next-generation X-ray space telescope and an experimental lunar lander are back on the launch pad Wednesday after a ten-day delay. An H-2A rocket is scheduled to liftoff from the Tanegashima Space Center in Japan at 7:42 p.m. EDT (8:42 a.m. local time / 2342 UTC). "}
{"title": "Musk declares Starship is ready for its second test flight, following stacking", "link": "https://spaceflightnow.com/2023/09/06/musk-declares-starship-is-ready-for-its-second-test-flight-following-stacking/", "date": "September 6, 2023", "description": "Another SpaceX Starship rocket stands fully integrated against the South Texas horizon and company-founder Elon Musk said from his perspective, they’re ready to launch. However, the Federal Aviation Administration has not yet issued a launch licence. "}
{"title": "Crew Dragon safely splashes down east of Jacksonville", "link": "https://spaceflightnow.com/2023/09/04/crew-dragon-safely-splashes-down-east-of-jacksonville/", "date": "September 4, 2023", "description": "Blazing like a shooting star as it streaked high above northern Florida, a SpaceX Crew Dragon spacecraft carried four space station fliers back to Earth early Monday, splashing down in the Atlantic Ocean east of Jacksonville to wrap up a six-month stay in orbit. "}
{"title": "SpaceX Falcon 9 rocket launches record-breaking 62nd mission of the year", "link": "https://spaceflightnow.com/2023/09/03/live-coverage-falcon-9-rocket-counting-down-to-spacexs-record-breaking-62nd-launch-of-the-year/", "date": "September 3, 2023", "description": "A Falcon 9 rocket launched Sunday evening on a record-breaking 62nd orbital launch of the year for SpaceX. The previous record was set in 2022 with 61 launches by the company. Liftoff from pad 39A at the Kennedy Space Center, with 21 Starlink satellites aboard, occurred at 10:47 p.m. EDT (0247 UTC). "}
{"title": "Crew 6 astronauts return to Earth in SpaceX Dragon Endeavour", "link": "https://spaceflightnow.com/2023/09/03/live-coverage-crew-6-astronauts-to-return-to-earth-in-spacex-dragon-endeavour/", "date": "September 3, 2023", "description": "The members of Crew 6 undocked from the International Space Station aboard SpaceX Dragon Endeavour at 7:05 a.m. EDT (1105 UTC). The capsule splashed down off the coast of Jacksonville, Florida at 12:17 a.m. EDT (0417 UTC) on Monday. "}
{"title": "West Coast Falcon 9 launches 13 demonstration satellites for military mega-constellation", "link": "https://spaceflightnow.com/2023/09/02/west-coast-falcon-9-launches-13-demonstration-satellites-for-military-mega-constellation/", "date": "September 2, 2023", "description": "A Falcon 9 rocket launched 13 demonstration satellites for a planned U.S. military mega-constellation from Vandenberg Space Force Base in California on Saturday. It was the 61st orbital launch of the year for SpaceX. "}
{"title": "SpaceX notches 60th launch of the year with Starlink mission, one shy of tying record", "link": "https://spaceflightnow.com/2023/08/31/spacex-eyes-60th-launch-of-the-year-with-starlink-mission-one-shy-of-tying-record/", "date": "August 31, 2023", "description": "SpaceX launched a Falcon 9 rocket for the company’s 60th orbital launch of the year. The Starlink Group 6-13 mission lifted off at 10:21 p.m. EDT on Thursday, Aug. 31 (0221 UTC on Sept. 1), with a batch of 22 Starlink V2 Mini satellites headed to low Earth orbit. "}
{"title": "Tropical Storm Idalia delays national security Atlas 5 launch from Cape Canaveral", "link": "https://spaceflightnow.com/2023/08/29/tropical-storm-idalia-delays-national-security-atlas-5-launch/", "date": "August 29, 2023", "description": "A tropical storm barreling towards the Florida peninsula caused United Launch Alliance (ULA) to stand down from an Atlas 5 launch planned for Tuesday on a mission for the National Reconnaissance Office. "}
{"title": "International crew arrive at space station aboard SpaceX Dragon Endurance", "link": "https://spaceflightnow.com/2023/08/28/international-crew-arrive-at-space-station-aboard-spacex-dragon-endurance/", "date": "August 28, 2023", "description": "A SpaceX Crew Dragon ferry ship docked at the International Space Station Sunday after a 29-hour rendezvous, bringing four fresh crew members to the lab to replace four others wrapping up a six-month stay in orbit. "}
{"title": "Launch of new X-ray space telescope and lunar lander from Japan delayed", "link": "https://spaceflightnow.com/2023/08/27/live-coverage-japan-to-launch-new-x-ray-space-telescope-and-lunar-lander/", "date": "August 27, 2023", "description": "A next-generation X-ray space telescope and an experimental lunar lander are poised for launch from Japan. An H-2A rocket was scheduled to liftoff from the Tanegashima Space Center Sunday but liftoff has been scrubbed due to upper level winds. "}
{"title": "Meet Crew 7: A truly international space mission", "link": "https://spaceflightnow.com/2023/08/27/meet-crew-7-a-truly-international-space-mission/", "date": "August 27, 2023", "description": "Dragon Endurance features crew members representing four different nations. The mission is commanded by NASA astronaut Jasmin Moghbeli. The pilot is the European Space Agency’s Andreas Mogensen from Denmark. Mission specialists are Japanese astronaut Satoshi Furukawa and Russian cosmonaut Konstantin Borisov. "}
{"title": "SpaceX Dragon capsule arrives at space station with international crew", "link": "https://spaceflightnow.com/2023/08/27/live-coverage-spacex-dragon-capsule-to-arrive-at-space-station-with-international-crew/", "date": "August 27, 2023", "description": "SpaceX Dragon Endurance docked with the International Space Station at 9:16 a.m. EDT (1316 UTC) this morning. The spacecraft carried an international crew of four, representing four different nations to begin a six-month mission. "}
{"title": "SpaceX Falcon 9 launches 22 Starlink satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/08/26/live-coverage-spacex-falcon-9-to-launch-22-starlink-satellites-from-cape-canaveral/", "date": "August 26, 2023", "description": "SpaceX launched its second Falcon 9 mission of the day, sending 22 second-generation Starlink satellites into orbit on Saturday at 9:05 p.m. EDT (0105 UTC). It followed the successful launch of a four-member crew to the International Space Station earlier in the day. "}
{"title": "SpaceX launches first all-international crew to space station", "link": "https://spaceflightnow.com/2023/08/26/spacex-launches-first-all-international-crew-to-space-station/", "date": "August 26, 2023", "description": "Running a day late, a SpaceX Crew Dragon capsule carrying a NASA commander, a Danish co-pilot, a Japanese astronaut and a Russian cosmonaut rocketed into orbit early Saturday and set off after the International Space Station for a six-month tour of duty. "}
{"title": "Electron rocket uses previously-flown engine for launch radar-imaging satellite", "link": "https://spaceflightnow.com/2023/08/24/electron-rocket-uses-previously-flown-engine-to-launch-radar-imaging-satellite/", "date": "August 24, 2023", "description": "Rocket Lab launched its 40th Electron mission Wednesday, Aug. 23, after a switch to a recoverable rocket, which was fitted for the first time with a previously-flown engine. The rocket lifted off from the company’s privately-owned spaceport on the North Island of New Zealand, carrying a radar-imaging satellite, at 7:45 p.m. EDT (11:45 a.m. NZST on the 24th / 2345 UTC). "}
{"title": "Mission Status Center: surprise switch to recoverable booster for 40th Electron mission", "link": "https://spaceflightnow.com/2023/08/23/live-coverage-rocket-lab-makes-surprise-switch-to-recoverable-booster-for-40th-electron-mission/", "date": "August 23, 2023", "description": "Rocket Lab announced on Wednesday its 40th Electron mission was switching to a recoverable rocket, fitted for the first time with a previously flown engine. The surprise move came after two launch scrubs blamed on engine sensor glitches. The rocket lifted off from the company’s privately-owned spaceport on the North Island of New Zealand at 7:45 p.m. EDT (11:45 a.m. NZST on the 24th / 2345 UTC). "}
{"title": "India’s Chandrayaan 3 makes successful lunar landing", "link": "https://spaceflightnow.com/2023/08/23/live-coverage-indias-chandrayaan-3-probe-heads-for-lunar-landing/", "date": "August 23, 2023", "description": "India successfully landed its Chandrayaan 3 robotic probe on the surface of the Moon Wednesday. The Chandrayaan 3 lander touched down near the South Pole of the Moon at about 8:33 a.m. EDT (6:03 p.m. IST).  "}
{"title": "Russia launches cargo ship to the International Space Station", "link": "https://spaceflightnow.com/2023/08/23/live-coverage-russia-to-launch-cargo-to-the-international-space-station/", "date": "August 23, 2023", "description": "A Russian Progress cargo ship blasted off from the Baikonur Cosmodrome on Tuesday at 9:08 p.m. EDT (0108 UTC on Aug. 23) carrying supplies and equipment to the International Space Station."}
{"title": "Space Perspective unveils balloon manufacturing facility supporting tourism missions", "link": "https://spaceflightnow.com/2023/08/22/space-perspective-unveils-balloon-manufacturing-facility-supporting-tourism-missions/", "date": "August 22, 2023", "description": "An upcoming player in the space tourism game offered a look inside their Florida manufacturing site as they continue to ramp up towards customer flights in 2024. Space Perspective is offering a balloon-based opportunity for customers to experience the overview effect in a manner less jarring than launching aboard a rocket or a space plane. "}
{"title": "West Coast Falcon 9 launches SpaceX’s 100th Starlink mission", "link": "https://spaceflightnow.com/2023/08/22/west-coast-falcon-9-launches-spacexs-100th-starlink-mission/", "date": "August 22, 2023", "description": "After delays caused by Hurricane Hilary, SpaceX launched its 100th Starlink mission on Tuesday. A Falcon 9 carrying 21 second-generation Starlink satellites lifted off from Vandenberg Space Force Base in California at 2:37 a.m. PDT (5:37 a.m. EDT / 0937 UTC). "}
{"title": "Crew-7 mission to the Space Station given green light for launch by NASA, partners", "link": "https://spaceflightnow.com/2023/08/22/crew-7-mission-to-the-space-station-given-green-light-for-launch-by-nasa-partners/", "date": "August 22, 2023", "description": "NASA, SpaceX and its international partners met at the Kennedy Space Center on Monday and gave the go ahead for the launch of the seventh operational Crew Dragon mission to the space station. "}
{"title": "Falcon 9 test-fired ahead of space station crew launch", "link": "https://spaceflightnow.com/2023/08/21/mission-status-center-falcon-9-arrives-at-launch-pad-39a/", "date": "August 21, 2023", "description": "SpaceX test fired a Falcon 9 rocket Tuesday ahead of Friday’s planned 3:50 a.m. EDT (0750 UTC) liftoff on the Crew 7 mission to the International Space Station. "}
{"title": "International crew arrive in Florida ahead of space station mission", "link": "https://spaceflightnow.com/2023/08/20/international-crew-arrive-in-florida-ahead-of-space-station-mission/", "date": "August 20, 2023", "description": "The next four crew members bound for a six-month stay aboard the International Space Station flew to the Kennedy Space Center Sunday to prepare for launch early Friday atop a SpaceX Falcon 9 rocket. "}
{"title": "Russia’s Luna 25 lander crashes on the Moon", "link": "https://spaceflightnow.com/2023/08/20/russias-luna-25-lander-crashes-on-the-moon/", "date": "August 20, 2023", "description": "Russia’s first mission to the Moon for nearly 50 years ended in failure when the Luna 25 spacecraft crashed onto the surface, the Russian space agency Roscomos said Sunday. "}
{"title": "Starlink satellites soar from Florida, west coast launch slips to Monday due to hurricane", "link": "https://spaceflightnow.com/2023/08/17/starlink-satellites-soar-from-florida-west-coast-launch-slips/", "date": "August 17, 2023", "description": "A Falcon 9 lifted off from Cape Canaveral late Wednesday carrying 22 Starlink satellites but a launch from California scheduled for just hours later was delayed, dashing SpaceX’s plans for back-to-back launches for its broadband internet service. "}
{"title": "SpaceX launches Starlink mission from Florida, delays west coast mission", "link": "https://spaceflightnow.com/2023/08/16/spacex-to-launch-starlink-missions-from-both-coasts-tonight/", "date": "August 16, 2023", "description": "SpaceX launched one Starlink mission from Florida but plans for a back-to-back overnight mission from the west coast were dashed after the Falcon 9 flying from Vandenberg Space Force Base California was delayed to Friday. "}
{"title": "NASA’s moon program mobile launcher rolls back to the launch pad for testing", "link": "https://spaceflightnow.com/2023/08/16/nasas-mobile-launcher-rolls-back-to-the-launch-pad-for-testing/", "date": "August 16, 2023", "description": "The launch tower supporting the first three Artemis missions was back on the move for the first time Wednesday after more than half a year of repairs and upgrades. "}
{"title": "Russia shoots for the Moon for the first time since 1976", "link": "https://spaceflightnow.com/2023/08/10/russia-shoots-for-the-moon-for-the-first-time-since-1976/", "date": "August 10, 2023", "description": "Russia launched its first robotic mission to the moon since 1976 on Thursday. The Luna 25 spacecraft, also known as the Luna-Glob-Lander lifted off at 7:10 p.m. EDT (2310 UTC). "}
{"title": "22 Starlink satellites soar from Cape Canaveral", "link": "https://spaceflightnow.com/2023/08/10/live-coverage-22-starlink-satellites-set-to-soar-from-cape-canaveral/", "date": "August 10, 2023", "description": "SpaceX launched  a Falcon 9 rocket from Cape Canaveral early Friday morning carrying another 22 second-generation Starlink satellites into orbit. Liftoff from pad 40 occurred at 1:17 a.m. EDT (0517 UTC). "}
{"title": "Virgin Galactic flies its first space tourists", "link": "https://spaceflightnow.com/2023/08/10/virgin-galactic-to-fly-its-first-space-tourists/", "date": "August 10, 2023", "description": "A mother and daughter from Antigua and Barbuda, along with an 80-year-old British Olympian who suffers from Parkinson’s, two pilots and a passenger escort rocketed out of the lower atmosphere and into space Thursday in Virgin Galactic’s first up-and-down sub-orbital flight featuring sight-seeing space tourists. "}
{"title": "Russian cosmonauts make spacewalk at International Space Station", "link": "https://spaceflightnow.com/2023/08/09/live-coverage-russian-cosmonauts-make-spacewalk-at-international-space-station/", "date": "August 9, 2023", "description": "A cosmonaut took a test ride on the end of a European robot arm during a six-hour 35-minute spacewalk outside the International Space Station Wednesday amid work to install three micrometeoroid debris shields and relocate a work platform. "}
{"title": "Artemis 2 astronauts get first look at their Orion moonship", "link": "https://spaceflightnow.com/2023/08/08/artemis-2-astronauts-get-first-look-at-their-orion-moonship/", "date": "August 8, 2023", "description": "NASA’s four Artemis 2 astronauts, getting their first look at the Orion capsule that will carry them around the moon next year, said seeing the hardware first hand and meeting the men and women building the spacecraft brought home the reality of their historic mission. "}
{"title": "SpaceX launches 15 Starlink satellites from West Coast", "link": "https://spaceflightnow.com/2023/08/08/live-coverage-spacex-to-launch-15-starlink-satellites-from-west-coast/", "date": "August 8, 2023", "description": "A SpaceX Falcon 9 rocket launched Monday carrying 15 second-generation Starlink satellites. Liftoff from Space Launch Complex 4 East at Vandenberg Space Force Base in California occurred at 8:57 p.m. PDT (11:57 p.m. EDT / 0357 UTC). "}
{"title": "First piloted flight of Boeing’s oft-delayed Starliner spacecraft slips to at least March", "link": "https://spaceflightnow.com/2023/08/08/first-piloted-flight-of-boeings-oft-delayed-starliner-spacecraft-slips-to-at-least-march/", "date": "August 8, 2023", "description": "The first piloted launch of Boeing’s oft-delayed Starliner crew capsule is slipping to next March at the earliest because of ongoing work to test and replace the capsule’s parachute system and to resolve issues with a flammable adhesive used in protective electrical tape, officials said Monday. "}
{"title": "Amazon to launch first Kuiper satellites on ULA Atlas 5 rocket following Vulcan delays", "link": "https://spaceflightnow.com/2023/08/07/amazon-to-launch-first-kuiper-satellites-on-ula-atlas-5-rocket-following-vulcan-delays/", "date": "August 7, 2023", "description": "The opening salvo in Amazon’s 3,236-satellite Project Kuiper venture is switching its ride to space. An Amazon spokesperson confirmed in a statement to Spaceflight Now on Monday that the first two demonstration satellites for the broadband constellation will launch on a United Launch Alliance (ULA) Atlas 5 rocket as soon as Sept. 26, 2023, instead of the inaugural Vulcan rocket. "}
{"title": "Falcon 9 chalks up new launch pad turnaround record on Starlink launch", "link": "https://spaceflightnow.com/2023/08/06/live-coverage-falcon-9-goes-for-launch-pad-record-on-starlink-launch/", "date": "August 6, 2023", "description": "A SpaceX Falcon 9 rocket launched from Cape Canaveral Sunday carrying 22 more second-generation Starlink satellites into orbit, breaking a launch pad turnaround record. "}
{"title": "SpaceX conducts static test fire of Starship Super Heavy Booster", "link": "https://spaceflightnow.com/2023/08/06/spacex-plans-static-test-fire-of-starship-super-heavy-booster/", "date": "August 6, 2023", "description": "SpaceX fired up its Starship Super Heavy Booster 9 for a static test of its liquid methane-fueled Raptor rocket engines. The test was advertised to last “just under five seconds” but appeared to be cut short at 2.74 seconds. Four of the 33 Raptor engines were reported to have shut down prematurely. "}
{"title": "Rocket Lab’s Electron rocket launch scrubbed", "link": "https://spaceflightnow.com/2023/08/05/rocket-labs-40th-electron-rocket-readied-for-second-launch-attempt/", "date": "August 5, 2023", "description": "Rocket Lab has called off Sunday’s attempt to launch its 40th Electron rocket due to “out-of-family sensor data”. No new launch date has been set. The rocket is carrying Acadia 1, the first of four new radar-imaging satellites for Earth observation company, Capella Space. "}
{"title": "Cygnus cargo ship berthed at space station", "link": "https://spaceflightnow.com/2023/08/04/cygnus-cargo-ship-berthed-at-space-station/", "date": "August 4, 2023", "description": "An unpiloted Northrop Grumman Cygnus cargo ship carrying four tons of supplies and equipment caught up with the International Space Station early Friday to wrap up a smooth two-and-a-half-day rendezvous. "}
{"title": "Intelsat completes refresh of satellites with Falcon 9 launch of Galaxy 37", "link": "https://spaceflightnow.com/2023/08/03/intelsat-completes-refresh-of-satellites-with-falcon-9-launch-of-galaxy-37/", "date": "August 3, 2023", "description": "SpaceX launched an Intelsat communications satellite early Thursday, part of a fleet-wide refresh under a Federal Communications Commission push to free up transmission space for 5G cellular networks. "}
{"title": "Last Antares rocket using Russian, Ukrainian parts launches space station cargo", "link": "https://spaceflightnow.com/2023/08/01/nasa-northrop-grumman-to-launch-space-station-cargo-mission/", "date": "August 1, 2023", "description": "A Northrop Grumman Cygnus cargo ship lifted off from Wallops Island, Virginia, atop an Antares rocket at 8:31 p.m. EDT (0031 UTC on Aug. 2). This mission marks the final flight of this generation of Antares rockets, which uses major components from Russia and Ukraine. "}
{"title": "Delayed Falcon Heavy launch pushes back Crew 7 mission", "link": "https://spaceflightnow.com/2023/08/01/delayed-falcon-heavy-launch-pushes-back-crew-7-mission/", "date": "August 1, 2023", "description": "The next quartet bound for the International Space Station will wait a bit longer before they can punch their ticket to space after Falcon Heavy delays pushed back the launch of the next Crew Dragon mission, NASA said Tuesday. "}
{"title": "Rocket Lab Electron aborts launch in final seconds", "link": "https://spaceflightnow.com/2023/07/29/rocket-lab-poised-for-40th-electron-launch-on-sunday/", "date": "July 29, 2023", "description": "The launch of the 40th Electron rocket mission was aborted during the engine ignition sequence at about 3 a.m. EDT (0700 UTC) on Sunday. Rocket Lab has scrubbed the launch for the day. "}
{"title": "Falcon Heavy launches heaviest commercial communications satellite yet", "link": "https://spaceflightnow.com/2023/07/29/falcon-heavy-launches-heaviest-commercial-communications-satellite-yet/", "date": "July 29, 2023", "description": "SpaceX launched the world’s heaviest commercial communications satellite atop a Falcon Heavy rocket on Friday. The triple-core rocket lifted off from Kennedy Space Center’s pad 39A with the Jupiter 3/EchoStar 24 satellite at 11:04 p.m. EDT (0304 UTC Saturday). "}
{"title": "SpaceX breaks launchpad turnaround record with midnight Starlink launch", "link": "https://spaceflightnow.com/2023/07/28/live-coverage-spacex-to-launch-another-22-starlink-satellites/", "date": "July 28, 2023", "description": "SpaceX successfully launched its Falcon 9 rocket carrying 22 more Starlink V2 Mini satellites into low Earth orbit Thursday night after scrapping plans for a launch double-header with a Falcon Heavy rocket. The Falcon 9 lifted off from pad 40 at Cape Canaveral Space Force Station at 12:01 a.m. EDT (0401 UTC). "}
{"title": "SpaceX standing down from record-breaking double-launch attempt", "link": "https://spaceflightnow.com/2023/07/27/spacex-to-try-again-for-a-record-breaking-double-launch/", "date": "July 27, 2023", "description": "SpaceX could break the record for the shortest time between Cape Canaveral launches Thursday night if it can launch a Falcon 9 and Falcon Heavy in quick succession. But achieving that assumes the weather cooperates and any technical issues with the Falcon Heavy can be resolved. "}
{"title": "Falcon Heavy launch of largest commercial communications satellite scrubbed", "link": "https://spaceflightnow.com/2023/07/26/falcon-heavy-on-the-pad-for-largest-commercial-communications-satellite-launch-yet/", "date": "July 26, 2023", "description": "The launch of a SpaceX Falcon Heavy with the Jupiter 3/EchoStar 24 satellite, the heaviest commercial communications satellite ever, was scrubbed Wednesday with one minute, five seconds left on the countdown clock. "}
{"title": "Falcon 9 evades thunderstorms, launches 22 Starlink satellites", "link": "https://spaceflightnow.com/2023/07/23/live-coverage-falcon-9-faces-florida-thunderstorms-again-on-second-launch-attempt/", "date": "July 23, 2023", "description": "SpaceX launched a Falcon 9 rocket from Cape Canaveral on Sunday after thunderstorms postponed the mission the day before. The rocket with 22 second-generation Starlink satellites aboard lifted off at 8:50 p.m. EDT (0050 UTC on July 25). "}
{"title": "Weather scrubs Falcon 9 launch of Starlink internet satellites", "link": "https://spaceflightnow.com/2023/07/22/live-coverage-falcon-9-to-launch-with-another-batch-batch-of-starlink-internet-satellites/", "date": "July 22, 2023", "description": "Stormy weather forced SpaceX to scrub Saturday’s launch of the Falcon 9 before the completion of propellant load. The next launch opportunity carrying 22 more second-generation Starlink satellites is Sunday at 7:09 p.m. EDT (2309 UTC). "}
{"title": "Amazon unveils plans for $120 million satellite processing facility for its internet constellation", "link": "https://spaceflightnow.com/2023/07/21/amazon-unveils-plans-for-120-million-satellite-processing-facility-for-its-internet-constellation/", "date": "July 21, 2023", "description": "On Friday, online retail giant amazon will join with members of Space Florida to reveal its plans for a 100,000-square-foot satellite processing facility located at Space Florida’s Launch and Landing Facility (LLF) at NASA’s Kennedy Space Center. "}
{"title": "SpaceX Falcon 9 launches 2nd generation Starlinks from West Coast", "link": "https://spaceflightnow.com/2023/07/18/falcon-9-to-launch-first-west-coast-second-generation-starlink-satellites/", "date": "July 18, 2023", "description": "SpaceX launched a Falcon 9 rocket carrying the first batch of second-generation Starlink satellites to be lofted from the West Coast. Liftoff is occurred at 9:09 p.m. PDT (12:09 a.m. EDT / 0409 UTC ). The launch was aborted Tuesday in the final seconds of the countdown. "}
{"title": "Rocket Lab launches seven satellites, recovers Electron booster after splashdown", "link": "https://spaceflightnow.com/2023/07/17/live-coverage-rocket-lab-to-launch-seven-satellites-recover-electron-booster-at-sea/", "date": "July 17, 2023", "description": "Rocket Lab launched an Electron rocket, carrying seven small satellites, from its launch site on the Mahia Peninsula in New Zealand at 9:27 p.m. EDT (0127 UTC). The first stage of the Electron rocket parachuted into the ocean for recovery as part of Rocket Lab’s efforts to reuse the rocket. "}
{"title": "SpaceX launches second Falcon 9 booster on a 16th flight", "link": "https://spaceflightnow.com/2023/07/16/live-coverage-spacex-tries-again-to-launch-falcon-9-booster-making-16th-flight/", "date": "July 16, 2023", "description": "For the second time this week, SpaceX pushed the envelope by flying a Falcon 9 rocket for a 16th time. Booster 1060 lifted off from Cape Canaveral’s pad 40 at 11:50 p.m. EDT (0350 UTC) Saturday carrying 54 Starlink satellites into orbit. "}
{"title": "SpaceX test fires Falcon 9 booster following last-minute launch scrub", "link": "https://spaceflightnow.com/2023/07/15/spacex-to-test-fire-falcon-9-booster-following-last-minute-launch-scrub/", "date": "July 15, 2023", "description": "SpaceX test fired a Falcon 9 on pad 40 at Cape Canaveral tonight to try to clear the booster for its 16th flight. A launch attempt early Friday was aborted in the final minute of the countdown. SpaceX did not disclose the reason for the scrub. "}
{"title": "India tries for successful Moon mission with second lander launch", "link": "https://spaceflightnow.com/2023/07/14/india-tries-for-successful-moon-mission-with-second-lander-launch/", "date": "July 14, 2023", "description": "For the third time in its space program, the Indian Space Research Organization (ISRO) launched a mission to the Moon. India is hoping for a more successful outcome this time around after a failed attempt to land safely on the Moon back in 2019. "}
{"title": "Scrub called in final minute of SpaceX’s attempt to launch another booster on 16th mission", "link": "https://spaceflightnow.com/2023/07/14/live-coverage-spacex-to-launch-another-booster-on-16th-mission/", "date": "July 14, 2023", "description": "SpaceX scrubbed the launch of a Falcon 9, that was due to make its 16th flight, in the final minute of the countdown. No reason was given for the hold and SpaceX said it was targeting no earlier than Saturday at 11:50 p.m. EDT (0350 UTC) for another launch attempt. "}
{"title": "ULA outlines path to inaugural Vulcan launch following upper stage issues", "link": "https://spaceflightnow.com/2023/07/13/ula-outlines-path-to-inaugural-vulcan-launch-following-upper-stage-issues/", "date": "July 13, 2023", "description": "The debut of United Launch Alliance’s next generation rocket, the Vulcan Centaur, is now scheduled for the fourth quarter of 2023, company CEO and President Tory Bruno said during a media briefing on Thursday. "}
{"title": "NASA celebrates Webb science anniversary with mesmerising new image", "link": "https://spaceflightnow.com/2023/07/13/nasa-celebrates-webb-science-anniversary-with-mesmerising-new-image/", "date": "July 13, 2023", "description": "NASA marks the first anniversary of Webb science observations with a spectacular look into a nearby stellar nursery where 50 young sun-like stars are lighting up their surroundings. "}
{"title": "Ariane 5 retirement leaves Europe facing an ‘acute launch crisis’", "link": "https://spaceflightnow.com/2023/07/11/ariane-5-retirement-leaves-europe-facing-an-acute-launch-crisis/", "date": "July 11, 2023", "description": "Europe is facing months without its own independent access to space for large satellites following the retirement of its heavy-lift Ariane 5 rocket this week after notching up its 117th and final mission over 27 years of operations. "}
{"title": "SpaceX pushes the envelope with record-breaking 16th flight for a Falcon 9 booster", "link": "https://spaceflightnow.com/2023/07/08/spacex-to-push-the-envelope-with-record-breaking-16th-flight-for-a-falcon-9-booster/", "date": "July 8, 2023", "description": "SpaceX tested the limits of its reusable Falcon 9 rocket on Sunday evening when it launches a booster on a record-breaking 16th flight. The Falcon 9 is lifted off from Cape Canaveral at 11:58 p.m. EDT (0358 UTC Monday) carrying a batch of second-generation Starlink satellites. "}
{"title": "West Coast launch puts 48 more Starlink internet satellites in orbit", "link": "https://spaceflightnow.com/2023/07/08/west-coast-launch-puts-48-more-starlink-internet-satellites-in-orbit/", "date": "July 8, 2023", "description": "SpaceX lofted another batch of Starlink internet satellites into orbit on Friday from Vandenberg Space Force Base in California. A Falcon 9, with 48 satellites inside its payload fairing, lifted off at 12:29:50 p.m. PDT (3:29:50 p.m. EDT; 1929:50 UTC) from Space Launch Complex 4-East."}
{"title": "Mission Status Center: SpaceX launches 48 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/07/07/mission-status-starlink5-13/", "date": "July 7, 2023", "description": "Another batch of Starlink internet satellites rode a SpaceX Falcon 9 rocket into orbit Friday from Vandenberg Space Force Base in California. Liftoff occurred at 12:29:50 p.m. PDT (3:29:50 p.m. EDT; 1929:50 UTC) "}
{"title": "Mars helicopter calls home after long communications blackout", "link": "https://spaceflightnow.com/2023/07/05/mars-helicopter-calls-home-after-long-communications-blackout/", "date": "July 5, 2023", "description": "NASA engineers are prepping the miniature Mars helicopter Ingenuity for its 53rd flight across the surface of the Red Planet after re-establishing contact following a two-month radio blackout due to a Martian hill blocking line-of-sight communications with the Perseverance rover. "}
{"title": "Europe’s workhorse Ariane 5 rocket to retire after 27 years service", "link": "https://spaceflightnow.com/2023/07/04/europes-workhorse-ariane-5-rocket-to-retire-after-27-years-service/", "date": "July 4, 2023", "description": "Europe’s iconic Ariane 5 rocket, with its liquid hydrogen-fueled core stage and solid rocket boosters, has been symbolic of Europe’s guaranteed access to space providing a unique capacity for launching satellites and spacecraft into precise orbits over almost three decades. Its long run comes to an end when the final Ariane 5 rocket lifts off on Wednesday. "}
{"title": "The last European Ariane 5 rocket arrives at the launch pad for its final countdown", "link": "https://spaceflightnow.com/2023/07/03/the-last-ariane-5-arrives-at-the-launch-pad-for-its-final-countdown/", "date": "July 3, 2023", "description": "The last Ariane 5 rocket was hauled to the launch pad on Monday at the Guiana Space Centre, Europe’s South American spaceport. Ariane 5, which for years was the world’s leading commercial satellite launcher, is scheduled to make its final lift off on Tuesday, carrying a French military satellite and a communications technology testbed spacecraft for Germany. "}
{"title": "SpaceX launches European ‘dark energy telescope’ to help unravel cosmology’s biggest mysteries", "link": "https://spaceflightnow.com/2023/07/01/spacex-launches-european-dark-energy-telescope-to-help-unravel-cosmologys-biggest-mysteries/", "date": "July 1, 2023", "description": "The European Space Agency launched its $1.5 billion Euclid space telescope Saturday, an ambitious, first-of-a-kind attempt to pin down the nature of dark matter, an unknown material pervading the cosmos, and dark energy, the mysterious repulsive force that is speeding up the expansion of the universe. "}
{"title": "Euclid prepares to blast off on a mission to discover the fate of the Universe", "link": "https://spaceflightnow.com/2023/07/01/euclid-prepares-to-blast-off-on-a-mission-to-discover-the-fate-of-the-universe/", "date": "July 1, 2023", "description": "The European Space Agency’s (ESA) Euclid space telescope will blast off from Cape Canaveral on Saturday on a mission to shed light on the ‘dark universe’ dominated by dark matter and dark energy. Liftoff atop a Falcon 9 rocket from pad 40 is set for 11:12 a.m. EDT (1512 UTC). "}
{"title": "Virgin Galactic launches its first commercial flight to space", "link": "https://spaceflightnow.com/2023/06/29/virgin-galactic-launches-its-first-commercial-flight-to-space/", "date": "June 29, 2023", "description": "Richard Branson’s Virgin Galactic launched its first commercial space flight Thursday, sending three Italian researchers, two company pilots and an astronaut trainer on a high-speed thrill ride to the edge of space aboard a winged rocketplane. The crew experienced about three minutes of weightlessness. Total time between air launch and landing: just under 14 minutes."}
{"title": "Virgin Galactic readies spaceplane for first commercial flight on Thursday", "link": "https://spaceflightnow.com/2023/06/29/virgin-galactic-readies-spaceplane-for-first-commercial-flight/", "date": "June 29, 2023", "description": "Four-and-a-half years after an initial sub-orbital test flight, Richard Branson’s Virgin Galactic is finally ready to begin commercial operations with the launch Thursday of a six-man crew, including three Italian researchers, on an up-and-down flight to the edge of space aboard the company’s winged spaceplane. "}
{"title": "First hot-fire test of Europe’s reusable methane-fueled Prometheus rocket engine", "link": "https://spaceflightnow.com/2023/06/28/first-hot-fire-test-of-europes-reusable-prometheus-rocket-engine/", "date": "June 28, 2023", "description": "Europe successfully completed the first hot-fire test of its reusable Prometheus rocket on June 22, a 12-second burn while integrated to the Themis first-stage demonstrator at the ArianeGroup site in Vernon, France. Prometheus and Themis are components of the new ‘Ariane Next’ European launch program, which is focused on developing a fleet of reusable rockets to enter service in the 2030s. "}
{"title": "SpaceX conducts six-engine test fire as it gears up for second Starship flight", "link": "https://spaceflightnow.com/2023/06/27/spacex-conducts-six-engine-test-fire-as-it-gears-up-for-second-starship-flight/", "date": "June 27, 2023", "description": "SpaceX conducted a six-engine static test fire on Monday of the Starship vehicle that will eventually be paired with a Super Heavy booster for the second test flight of the company’s fully-reusable launch system. The firing took place at SpaceX’s Starbase facility in south Texas. "}
{"title": "Final Ariane 5 launch scheduled for July 4 after fixes to booster separation system", "link": "https://spaceflightnow.com/2023/06/26/final-ariane-5-launch-scheduled-for-july-4-after-fixes-to-booster-separation-system/", "date": "June 26, 2023", "description": "Europe’s last Ariane 5 rocket is now scheduled to lift off July 4 after being grounded for more than two weeks due to a problem with the pyrotechnic systems required to jettison the launcher’s strap-on solid rocket boosters. Europe’s workhorse rocket is being retired after 27 years of service. "}
{"title": "Musk outlines major upgrades for Starship rocket", "link": "https://spaceflightnow.com/2023/06/25/musk-outlines-major-upgrades-for-starship-rocket/", "date": "June 25, 2023", "description": "SpaceX will need another six weeks or so to finish implementing hundreds of changes to its Super Heavy-Starship rocket and the gargantuan booster’s Texas launch pad before it will be ready for a second attempt to reach orbit, company founder Elon Musk said Saturday. "}
{"title": "SpaceX closes out first half of 2023 with another Starlink launch", "link": "https://spaceflightnow.com/2023/06/23/falcon-9-starlink-5-12-coverage/", "date": "June 23, 2023", "description": "A Falcon 9 rocket lifted off from Cape Canaveral Friday with another batch of Starlink internet satellites, wrapping up SpaceX’s action-packed first half of the year with the company’s 44th mission of 2023. "}
{"title": "Live coverage: SpaceX launches 47 more Starlink satellites from California", "link": "https://spaceflightnow.com/2023/06/22/falcon-9-starlink-5-7-mission-status-center/", "date": "June 22, 2023", "description": "Another batch of 47 Starlink internet satellites rode a SpaceX rocket into orbit early Thursday from Vandenberg Space Force Base in California, continuing the company’s record flight rate with another Falcon 9 launch and landing. Liftoff occurred at 12:19 a.m. PDT (3:19 a.m. EDT; 0719 UTC). "}
{"title": "Delta 4-Heavy rocket lifts off with NRO spy satellite", "link": "https://spaceflightnow.com/2023/06/22/delta-4-heavy-nrol-68-coverage/", "date": "June 22, 2023", "description": "The second-to-last flight of United Launch Alliance’s Delta rocket lifted off from Cape Canaveral early Thursday and delivered a top secret spy satellite into orbit for the U.S. government, snapping the longest lull in launches in ULA’s history. "}
{"title": "ULA’s Delta rocket assembly line falls silent", "link": "https://spaceflightnow.com/2023/06/20/ulas-delta-rocket-assembly-line-falls-silent/", "date": "June 20, 2023", "description": "United Launch Alliance has closed its Delta rocket assembly line in Alabama after the 389th and last Delta rocket rolled out of the factory for the journey to its launch base in Florida, clearing real estate in ULA’s sprawling manufacturing center for the next-generation Vulcan launch vehicle. "}
{"title": "Indonesian communications satellite launched by SpaceX rocket", "link": "https://spaceflightnow.com/2023/06/18/falcon-9-psn-satria-coverage/", "date": "June 18, 2023", "description": "A Father’s Day launch of a SpaceX Falcon 9 rocket from Cape Canaveral hauled into orbit a European-built communications satellite, the centerpiece of a nearly $550 million project to provide internet service to rural Indonesia. "}
{"title": "Space station astronauts continue power system upgrades with new solar array", "link": "https://spaceflightnow.com/2023/06/15/us-eva-88-coverage/", "date": "June 15, 2023", "description": "NASA astronauts Woody Hoburg and Steve Bowen ventured back outside the International Space Station Thursday for their second spacewalk in six days to install and deploy another roll-out solar array to augment the power system on the orbiting laboratory. "}
{"title": "SpaceX nails 200th rocket landing after launch with 72 small satellites", "link": "https://spaceflightnow.com/2023/06/12/spacex-nails-200th-rocket-landing-after-launch-with-72-small-satellites/", "date": "June 12, 2023", "description": "SpaceX launched 72 small payloads into polar orbit from California’s Central Coast Monday, delivering satellites to space for customers around the world while accomplishing the 200th landing of a Falcon rocket since the first booster recovery in 2015. "}
{"title": "Live coverage: SpaceX’s Transporter 8 rideshare mission lifts off from California", "link": "https://spaceflightnow.com/2023/06/12/falcon-9-transporter-8-mission-status-center/", "date": "June 12, 2023", "description": "SpaceX launched a cluster of 72 small payloads for customers in at least 18 countries into polar orbit from California Monday on the company’s eighth small satellite rideshare mission. The mission, known as Transporter 8, lifted off at 2:35 p.m. PDT (5:35 p.m. EDT; 2135 UTC)."}
{"title": "SpaceX launches another 52 Starlink internet satellites", "link": "https://spaceflightnow.com/2023/06/12/falcon-9-starlink-5-11-coverage/", "date": "June 12, 2023", "description": "SpaceX’s 40th launch of the year sent another batch of 52 Starlink internet satellites into orbit from Cape Canaveral early Monday aboard a Falcon 9 rocket. "}
{"title": "Astronauts install new roll-out solar array outside International Space Station", "link": "https://spaceflightnow.com/2023/06/09/us-eva-87-coverage/", "date": "June 9, 2023", "description": "Astronauts Steve Bowen and Woody Hoburg suited up and floated outside the International Space Station Friday for a spacewalk to install and unroll an upgraded solar array wing delivered to the complex earlier this week by a SpaceX Cargo Dragon supply ship. "}
{"title": "Virgin Orbit ceases operations", "link": "https://spaceflightnow.com/2023/06/08/virgin-orbit-ceases-operations/", "date": "June 8, 2023", "description": "Virgin Orbit, the satellite launch company founded by British billionaire Richard Branson, permanently ceased operations last month, following a major mission failure in January at a time when it was already facing financial headwinds.  "}
{"title": "NASA concerned SpaceX’s Starship schedule could delay moon landing", "link": "https://spaceflightnow.com/2023/06/07/nasa-concerned-spacexs-starship-schedule-could-delay-first-artemis-moon-landing/", "date": "June 7, 2023", "description": "A senior NASA official raised concerns Wednesday that “difficulties” with SpaceX’s development of the huge new Starship rocket could delay the Artemis program’s first moon landing with astronauts from late 2025, a mission that will use a derivative of the Starship vehicle to ferry a two-person crew to and from the lunar surface. "}
{"title": "ULA test-fires first Vulcan rocket at Cape Canaveral", "link": "https://spaceflightnow.com/2023/06/07/vulcan-centaur-frf-coverage/", "date": "June 7, 2023", "description": "United Launch Alliance’s first Vulcan Centaur rocket completed a critical test-firing of its Blue Origin-built BE-4 main engines Wednesday night, clearing one of two remaining technical hurdles before the launcher is cleared for its inaugural flight later this year. "}
{"title": "Cargo Dragon docks at space station", "link": "https://spaceflightnow.com/2023/06/06/cargo-dragon-docks-at-space-station/", "date": "June 6, 2023", "description": "Closing out an automated 18-hour rendezvous, a SpaceX Dragon cargo ship loaded with 7,000 pounds of supplies and equipment, including two add-on roll-out solar blankets, caught up with the International Space Station early Tuesday and moved in for a problem-free docking. "}
{"title": "SpaceX launch sends upgraded solar arrays to International Space Station", "link": "https://spaceflightnow.com/2023/06/05/falcon-9-crs-28-coverage/", "date": "June 5, 2023", "description": "SpaceX’s 28th resupply mission to the International Space Station lifted off Monday from the Kennedy Space Center, carrying new solar arrays, fresh food, and experiments to sustain research and upgrade the power system on the orbiting laboratory."}
{"title": "More second-gen Starlink satellites launch on Falcon 9 rocket", "link": "https://spaceflightnow.com/2023/06/04/falcon-9-starlink-6-4-coverage/", "date": "June 4, 2023", "description": "SpaceX launched a Falcon 9 rocket from Cape Canaveral Sunday morning with 22 upgraded Starlink internet satellites, but officials called off a second Falcon 9 launch later in the day due to high winds in the booster’s offshore recovery area. "}
{"title": "Shenzhou crew capsule brings home three Chinese astronauts", "link": "https://spaceflightnow.com/2023/06/03/shenzhou-crew-capsule-brings-home-three-chinese-astronauts/", "date": "June 3, 2023", "description": "Three Chinese astronauts departed the Tiangong space station Saturday and landed in the remote Gobi Desert of northwestern China, capping a six-month expedition that included four spacewalks and a host of experiments in the microgravity environment of low Earth orbit. "}
{"title": "Live coverage: Three Chinese astronauts return to Earth", "link": "https://spaceflightnow.com/2023/06/03/shenzhou-15-landing-mission-status-center/", "date": "June 3, 2023", "description": "Wrapping up a six-month mission in orbit, three Chinese astronauts departed the Tiangong space station Saturday and landed in the remote Gobi Desert of northwestern China at 6:33 p.m. EDT (2233 UTC). "}
{"title": "Webb spots vast plume of water vapor spewing from Saturn’s moon Enceladus", "link": "https://spaceflightnow.com/2023/06/02/webb-spots-vast-plume-of-water-vapor-spewing-from-saturns-moon-enceladus/", "date": "June 2, 2023", "description": "Using the sensitivity of the James Webb Space Telescope, astronomers have managed to detect a vast plume of water vapor spewing from the southern pole of Saturn’s moon Enceladus, a jet extending nearly 6,000 miles and feeding a previously detected torus circling the entire planet. "}
{"title": "Third set of upgraded solar arrays ready for ride to International Space Station", "link": "https://spaceflightnow.com/2023/06/02/third-set-of-upgraded-solar-arrays-ready-for-ride-to-international-space-station/", "date": "June 2, 2023", "description": "Two more roll-out solar arrays will ride a SpaceX cargo ship to the International Space Station this weekend, continuing a years-long mid-life station upgrade as NASA plans procurement of a final set of new solar wings to fully reinforce the lab’s power supply. "}
{"title": "Technical snags force another delay for Boeing’s Starliner crew capsule", "link": "https://spaceflightnow.com/2023/06/01/technical-snags-force-another-delay-for-boeings-starliner-crew-capsule/", "date": "June 1, 2023", "description": "Boeing and NASA officials said Thursday the first launch of astronauts on Boeing’s delay-prone Starliner crew capsule won’t happen in July after engineers recently discovered a problem with the spacecraft’s parachute system and identified flammable tape around wiring harnesses inside the vehicle. "}
{"title": "North Korean launch attempt fails, days after South Korea’s successful space shot", "link": "https://spaceflightnow.com/2023/06/01/north-korean-satellite-launch-attempt-fails-days-after-south-koreas-successful-space-shot/", "date": "June 1, 2023", "description": "An attempt to place a small North Korean military spy satellite into orbit May 30 failed a few minutes after liftoff, five days after South Korea successfully launched the country’s homegrown Nuri rocket with several technology demonstration and scientific research spacecraft. "}
{"title": "SpaceX delivers 52 more Starlink satellites into orbit", "link": "https://spaceflightnow.com/2023/05/31/spacex-delivers-52-more-starlink-satellites-into-orbit/", "date": "May 31, 2023", "description": "Another batch of 52 Starlink satellites launched late Tuesday from Vandenberg Space Force Base in California, on the way to join SpaceX’s fleet of more than 4,000 spacecraft beaming broadband signals around the world. "}
{"title": "Private astronauts splash down to close out 9-day commercial research mission", "link": "https://spaceflightnow.com/2023/05/31/private-astronauts-splash-down-to-close-out-9-day-commercial-research-mission/", "date": "May 31, 2023", "description": "America’s most experienced space flier and her three private astronaut crewmates undocked from the International Space Station and plunged back to Earth late Tuesday, blazing through the night sky like a fiery shooting star before splashing down in the Gulf of Mexico. "}
{"title": "Live coverage: SpaceX launches more Starlink satellites from California", "link": "https://spaceflightnow.com/2023/05/30/falcon-9-starlink-2-10-mission-status-center/", "date": "May 30, 2023", "description": "A SpaceX Falcon 9 rocket lifted off from Vandenberg Space Force Base in California at 11:02 p.m. PDT Tuesday (2:02 a.m. EDT; 0602 UTC Wednesday) with another batch of 52 Starlink internet satellites. "}
{"title": "Live coverage: U.S.-Saudi commercial astronaut crew returns to Earth", "link": "https://spaceflightnow.com/2023/05/30/ax-2-return-mission-status-center/", "date": "May 30, 2023", "description": "Wrapping up a nine-day mission, four commercial astronauts on Axiom Space’s second flight to the International Space Station departed the orbiting research complex at 11:05 a.m. EDT (1505 UTC) Tuesday. The crew rode back to Earth inside a SpaceX Dragon crew capsule for splashdown in the Gulf of Mexico at 11:04 p.m. EDT (0304 UTC). "}
{"title": "Chinese astronaut launch breaks record for most people in orbit", "link": "https://spaceflightnow.com/2023/05/30/chinese-astronaut-launch-breaks-record-for-most-people-in-orbit/", "date": "May 30, 2023", "description": "The launch of the next crew to China’s Tiangong space station late Monday (U.S. time) added three astronauts to the population of humans in space, which reached a record number of 17 people in orbit — six Chinese citizens, five Americans, three Russians, two Saudis, and one Emirati astronaut. "}
{"title": "Live coverage: China launches three-man crew to Tiangong space station", "link": "https://spaceflightnow.com/2023/05/29/shenzhou-16-launch-mission-status-center/", "date": "May 29, 2023", "description": "Three Chinese astronaut rocketed into orbit in pursuit of the Tiangong space station at 9:31 p.m. EDT Monday (0131 UTC Tuesday). The crew blasted off from the Jiuquan launch base in northwestern China on a Long March 2F rocket. "}
{"title": "Three astronauts ready for ride to China’s space station", "link": "https://spaceflightnow.com/2023/05/29/three-astronauts-ready-for-ride-to-chinas-space-station/", "date": "May 29, 2023", "description": "The next three-man crew to live on China’s Tiangong space station will launch Monday night on a Long March rocket, heading for a half-year expedition on the orbiting outpost to replace an outgoing team of astronauts set to return to Earth this weekend. "}
{"title": "India launches first in new generation of navigation satellites", "link": "https://spaceflightnow.com/2023/05/29/gslv-f12-nvs-01-coverage/", "date": "May 29, 2023", "description": "An Indian Geosynchronous Satellite Launch Vehicle lifted off Monday with the first in a new generation of upgraded regional navigation satellites designed to be interoperable with other countries’ global navigation networks. "}
{"title": "Swiss company selects Arianespace to launch first space debris removal mission", "link": "https://spaceflightnow.com/2023/05/27/swiss-company-selects-arianespace-to-launch-first-space-debris-removal-mission/", "date": "May 27, 2023", "description": "Swiss-based in-orbit servicing startup ClearSpace has contracted Arianespace to launch its first debris removal mission to capture and deorbit a piece of space debris. "}
{"title": "South Korean orbiter returning spectacular views of lunar landscapes", "link": "https://spaceflightnow.com/2023/05/27/korean-orbiter-returning-spectacular-views-of-lunar-landscapes/", "date": "May 27, 2023", "description": "Nearly halfway through its primary mission, South Korea’s first spacecraft to explore the moon has been collecting data and snapping pictures of lunar landscapes and craters since maneuvering into orbit late last year. "}
{"title": "SpaceX rocket sends Arabsat communications satellite into orbit", "link": "https://spaceflightnow.com/2023/05/27/falcon-9-badr-8-launch-coverage-2/", "date": "May 27, 2023", "description": "SpaceX kicked off Memorial Day weekend with an overnight launch Saturday from Cape Canaveral, boosting a nearly five-ton communications satellite into orbit for Arabsat, a multinational consortium providing TV and video broadcast services across the Middle East. "}
{"title": "NASA’s final two TROPICS CubeSats launched by Rocket Lab", "link": "https://spaceflightnow.com/2023/05/26/nasas-final-two-tropics-cubesats-launched-by-rocket-lab/", "date": "May 26, 2023", "description": "The last two spacecraft in a four-satellite constellation of tropical cyclone research platforms took off late Thursday from New Zealand on a Rocket Lab Electron launcher, helping ensure NASA’s TROPICS mission is ready for observations in time for the peak of this year’s Atlantic hurricane season. "}
{"title": "ULA delays Vulcan test-firing to troubleshoot engine ignition system", "link": "https://spaceflightnow.com/2023/05/26/ula-delays-vulcan-test-firing-to-troubleshoot-engine-ignition-system/", "date": "May 26, 2023", "description": "United Launch Alliance called off a test-firing of the company’s first flight-rated Vulcan Centaur rocket at Cape Canaveral Thursday to troubleshoot a problem with the booster’s engine ignition system. "}
{"title": "Virgin Galactic resumes suborbital spaceflights", "link": "https://spaceflightnow.com/2023/05/25/virgin-galactic-resumes-suborbital-spaceflights/", "date": "May 25, 2023", "description": "Virgin Galactic launched its suborbital spaceplane “Unity” on its first crewed flight in two years Thursday, carrying two pilots and four company astronauts to the edge of space in a final test flight before paying customers begin suborbital jaunts in June. "}
{"title": "Whitson says commercial station visit critical to private-sector space ops", "link": "https://spaceflightnow.com/2023/05/25/whitson-says-commercial-station-visit-critical-to-private-sector-space-ops/", "date": "May 25, 2023", "description": "America’s most experienced astronaut says her fully commercial visit to the International Space Station this week is a critical stepping stone on the road to space tourism, private-sector orbital research and development of commercially operated space stations. "}
{"title": "Live coverage: Rocket Lab launches NASA’s final two TROPICS satellites", "link": "https://spaceflightnow.com/2023/05/25/electron-tropics-5-6-mission-status-center/", "date": "May 25, 2023", "description": "NASA’s final pair of TROPICS hurricane research satellites lifted off on a Rocket Lab Electron launch vehicle from New Zealand on Thursday night (U.S. time). The two identical shoebox-size spacecraft launched at 11:46 p.m. EDT Thursday (0346 UTC Friday) from Rocket Lab’s privately-owned spaceport on Mahia Peninsula in New Zealand."}
{"title": "Russian supply ship launches to International Space Station", "link": "https://spaceflightnow.com/2023/05/24/soyuz-progress-ms-23-launch/", "date": "May 24, 2023", "description": "Russia’s Progress MS-23 cargo freighter launched Wednesday from Kazakhstan on a mission hauling more than 2.7 tons of fuel, food, experiments, and supplies to the International Space Station. "}
{"title": "SpaceX delays launch of Arabsat telecom satellite until Friday night", "link": "https://spaceflightnow.com/2023/05/24/falcon-9-badr-8-launch-coverage/", "date": "May 24, 2023", "description": "SpaceX scrubbed a launch attempt early Wednesday at Cape Canaveral due to thick cloud cover, then delayed the liftoff of a Falcon 9 rocket with an Airbus-built communications satellite for Arabsat until Friday night to wait for improved weather and to make room for the test-firing of United Launch Alliance’s Vulcan rocket at a neighboring launch pad. "}
{"title": "Axiom’s second private astronaut mission docks at International Space Station", "link": "https://spaceflightnow.com/2023/05/22/dragon-ax-2-iss-docking/", "date": "May 22, 2023", "description": "Four commercial space fliers who launched from NASA’s Kennedy Space Center on Axiom’s second private astronaut mission Sunday arrived at the International Space Station on a SpaceX crew capsule Monday to start an eight-day stay full of scientific experiments, student outreach events, and sightseeing. "}
{"title": "Two Americans, two Saudis launch on commercial astronaut mission", "link": "https://spaceflightnow.com/2023/05/21/falcon-9-ax-2-launch-coverage/", "date": "May 21, 2023", "description": "Former NASA astronaut Peggy Whitson, with more time in space than any other American, rocketed back into orbit for the fourth time Sunday, riding a SpaceX Falcon 9 launcher from Florida with a fare-paying investor and private pilot, and the first two Saudi Arabian astronauts to fly to the International Space Station. "}
{"title": "Axiom’s second crew mission has narrow window for launch", "link": "https://spaceflightnow.com/2023/05/20/axioms-second-crew-mission-has-narrow-window-for-launch/", "date": "May 20, 2023", "description": "The second fully commercial astronaut flight to the International Space Station will have just two opportunities to launch Sunday and Monday, or else wait until after an upcoming SpaceX resupply mission next month to deliver a new set of high-priority solar arrays to the complex. "}
{"title": "NASA awards Blue Origin $3.4 billion Artemis moon lander contract", "link": "https://spaceflightnow.com/2023/05/19/nasa-awards-blue-origin-3-4-billion-artemis-moon-lander-contract/", "date": "May 19, 2023", "description": "Blue Origin, the rocket company owned by Amazon-founder Jeff Bezos, has won a $3.4 billion NASA contract to build an Artemis lunar lander that will provide a downstream alternative to the Starship variant already being developed by SpaceX, the agency announced Friday. "}
{"title": "Jammed radar boom on Jupiter-bound JUICE probe finally freed", "link": "https://spaceflightnow.com/2023/05/19/jammed-radar-boom-on-jupiter-bound-juice-probe-finally-freed/", "date": "May 19, 2023", "description": "After three weeks of intense analysis and troubleshooting, European Space Agency flight controllers have finally succeeded in freeing a jammed boom critical to the Jupiter-bound JUICE probe’s ice-penetrating radar instrument. "}
{"title": "Live coverage: SpaceX launches satellites for OneWeb and Iridium", "link": "https://spaceflightnow.com/2023/05/19/falcon-9-oneweb-iridium-mission-status-center/", "date": "May 19, 2023", "description": "After scrubbing a launch attempt Friday, SpaceX launched a Falcon 9 rocket Saturday on a mission to send communications satellites from OneWeb and Iridium into polar orbit from Vandenberg Space Force Base, California. Liftoff occurred at 6:16 a.m. PDT (9:16 a.m. EDT; 1316 UTC). "}
{"title": "SpaceX launches 22 new-generation Starlink satellites", "link": "https://spaceflightnow.com/2023/05/19/falcon-9-starlink-6-3-coverage/", "date": "May 19, 2023", "description": "Another Falcon 9 rocket lifted off early Friday from Cape Canaveral with a batch of 22 upgraded, new-generation Starlink internet satellites. "}
{"title": "NASA’s Lunar Flashlight CubeSat mission ends before entering orbit around moon", "link": "https://spaceflightnow.com/2023/05/16/nasas-lunar-flashlight-cubesat-mission-ends-before-entering-orbit-around-moon/", "date": "May 16, 2023", "description": "NASA’s small Lunar Flashlight spacecraft, sent to the moon last year to search for water ice deposits at the lunar south pole, will not be able to complete its science mission after a problem with the probe’s propulsion system. "}
{"title": "First Vulcan rocket rolls back to hangar for ‘adjustments’ prior to test-firing", "link": "https://spaceflightnow.com/2023/05/16/first-vulcan-rocket-rolls-back-to-hangar-for-adjustments-prior-to-test-firing/", "date": "May 16, 2023", "description": "United Launch Alliance’s first Vulcan rocket was filled with methane and liquid oxygen propellants at Cape Canaveral last week for a tanking test, but managers decided to move the rocket back inside a hangar for a few adjustments before proceeding with an engine test-firing. "}
{"title": "Overnight launch adds 56 more satellites to SpaceX’s Starlink fleet", "link": "https://spaceflightnow.com/2023/05/14/falcon-9-starlink-5-9-coverage/", "date": "May 14, 2023", "description": "Fifty-six more Starlink internet satellites lifted off early Sunday atop a Falcon 9 rocket from Cape Canaveral on SpaceX’s 32nd launch of the year. "}
{"title": "SpaceX’s Falcon rocket family reaches 200 straight successful missions", "link": "https://spaceflightnow.com/2023/05/10/spacexs-falcon-rocket-family-reaches-200-straight-successful-missions/", "date": "May 10, 2023", "description": "SpaceX’s launch of 51 more Starlink internet satellites Wednesday from California marked the 200th consecutive successful mission for the company’s Falcon rocket family, a record unmatched by any other space launch vehicle. "}
{"title": "Live coverage: SpaceX launches more Starlink satellites from California", "link": "https://spaceflightnow.com/2023/05/10/falcon-9-starlink-2-9-mission-status-center/", "date": "May 10, 2023", "description": "SpaceX launched a Falcon 9 rocket at 1:09 p.m. PDT (4:09 p.m. EDT) Wednesday from Vandenberg Space Force Base, California, on a mission hauling 51 more Starlink internet satellites into orbit. "}
{"title": "Chinese cargo ship launches to resupply space station", "link": "https://spaceflightnow.com/2023/05/10/long-march-7-tianzhou-6-launch/", "date": "May 10, 2023", "description": "China’s space station received delivery of fresh supplies, experiments, and fuel after the launch of the Tianzhou 6 cargo ship Wednesday aboard a Long March 7 rocket. "}
{"title": "Electron rocket launches pair of cyclone-tracking CubeSats for NASA", "link": "https://spaceflightnow.com/2023/05/08/electron-rocket-launches-pair-of-cyclone-tracking-cubesats-for-nasa/", "date": "May 8, 2023", "description": "The first pair of four NASA CubeSats designed to provide frequent updates of typhoon and hurricane development for new insights into how tropical storms evolve and intensify were launched by Rocket Lab from its New Zealand spaceport on Sunday. "}
{"title": "Start of construction paves way for first UK mainland vertical launch", "link": "https://spaceflightnow.com/2023/05/08/start-of-construction-paves-way-for-first-uk-mainland-vertical-launch/", "date": "May 8, 2023", "description": "Rocket and launch services company Orbex has begun construction at Sutherland Spaceport in Scotland with a ground-breaking ceremony on May 5 that marked the start of the first vertical launch spaceport to be built on mainland UK. "}
{"title": "Twin TROPICS satellites set to be lofted into orbit", "link": "https://spaceflightnow.com/2023/05/05/twin-tropics-satellites-set-to-be-lofted-into-orbit/", "date": "May 5, 2023", "description": "Rocket Lab’s launch of NASA’s second pair of TROPICS hurricane research satellites, reassigned from Astra following a launch failure last year, has been rescheduled for Sunday after a delay due to unfavorable weather at the the company’s New Zealand spaceport. "}
{"title": "SpaceX rockets past 4,000 Starlink satellites in orbit with another launch", "link": "https://spaceflightnow.com/2023/05/04/falcon-9-starlink-5-6-coverage/", "date": "May 4, 2023", "description": "SpaceX surpassed more than 4,000 Starlink internet satellites in orbit with the launch of a Falcon 9 rocket and another batch of 56 spacecraft Thursday from Cape Canaveral, the company’s fourth mission in less than a week. "}
{"title": "Russian cosmonauts complete spacewalk to relocate experiment airlock", "link": "https://spaceflightnow.com/2023/05/03/russian-cosmonauts-complete-spacewalk-to-relocate-experiment-airlock/", "date": "May 3, 2023", "description": "Cosmonauts Sergey Prokopyev and Dmitri Petelin floated outside the International Space Station Wednesday, unbolted an experiment airlock from the Rassvet docking compartment and then connected it to Russia’s Nauka multi-purpose laboratory module in a 7-hour, 11-minute excursion. "}
{"title": "SpaceX’s Falcon Heavy hits bullseye with ascent to near-geosynchronous orbit", "link": "https://spaceflightnow.com/2023/05/01/spacexs-falcon-heavy-hits-bullseye-with-ascent-to-near-geosynchronous-orbit/", "date": "May 1, 2023", "description": "A SpaceX Falcon Heavy rocket thundered into the sky over Florida’s Space Coast Sunday night and deployed a sophisticated internet satellite for Viasat into a circular orbit more than 20,000 miles over the equator, delivering for a competitor to SpaceX’s own Starlink broadband network. "}
{"title": "Live coverage: SpaceX launches Falcon Heavy rocket from Kennedy Space Center", "link": "https://spaceflightnow.com/2023/04/30/falcon-heavy-viasat-3-americas-mission-status-center-2/", "date": "April 30, 2023", "description": "On the mission’s third launch attempt, SpaceX sent a Falcon Heavy rocket aloft at 8:26 p.m. EDT Sunday (0026 UTC Monday) from NASA’s Kennedy Space Center in Florida. The nearly five-hour mission to a near-geosynchronous orbit carried the first satellite for the ViaSat 3 space-based internet network, along with two smaller rideshare payloads. "}
{"title": "Viasat seeks replacement for Ariane 6 for launch of third ViaSat 3 satellite", "link": "https://spaceflightnow.com/2023/04/30/viasat-seeks-replacement-for-ariane-6-for-launch-of-third-viasat-3-satellite/", "date": "April 30, 2023", "description": "On the eve of launching its first ViaSat 3 internet satellite on a SpaceX rocket, Viasat says it has moved the launch of an identical spacecraft off of Europe’s long-delayed Ariane 6 rocket, and is considering bids from other rocket companies. "}
{"title": "SpaceX launches Falcon 9 rocket with two O3b internet satellites", "link": "https://spaceflightnow.com/2023/04/28/falcon-9-falcon-heavy-o3b-mpower-viasat-americas/", "date": "April 28, 2023", "description": "A SpaceX Falcon 9 rocket lifted off with a pair of O3b internet satellites for SES Friday evening from Cape Canaveral Space Force Station, but a last-minute abort for a Falcon Heavy mission later in the night prevented the company from pulling off a launch doubleheader. "}
{"title": "SpaceX clears Falcon Heavy for liftoff after launch pad lightning strike", "link": "https://spaceflightnow.com/2023/04/28/spacex-clears-falcon-heavy-for-liftoff-after-launch-pad-lightning-strike/", "date": "April 28, 2023", "description": "SpaceX says engineers completed checks of the Falcon Heavy rocket, its satellite payloads, and ground systems at the Kennedy Space Center after a lightning strike on the launch pad’s tower Thursday night, part of a wave of severe weather that forced officials to delay the launch attempt. "}
{"title": "First Arab spacewalker heads outside International Space Station", "link": "https://spaceflightnow.com/2023/04/28/us-eva-86-coverage/", "date": "April 28, 2023", "description": "Veteran NASA astronaut Steve Bowen and Emirati astronaut Sultan Alneyadi suited up and floated outside the International Space Station Friday for a spacewalk to prepare the outpost for new solar arrays. Alneyadi became the first Arab astronaut to perform a spacewalk. "}
{"title": "NASA’s Ingenuity Mars helicopter has now flown more than 50 times", "link": "https://spaceflightnow.com/2023/04/27/nasas-ingenuity-mars-helicopter-has-now-flown-more-than-50-times/", "date": "April 27, 2023", "description": "NASA’s pioneering Mars helicopter Ingenuity continues to outperform its design specifications, having now notched up more than 50 record-breaking forays across the Red Planet’s surface, 10 times as many flights as originally planned for. "}
{"title": "SpaceX launches 46 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/04/27/spacex-launches-46-starlink-satellites-from-california/", "date": "April 27, 2023", "description": "SpaceX launched its 40th mission from Vandenberg Space Force Base in California on April 27, boosting 46 more satellites into orbit for the Starlink internet network. "}
{"title": "Live coverage: SpaceX launches Starlink 3-5 mission from California", "link": "https://spaceflightnow.com/2023/04/26/falcon-9-starlink-3-5-mission-status-center/", "date": "April 26, 2023", "description": "SpaceX launched the Starlink 3-5 mission from California Thursday morning, following a last-minute abort Wednesday due to concerns about landing of the Falcon 9 rocket’s first stage booster on a drone ship in the Pacific Ocean. The Falcon 9 rocket lifted off from Vandenberg Space Force Base at 6:40 a.m. PDT (9:40 a.m. EDT; 1340 UTC) with 46 Starlink internet satellites. "}
{"title": "Japanese company says commercial spacecraft crashed on moon landing attempt", "link": "https://spaceflightnow.com/2023/04/25/japanese-company-says-commercial-spacecraft-likely-crashed-on-moon-landing-attempt/", "date": "April 25, 2023", "description": "A small spacecraft attempting to become the first privately-funded probe to accomplish a controlled landing on the moon likely fell to the lunar surface after running out of fuel Tuesday, according to the Japanese company ispace, which managed the mission. "}
{"title": "Falcon Heavy rocket rolls back to launch pad after engine swap", "link": "https://spaceflightnow.com/2023/04/25/falcon-heavy-rocket-rolls-back-to-launch-pad-after-engine-swap/", "date": "April 25, 2023", "description": "SpaceX rolled a Falcon Heavy rocket back to its launch pad in Florida Tuesday night for liftoff Thursday with a high-power Viasat broadband satellite, following an eight-day delay for a launch vehicle engine swap. "}
{"title": "Live coverage: Contact lost with Japanese moon lander", "link": "https://spaceflightnow.com/2023/04/25/ispace-mission-1-landing-mission-status-center/", "date": "April 25, 2023", "description": "A commercial robotic lander developed by the Japanese company ispace was supposed to land on the moon at 12:40 p.m. EDT (1640 UTC) Tuesday, attempting to make history as the first privately-funded enterprise to achieve a controlled touchdown on the lunar surface. But mission controllers lost contact with the spacecraft just before landing. "}
{"title": "Emirati orbiter captures up-close view of Martian moon Deimos", "link": "https://spaceflightnow.com/2023/04/25/emirati-orbiter-captures-up-close-view-of-martian-moon-deimos/", "date": "April 25, 2023", "description": "The United Arab Emirates’ Hope probe has seen the far side of the Martian moon Deimos up close for the first time, collecting compositional data suggesting it may have formed from material that broke off of Mars long ago, and not from a captured asteroid.  "}
{"title": "Japanese company aims to become first company to land on the moon Tuesday", "link": "https://spaceflightnow.com/2023/04/24/japanese-company-aims-to-become-first-company-to-land-on-the-moon-tuesday/", "date": "April 24, 2023", "description": "The Japanese company ispace could become the first commercial firm to achieve a controlled landing on the moon Tuesday, when its privately-funded unpiloted Hakuto-R lander attempts to touch down inside a crater to deliver a small Emirati rover and other research payloads to the lunar surface. "}
{"title": "India’s PSLV launches with two Singaporean satellites", "link": "https://spaceflightnow.com/2023/04/22/indias-pslv-launches-with-two-singaporean-satellites/", "date": "April 22, 2023", "description": "An Indian Polar Satellite Launch Vehicle lifted off Saturday and flew to an altitude of more than 360 miles to deploy two Singaporean satellites, one for all-weather radar imaging surveillance and another for technology demonstrations. "}
{"title": "SpaceX launches largest rocket ever built, but test flight ends in explosion", "link": "https://spaceflightnow.com/2023/04/20/spacex-launches-largest-rocket-ever-built-but-test-flight-ends-in-explosion/", "date": "April 20, 2023", "description": "After years of anticipation, SpaceX launched the first test flight of its full-scale Starship rocket Thursday from South Texas, but the mission ended four minutes later as the vehicle veered out of control and self-destructed over the Gulf of Mexico following multiple engine failures. "}
{"title": "Live coverage: SpaceX’s Starship rocket explodes on test flight from Texas", "link": "https://spaceflightnow.com/2023/04/20/starship-test-flight-1-mission-status-center-2/", "date": "April 20, 2023", "description": "SpaceX launched the first full-scale Starship and Super Heavy rocket from South Texas at 8:33 a.m. CDT (9:33 a.m. EDT; 1333 UTC Thursday). The nearly 40-story-tall rocket, the largest ever built, lifted off from the Starbase launch complex and flew downrange before veering out of control and exploding about four minutes into the flight. "}
{"title": "Video from Starbase: SpaceX prepares for second Starship launch attempt", "link": "https://spaceflightnow.com/2023/04/19/video-from-starbase-spacex-prepares-for-second-starship-launch-attempt/", "date": "April 19, 2023", "description": "Spaceflight Now’s Stephen Clark reports from Starbase in South Texas as SpaceX prepares the largest rocket in history for a second launch attempt after calling off a launch attempt Monday due to a valve problem. "}
{"title": "Elon Musk’s success criteria for Starship test flight: “Don’t blow up the launch pad”", "link": "https://spaceflightnow.com/2023/04/19/elon-musks-success-criteria-for-starship-test-flight-dont-blow-up-the-launch-pad/", "date": "April 19, 2023", "description": "Elon Musk, SpaceX’s founder and CEO, did his best to set low expectations heading into the first test flight of the gargantuan Super Heavy booster and Starship rocket this week. “Just don’t blow up the launch pad,” Musk said. "}
{"title": "SpaceX resumes launching upgraded Starlink satellites", "link": "https://spaceflightnow.com/2023/04/19/falcon-9-starlink-6-2-coverage/", "date": "April 19, 2023", "description": "SpaceX resumed launches of upgraded second-generation Starlink internet satellites Wednesday from Cape Canaveral, nearly two months after some spacecraft in the first batch of larger, more capable “Starlink V2 Mini” satellites ran into problems soon after liftoff. "}
{"title": "SpaceX’s Starship test flight delayed until Thursday after valve problem", "link": "https://spaceflightnow.com/2023/04/17/spacexs-starship-test-flight-delayed-until-thursday-after-valve-problem/", "date": "April 17, 2023", "description": "SpaceX scrubbed the first test launch of its huge new rocket Monday due to a frozen valve in the pressurization system on the 33-engine Super Heavy booster, delaying the widely-anticipated flight from South Texas until at least Thursday. "}
{"title": "How SpaceX’s Starship stacks up to other rockets", "link": "https://spaceflightnow.com/2023/04/17/how-spacexs-starship-stacks-up-to-other-rockets/", "date": "April 17, 2023", "description": "SpaceX Starship is set to propel itself into the record books today on its maiden flight, becoming the tallest, heaviest and most powerful rocket ever launched by humankind into space, topping a role call of famous and history-making heavy-lift launch vehicles including the mighty Saturn 5 that first took humans to the moon. "}
{"title": "Live coverage: SpaceX scrubs launch attempt for Starship test flight", "link": "https://spaceflightnow.com/2023/04/17/starship-test-flight-1-mission-status-center/", "date": "April 17, 2023", "description": "SpaceX called off a launch attempt in Texas Monday for the Super Heavy booster and Starship launch vehicle, blaming a bad valve on the first stage. The next launch attempt for the world’s largest rocket is scheduled for Thursday, depending on weather and a fix for the valve problem. "}
{"title": "Video: Sights and sounds from Starbase on eve of Starship launch attempt", "link": "https://spaceflightnow.com/2023/04/16/video-sights-and-sounds-from-starbase-on-eve-of-starship-launch-attempt/", "date": "April 16, 2023", "description": "We captured the sights and sounds of SpaceX’s Starbase launch complex in Texas on the eve of the first launch attempt for the fully-stacked Super Heavy booster and Starship rocket on a test flight aiming for near orbital velocity. "}
{"title": "Video: Starship stacked atop Super Heavy booster ahead of first launch attempt", "link": "https://spaceflightnow.com/2023/04/15/video-starship-stacked-atop-super-heavy-booster-ahead-of-first-launch-attempt/", "date": "April 15, 2023", "description": "This time-lapse video shows the “chopstick” mechanism lifting the Starship atop the Super Heavy booster Saturday ahead of the inaugural test flight of the fully-stacked rocket from SpaceX’s Starbase facility in South Texas. "}
{"title": "SpaceX launches Transporter 7 rideshare mission from California", "link": "https://spaceflightnow.com/2023/04/15/spacex-launches-transporter-7-rideshare-mission-from-california/", "date": "April 15, 2023", "description": "After several delays to wait for improved weather, SpaceX sent a Falcon 9 rocket into space Saturday from California’s Central Coast with 51 small satellites, payloads, and orbital transfer vehicles from customers around the world. "}
{"title": "FAA clears SpaceX to launch world’s largest rocket", "link": "https://spaceflightnow.com/2023/04/15/faa-clears-spacex-to-launch-worlds-largest-rocket/", "date": "April 15, 2023", "description": "The Federal Aviation Administration approved a commercial license Friday for the first full-scale test flight of SpaceX’s nearly 400-foot-tall Super Heavy and Starship mega-rocket from South Texas, a launch SpaceX said could happen as soon as Monday morning. "}
{"title": "Europe launches spacecraft on eight-year journey to explore Jupiter’s moons", "link": "https://spaceflightnow.com/2023/04/14/europe-launches-spacecraft-on-eight-year-journey-to-explore-jupiters-moons/", "date": "April 14, 2023", "description": "An Ariane 5 rocket took off from French Guiana Friday with the heaviest interplanetary science probe ever launched, kicking off a $1.7 billion European Space Agency mission on a decade-long quest to Jupiter’s icy moons in search of environments that could be habitable for life. "}
{"title": "Live coverage: SpaceX launches rideshare mission with 51 small payloads", "link": "https://spaceflightnow.com/2023/04/13/falcon-9-transporter-7-mission-status-center/", "date": "April 13, 2023", "description": "SpaceX launched a Falcon 9 rocket from Vandenberg Space Force Base, California, with 51 small satellites, hosted payloads, and orbital transfer vehicles heading into polar orbit on the Transporter 7 mission. Liftoff occurred at 11:48 p.m. PDT Friday (2:48 a.m. EDT; 0648 UTC Saturday). "}
{"title": "Falcon Heavy test-fired at Kennedy Space Center", "link": "https://spaceflightnow.com/2023/04/13/falcon-heavy-test-fired-at-kennedy-space-center/", "date": "April 13, 2023", "description": "SpaceX test-fired 27 main engines on a Falcon Heavy rocket Thursday in Florida, clearing a hurdle before installing three commercial communications satellites on the launcher for a mission to geostationary orbit later this month. "}
{"title": "Lightning threat delays launch of Europe’s first mission to Jupiter", "link": "https://spaceflightnow.com/2023/04/13/lightning-threat-delays-launch-of-europes-first-mission-to-jupiter/", "date": "April 13, 2023", "description": "The liftoff of Europe’s first mission to Jupiter aboard an Ariane 5 rocket was scrubbed Thursday in French Guiana due to a high risk of lightning at the launch site, delaying until Friday the start of the JUICE spacecraft’s voyage of exploration. "}
{"title": "Live coverage: Ariane 5 rocket launches Europe’s first mission to Jupiter", "link": "https://spaceflightnow.com/2023/04/13/ariane-5-va260-mission-status-center/", "date": "April 13, 2023", "description": "After the threat of lightning kept the mission on the ground Thursday, Arianespace and the European Space Agency successfully launched an Ariane 5 rocket Friday from Kourou, French Guiana, with the Jupiter Icy Moons Explorer mission, a robotic spacecraft embarking on an eight-year journey to the solar system’s largest planet. Liftoff with ESA’s JUICE spacecraft occurred at 8:14 a.m. EDT (1214 UTC). "}
{"title": "Schedule for SpaceX’s Starship test flight hinges on FAA regulatory approval", "link": "https://spaceflightnow.com/2023/04/13/schedule-for-spacexs-starship-test-flight-hinges-on-faa-regulatory-approval/", "date": "April 13, 2023", "description": "SpaceX continues to prepare for a launch attempt as soon as next week for the first test flight of its Super Heavy booster and Starship rocket, with final work on the ship’s self-destruct system, data reviews, and the receipt of an FAA license still to come before teams proceed into a countdown in South Texas. "}
{"title": "JUICE’s launch campaign in imagery", "link": "https://spaceflightnow.com/2023/04/12/juices-launch-campaign-in-imagery/", "date": "April 12, 2023", "description": "These photos and a time lapse video from the European Space Agency chronicle the final preparations for launch of the Jupiter Icy Moons Explorer, or JUICE, spacecraft from the Guiana Space Center on the second-to-last Ariane 5 rocket. "}
{"title": "Europe’s first mission to Jupiter poised for launch from South America", "link": "https://spaceflightnow.com/2023/04/12/europes-first-mission-to-jupiter-poised-for-launch-from-south-america/", "date": "April 12, 2023", "description": "The European Space Agency’s $1.7 billion robotic Jupiter Icy Moons Explorer mission is ready for liftoff Thursday from French Guiana, beginning an eight-year cruise to the solar system’s largest planet before becoming the first-ever spacecraft to orbit one of Jupiter’s moons in the 2030s. "}
{"title": "Preparations underway for SpaceX’s next Falcon Heavy launch", "link": "https://spaceflightnow.com/2023/04/12/preparations-underway-for-spacexs-next-falcon-heavy-launch/", "date": "April 12, 2023", "description": "SpaceX’s next Falcon Heavy mission, set for April 18 from NASA’s Kennedy Space Center in Florida, will launch a powerhouse bus-sized broadband satellite for Viasat into a high-altitude circular geostationary orbit, a demanding flight profile that will require disposal of all three of the rocket’s reusable boosters. "}
{"title": "Japanese space science missions facing delays after H3 rocket failure", "link": "https://spaceflightnow.com/2023/04/11/japanese-space-science-missions-facing-delays-after-h3-rocket-failure/", "date": "April 11, 2023", "description": "The launch of a Japanese X-ray telescope and robotic lunar lander has been delayed to no earlier than August, and the launch schedule for another Japanese mission to return samples from a moon of Mars is in doubt as engineers investigate the failure of Japan’s first H3 rocket last month. "}
{"title": "SpaceX readying Starship rocket for around-the-world test flight next week", "link": "https://spaceflightnow.com/2023/04/11/spacex-readying-starship-rocket-for-around-the-world-test-flight-as-soon-as-next-week/", "date": "April 11, 2023", "description": "SpaceX said Tuesday it won’t perform a final countdown dress rehearsal this week for the giant new Starship launch vehicle, and could send the rocket — standing nearly 40 stories tall on its Texas launch pad — on an around-the-world test flight as soon as next week. "}
{"title": "SpaceX launches Intelsat satellite with NASA air quality sensor", "link": "https://spaceflightnow.com/2023/04/06/falcon-9-intelsat-40e-tempo-coverage/", "date": "April 6, 2023", "description": "A SpaceX Falcon 9 rocket lifted off from Cape Canaveral shortly after midnight Friday with Intelsat 40e, a communications satellite destined to beam broadband internet signals to airplane and cruise ship passengers across North America while hosting a NASA instrument package to monitor air pollution. "}
{"title": "NASA air quality sensor ready for launch with Intelsat satellite", "link": "https://spaceflightnow.com/2023/04/05/nasa-air-quality-sensor-ready-for-launch-with-intelsat-satellite/", "date": "April 5, 2023", "description": "A $210 million NASA mission to improve air pollution monitoring over North America is set to launch Thursday with an Intelsat communications satellite blasting off on a SpaceX Falcon 9 rocket from Cape Canaveral. "}
{"title": "Artemis 2 commander chats with Spaceflight Now", "link": "https://spaceflightnow.com/2023/04/03/video-artemis-2-commander-chats-with-spaceflight-now/", "date": "April 3, 2023", "description": "Reid Wiseman, a veteran U.S. Navy test pilot and former chief of NASA’s astronaut corps, will lead the four-person crew assigned to the Artemis 2 mission to carry people to the vicinity of the moon for the first time in more than 50 years. Wiseman says he views the crew’s job as making sure NASA’s Orion spacecraft is ready for more demanding missions later this decade to support moon landings and assembly of a space station called the Gateway in lunar orbit. "}
{"title": "NASA names crew for first human mission to the moon in more than 50 years", "link": "https://spaceflightnow.com/2023/04/03/nasa-names-crew-for-first-human-mission-to-the-moon-in-more-than-50-years/", "date": "April 3, 2023", "description": "NASA announced Monday that former U.S. Navy fighter pilots Reid Wiseman and Victor Glover, veteran space station astronaut Christina Koch, and rookie Canadian astronaut Jeremy Hansen will crew the Artemis 2 mission to fly around the far side of the moon as soon as late next year, a test flight that could carry the foursome farther from Earth than any humans in history. "}
{"title": "U.S. military begins launching satellites to counter hypersonic missile threat", "link": "https://spaceflightnow.com/2023/04/02/u-s-military-begins-launching-satellites-to-counter-hypersonic-missile-threat/", "date": "April 2, 2023", "description": "The first 10 spacecraft for a planned U.S. military mega-constellation launched from California Sunday aboard a SpaceX Falcon 9 rocket, setting in place the keystone for a multibillion-dollar network of hundreds of small satellites to improve defenses against hypersonic missiles and other emerging threats. "}
{"title": "NASA set to announce crew of Artemis 2 moon mission", "link": "https://spaceflightnow.com/2023/04/02/nasa-set-to-announce-crew-of-artemis-2-moon-mission/", "date": "April 2, 2023", "description": "NASA will unveil the four crew members Monday who will fly around the moon on the first piloted flight of the agency’s Orion deep space capsule on the Artemis 2 mission as soon as late next year. "}
{"title": "Israel launches radar spy satellite into retrograde orbit", "link": "https://spaceflightnow.com/2023/03/30/israel-launches-radar-spy-satellite-into-retrograde-orbit/", "date": "March 30, 2023", "description": "Israel’s military launched a radar spy satellite March 28 from an air base south of Tel Aviv, adding an all-weather observation sentinel to the country’s fleet of intelligence-gathering spacecraft. "}
{"title": "SpaceX launch for SDA aborted at T-minus 3 seconds", "link": "https://spaceflightnow.com/2023/03/30/spacex-launch-for-sda-aborted-at-t-minus-3-seconds/", "date": "March 30, 2023", "description": "SpaceX aborted a launch attempt Thursday just three seconds before liftoff at the start of the engine ignition sequence, delaying the flight of a Falcon 9 rocket from California with 10 satellites for the U.S. military’s Space Development Agency. "}
{"title": "Live coverage: SpaceX Falcon 9 rocket lifts off on first SDA mission", "link": "https://spaceflightnow.com/2023/03/30/falcon-9-sda-tranche-0a-mission-status-center/", "date": "March 30, 2023", "description": "SpaceX launched a Falcon 9 rocket at 7:29 a.m. PDT (10:29 a.m. EDT; 1429 UTC) Sunday from Vandenberg Space Force Base, California with 10 missile tracking and data relay satellites for the U.S. military’s Space Development Agency. The launch occurred three days after SpaceX aborted the first launch attempt at T-minus 3 seconds to examine data from one of the Falcon 9’s main engines. "}
{"title": "First flight of astronauts on Boeing’s Starliner spacecraft slips to July", "link": "https://spaceflightnow.com/2023/03/29/first-flight-of-astronauts-on-boeings-starliner-spacecraft-slips-to-july/", "date": "March 29, 2023", "description": "The first piloted flight of Boeing’s Starliner astronaut ferry ship is slipping from late April to at least July 21, officials said Wednesday, to allow more time to close out paperwork and to carry out an additional test of the spacecraft’s parachute deploy system. "}
{"title": "First launch for Pentagon’s own mega-constellation set for Thursday", "link": "https://spaceflightnow.com/2023/03/29/first-launch-for-pentagons-own-mega-constellation-set-for-thursday/", "date": "March 29, 2023", "description": "The U.S. military’s Space Development Agency, established in 2019 to fast-track new national security capabilities in orbit, plans to launch the first 10 satellites for a constellation of hundreds of missile tracking and data relay spacecraft Thursday on a SpaceX Falcon 9 rocket from California. "}
{"title": "SpaceX launches another bundle of Starlink internet satellites", "link": "https://spaceflightnow.com/2023/03/29/falcon-9-starlink-5-10-launch-coverage/", "date": "March 29, 2023", "description": "SpaceX delivered 56 more Starlink internet satellites into the company’s global internet constellation after liftoff of a Falcon 9 rocket from Cape Canaveral Wednesday, bringing the total number of Starlinks launched to 4,217 spacecraft. "}
{"title": "Damaged Russian Soyuz capsule returns to Earth without a crew", "link": "https://spaceflightnow.com/2023/03/28/damaged-russian-soyuz-capsule-returns-to-earth-without-a-crew/", "date": "March 28, 2023", "description": "A Russian Soyuz spacecraft originally slated to bring home two Russian cosmonauts and a NASA astronaut parachuted to a landing in Kazakhstan Tuesday, returning to Earth without a crew due to concerns about overheating following a coolant leak while docked at the International Space Station last year. "}
{"title": "Blue Origin blames September New Shepard abort on engine nozzle failure", "link": "https://spaceflightnow.com/2023/03/27/blue-origin-blames-september-new-shepard-abort-on-engine-nozzle-failure/", "date": "March 27, 2023", "description": "Structural failure of the nozzle at the base of a rocket engine powering an unpiloted New Shepard spacecraft toward the edge of space last September triggered a dramatic-but-safe in-flight abort, builder Blue Origin announced Friday, saying the company has identified fixes and plans to resume sub-orbital flights “soon.” "}
{"title": "Indian launch gives OneWeb enough satellites for global internet service", "link": "https://spaceflightnow.com/2023/03/26/indian-launch-gives-oneweb-enough-satellites-for-global-internet-service/", "date": "March 26, 2023", "description": "The successful launch of 36 more OneWeb satellites aboard India’s most powerful rocket Saturday brought the total number of OneWeb spacecraft in orbit to 618, enough for the London-based company to start global broadband service later this year. "}
{"title": "Live coverage: India’s LVM3 rocket lifts off with 36 more OneWeb satellites", "link": "https://spaceflightnow.com/2023/03/25/gslv-mk3-oneweb-18-mission-status-center/", "date": "March 25, 2023", "description": "An Indian LVM3 rocket lifted off at 11:30 p.m. EDT Saturday (0330 UTC Sunday) with 36 more OneWeb internet satellites. Once the new 36 satellites complete orbit-raising and commissioning, OneWeb will have 618 active satellites in its fleet, enough for global broadband service. "}
{"title": "Falcon 9 deploys 56 Starlink satellites on SpaceX’s 20th launch of the year", "link": "https://spaceflightnow.com/2023/03/24/falcon-9-rocket-deploys-56-more-starlink-satellites-on-spacexs-20th-launch-of-the-year/", "date": "March 24, 2023", "description": "SpaceX continued launching satellites for the Starlink internet network Friday, sending a Falcon 9 rocket aloft from Cape Canaveral with 56 more older-generation broadband spacecraft as ground teams troubleshoot problems with a batch of upgraded Starlinks launched last month. "}
{"title": "Rocket Lab recovers booster again after launch with BlackSky satellites", "link": "https://spaceflightnow.com/2023/03/24/rocket-lab-recovers-booster-again-after-launch-with-blacksky-satellites/", "date": "March 24, 2023", "description": "Two BlackSky optical Earth-imaging satellites rode an Electron launcher into orbit Friday from New Zealand, while the Electron’s first stage booster gently parachuted into the Pacific Ocean as engineers consider abandoning airborne rocket recovery in favor of ship-based retrieval and reuse. "}
{"title": "Live coverage: Rocket Lab launches BlackSky satellites from New Zealand", "link": "https://spaceflightnow.com/2023/03/24/electron-blacksky-18-19-mission-status-center/", "date": "March 24, 2023", "description": "Rocket Lab’s second launch in a little more than a week blasted off from New Zealand at 5:14 a.m. EDT (0914 UTC) Friday with two commercial Earth observation satellites for BlackSky. The Electron rocket’s first stage booster successfully splashed down in the Pacific Ocean for recovery. "}
{"title": "Live coverage: SpaceX launches 56 more Starlink internet satellites", "link": "https://spaceflightnow.com/2023/03/24/falcon-9-starlink-5-5-mission-status-center/", "date": "March 24, 2023", "description": "SpaceX launched another Falcon 9 rocket Friday, this time to deliver 56 more Starlink internet satellites into orbit. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 11:43 a.m. EDT (1543 UTC). The first stage booster landed on a drone ship in the Atlantic Ocean. "}
{"title": "SpaceX pausing launches of new-generation Starlink satellites", "link": "https://spaceflightnow.com/2023/03/23/spacex-pausing-launches-of-new-generation-starlink-satellites/", "date": "March 23, 2023", "description": "SpaceX’s next two missions will revert to launching older versions of the company’s Starlink internet satellites, instead of new second-generation Starlink platforms as originally planned, while ground teams work out unspecified problems with the first batch of upgraded Starlinks launched in February. "}
{"title": "Relativity’s 3D-printed Terran 1 rocket reaches space, but falls short of orbit", "link": "https://spaceflightnow.com/2023/03/22/relativity-space-terran-1-glhf-2/", "date": "March 22, 2023", "description": "Relativity Space, a company with ambitions to develop a fully reusable rocket, launched its first expendable methane-fueled booster from Cape Canaveral Wednesday night, successfully demonstrating the strength of the launcher’s first-of-its-kind 3D-printed structure but failing to reach orbit after a malfunction on the test flight’s second stage. "}
{"title": "Penultimate Delta rocket to launch next month on ULA’s first mission of 2023", "link": "https://spaceflightnow.com/2023/03/22/penultimate-delta-rocket-to-launch-next-month-on-ulas-first-mission-of-2023/", "date": "March 22, 2023", "description": "United Launch Alliance’s second-to-last Delta 4-Heavy rocket is scheduled to blast off from Cape Canaveral April 20 with a classified cargo for the U.S. government’s spy satellite agency, a mission that will mark ULA’s first flight of the year, officials announced this week. "}
{"title": "Good weather expected for Relativity Space’s late-night launch attempt", "link": "https://spaceflightnow.com/2023/03/21/good-weather-expected-for-relativity-spaces-late-night-launch-attempt/", "date": "March 21, 2023", "description": "Relativity Space will try a third time to launch a 3D-printed rocket from Cape Canaveral Wednesday night, and weather forecasters predict a 95% chance of favorable conditions for the late-night test flight. "}
{"title": "Webb telescope sees the prelude to a supernova", "link": "https://spaceflightnow.com/2023/03/21/webb-telescope-sees-the-prelude-to-a-supernova/", "date": "March 21, 2023", "description": "A new image from the James Webb Space Telescope shows a rare glimpse of a massive star 15,000 light-years away shedding a halo of gas and dust, seeding the cosmos with elements necessary for forming other stars, planets, and the building blocks of life. "}
{"title": "Virgin Orbit pauses operations amid financial troubles", "link": "https://spaceflightnow.com/2023/03/20/virgin-orbit-pauses-operations-amid-financial-troubles/", "date": "March 20, 2023", "description": "Virgin Orbit announced last week it is pausing operations after sustained financial losses, furloughing most of the company’s approximately 750 employees as officials seek funding to keep the small satellite launch provider afloat. "}
{"title": "SpaceX completes launch doubleheader with sunset liftoff from Cape Canaveral", "link": "https://spaceflightnow.com/2023/03/17/falcon-9-ses-18-19-coverage/", "date": "March 17, 2023", "description": "SpaceX launched two Falcon 9 rockets in a span of a little more than four hours Friday, a record-setting day that began with the launch of 52 Starlink internet satellites from California and ended with the sunset liftoff of two SES television broadcast payloads from Florida. "}
{"title": "Live coverage: SpaceX launches 52 Starlink satellites from California", "link": "https://spaceflightnow.com/2023/03/17/falcon-9-starlink-2-8-mission-status-center/", "date": "March 17, 2023", "description": "A SpaceX Falcon 9 rocket lifted off from Vandenberg Space Force Base in California at 12:26 p.m. PDT (3:26 p.m. EDT; 1926 GMT) Friday with another batch of 52 Starlink internet satellites. The mission is the first of two SpaceX launches scheduled Friday, with another Falcon 9 poised for liftoff from Florida a little more than four hours later. "}
{"title": "Rocket Lab deploys two Capella radar satellites after launch from Virginia", "link": "https://spaceflightnow.com/2023/03/16/rocket-lab-deploys-two-capella-radar-satellites-after-successful-launch-from-virginia/", "date": "March 16, 2023", "description": "Rocket Lab’s Electron launcher delivered two all-weather radar Earth observation satellites into orbit for Capella Space Thursday night after liftoff from Wallops Island, Virginia, successfully completing the company’s second flight from the U.S. spaceport.  "}
{"title": "SES to complete C-band clearing program with SpaceX dual-satellite launch", "link": "https://spaceflightnow.com/2023/03/16/ses-to-complete-c-band-clearing-program-with-spacex-dual-satellite-launch/", "date": "March 16, 2023", "description": "SES, the international communications satellite operator, plans to send two more C-band television broadcasting spacecraft into orbit from Cape Canaveral Friday night atop a SpaceX Falcon 9 rocket on a mission that will help clear spectrum for transition to 5G network services. "}
{"title": "Live coverage: Rocket Lab launches two commercial radar satellites", "link": "https://spaceflightnow.com/2023/03/16/electron-capella-9-10-mission-status-center/", "date": "March 16, 2023", "description": "Rocket Lab’s second launch from Virginia took off at 6:38 p.m. EDT (2238 GMT) Thursday. The company’s carbon fiber Electron small satellite launcher carried two commercial radar remote sensing satellites into orbit for Capella Space. "}
{"title": "SpaceX supply ship docks at International Space Station", "link": "https://spaceflightnow.com/2023/03/16/dragon-crs-27-docking/", "date": "March 16, 2023", "description": "A day-and-a-half after launching from Florida, SpaceX’s Cargo Dragon spacecraft docked at the International Space Station Thursday to deliver fresh food, experiments, CubeSats, and a suite of U.S. military tech demo payloads. "}
{"title": "Axiom shows off Artemis moonsuits", "link": "https://spaceflightnow.com/2023/03/15/axiom-shows-off-artemis-moonsuits/", "date": "March 15, 2023", "description": "Houston-based Axiom Space on Wednesday showed off the new spacesuit NASA’s Artemis astronauts will wear when they return to the moon, a more flexible, dust resistant, insulated and radiation-shielded suit to protect them in the harsh environment near the lunar south pole. "}
{"title": "SpaceX Cargo Dragon spacecraft lifts off from Florida", "link": "https://spaceflightnow.com/2023/03/14/falcon-9-crs-27-launch-coverage/", "date": "March 14, 2023", "description": "A SpaceX Cargo Dragon spacecraft packed with nearly 6,300 pounds of fresh food, hardware, and experiments for the International Space Station lifted off Tuesday night from NASA’s Kennedy Space Center in Florida, kicking off a 36-hour transit to the orbiting research complex where it will dock for a month-long mission. "}
{"title": "U.S. military experiments hitching ride to space station on SpaceX cargo ship", "link": "https://spaceflightnow.com/2023/03/13/u-s-military-experiments-hitching-ride-to-space-station-on-spacex-cargo-ship/", "date": "March 13, 2023", "description": "SpaceX’s next resupply mission to the International Space Station is set for liftoff Tuesday night from Kennedy Space Center, hauling more than 6,300 pounds of cargo to the complex, including a $35 million, half-ton payload package for the U.S. military with experiments ranging from in-space laser power beaming to weather monitoring. "}
{"title": "Proton rocket launches classified Russian government satellite", "link": "https://spaceflightnow.com/2023/03/13/proton-rocket-launches-classified-russian-government-satellite/", "date": "March 13, 2023", "description": "A Proton rocket launched Sunday from the Baikonur Cosmodrome in Kazakhstan, boosting into a high-altitude orbit a classified Russian government satellite Western analysts believe is designed to eavesdrop on other countries’ radio transmissions. "}
{"title": "Crew Dragon splashes down to close out 157-day mission", "link": "https://spaceflightnow.com/2023/03/12/crew-dragon-splashes-down-to-close-out-157-day-mission/", "date": "March 12, 2023", "description": "Two NASA astronauts, a Japanese space veteran and a Russian cosmonaut bid their seven space station crewmates farewell and returned to Earth Saturday night, splashing down in the Gulf of Mexico near Tampa after a fiery plunge back through the lower atmosphere. "}
{"title": "Relativity Space scrubs second launch attempt for Terran 1 rocket", "link": "https://spaceflightnow.com/2023/03/11/relativity-space-terran-1-glhf/", "date": "March 11, 2023", "description": "Relativity Space got within a half-second of launching its first 3D-printed Terran 1 rocket Saturday from Cape Canaveral, but the countdown aborted after engine startup and the startup aerospace company stood down from its second launch attempt. "}
{"title": "SpaceX capsule with four-person crew departs space station, heads for Earth", "link": "https://spaceflightnow.com/2023/03/11/spacex-capsule-with-four-person-crew-departs-space-station-heads-for-splashdown/", "date": "March 11, 2023", "description": "Closing out five months on the International Space Station, two NASA astronauts, a five-time Japanese space flier, and a Russian cosmonaut departed the complex Saturday inside a SpaceX Dragon crew capsule, heading for a parachute-assisted splashdown in the Gulf of Mexico around 19 hours later. "}
{"title": "Live coverage: Four-person space station returns to Earth", "link": "https://spaceflightnow.com/2023/03/11/crew-5-return-mission-status-center/", "date": "March 11, 2023", "description": "NASA commander Nicole Mann, pilot Josh Cassada, Japanese astronaut Koichi Wakata, and Russian cosmonaut Anna Kikina undocked from the International Space Station at 2:20 a.m. EST (0720 GMT) Saturday aboard SpaceX’s Dragon Endurance spacecraft. Wrapping up a five-month mission, the commercial crew capsule splashed down in the Gulf of Mexico off the coast of Florida at 9:02 p.m. EST Saturday (0202 GMT Sunday). "}
{"title": "Rocket Lab’s second launch from Virginia will loft two commercial radar satellites", "link": "https://spaceflightnow.com/2023/03/10/rocket-labs-second-launch-from-virginia-will-loft-two-commercial-radar-satellites/", "date": "March 10, 2023", "description": "Rocket Lab’s second mission from a new launch pad in Virginia is set to take off with two commercial radar remote sensing satellites for Capella Space. "}
{"title": "SpaceX launches and lands rocket on mission for OneWeb", "link": "https://spaceflightnow.com/2023/03/09/falcon-9-oneweb-17-coverage/", "date": "March 9, 2023", "description": "SpaceX launched a Falcon 9 rocket from Cape Canaveral Space Force Station Thursday with 40 more internet satellites for rival OneWeb, followed eight minutes later by the landing of the rocket’s first stage booster back at the Florida spaceport. "}
{"title": "Relativity Space scrubs first launch attempt", "link": "https://spaceflightnow.com/2023/03/08/relativity-space-scrubs-first-launch-attempt/", "date": "March 8, 2023", "description": "Relativity Space’s first launch countdown aborted about a minute before liftoff Wednesday at Cape Canaveral when sensors detected warmer-than-expected liquid oxygen on the Terran 1 rocket’s second stage, delaying until Saturday the first test flight of the 3D-printed launcher. "}
{"title": "Two launches for OneWeb this month will enable network’s global coverage", "link": "https://spaceflightnow.com/2023/03/08/two-more-launches-for-oneweb-this-month-will-enable-networks-global-coverage/", "date": "March 8, 2023", "description": "OneWeb is in the home stretch of a four-year launch campaign with two more missions — scheduled this week with SpaceX and later this month with NewSpace India Limited — set to give the company enough satellites to provide global internet coverage. "}
{"title": "Relativity Space ready to launch 3D-printed, methane-fueled orbital rocket", "link": "https://spaceflightnow.com/2023/03/08/relativity-space-terran-1-test-flight-1/", "date": "March 8, 2023", "description": "Relativity Space, a California-based startup that counts billionaire Mark Cuban as one of its early investors, is ready to launch the first 3D-printed, methane-fueled rocket into orbit from Cape Canaveral. "}
{"title": "Launch day timeline for Relativity Space’s Terran 1 rocket", "link": "https://spaceflightnow.com/2023/03/08/launch-day-timeline-for-relativity-spaces-terran-1-rocket/", "date": "March 8, 2023", "description": "Relativity Space’s 10-story-tall Terran 1 rocket will encounter the most extreme aerodynamic forces of its eight-minute test flight around 80 seconds after liftoff from Cape Canaveral. That’s a key moment when the company’s engineers hope to confirm the 3D-printed rocket can withstand the rigors of launch. "}
{"title": "Japan’s flagship H3 rocket fails on first test flight", "link": "https://spaceflightnow.com/2023/03/07/japans-flagship-h3-rocket-fails-on-first-test-flight/", "date": "March 7, 2023", "description": "Japan’s first H3 rocket, designed to launch satellites and resupply space stations, fell back to Earth Monday after its second stage engine failed to ignite five minutes into an inaugural test flight, destroying the rocket and a three-ton Earth observation spacecraft. "}
{"title": "Live coverage: Japan’s new H3 rocket fails to reach orbit", "link": "https://spaceflightnow.com/2023/03/06/h3-tf1-mission-status-center/", "date": "March 6, 2023", "description": "Japan’s new H3 rocket launched on its first test flight Monday at 8:37 p.m. EST (0137 GMT Tuesday), but faltered before reaching orbit when the second stage apparently failed to ignite about five minutes into the mission. The H3 rocket and Japan’s ALOS 3 land imaging satellite were destroyed in the failure. "}
{"title": "Weather forecast favorable for Relativity’s first orbital launch attempt", "link": "https://spaceflightnow.com/2023/03/06/weather-forecast-favorable-for-relativitys-first-orbital-launch-attempt/", "date": "March 6, 2023", "description": "Forecasters from the U.S. Space Force predict mostly sunny conditions at Cape Canaveral during a three-hour launch window Wednesday afternoon for the first flight of Relativity Space’s Terran 1 rocket. "}
{"title": "Japan’s new H3 rocket ready for another launch attempt after last-second abort", "link": "https://spaceflightnow.com/2023/03/05/japans-new-h3-rocket-ready-for-another-launch-attempt-after-last-second-abort/", "date": "March 5, 2023", "description": "After an electrical problem kept Japan’s first H3 rocket on the ground during a launch attempt last month, teams wheeled the new hydrogen-fueled launcher back to its firing stand for another countdown Monday to try to send an Earth observation satellite into orbit. "}
{"title": "SpaceX launches Starlink satellites from California after delays", "link": "https://spaceflightnow.com/2023/03/03/spacex-launches-starlink-satellites-from-california-after-delays/", "date": "March 3, 2023", "description": "SpaceX launched a Falcon 9 rocket with 51 more Starlink internet satellites from California on Friday after a delay of several days to wait for liftoff of a higher-priority crew mission from Florida. "}
{"title": "SpaceX capsule docks at space station with multinational crew", "link": "https://spaceflightnow.com/2023/03/03/spacex-capsule-docks-at-space-station-with-multinational-crew/", "date": "March 3, 2023", "description": "SpaceX’s Dragon Endeavour spacecraft linked up with the International Space Station Friday, delivering two NASA astronauts, an Emirati astronaut, and a Russian cosmonaut to the complex after a short delay for ground teams to uplink a software fix to mask a bad sensor on the capsule’s docking mechanism. "}
{"title": "Live coverage: SpaceX launches Starlink mission from California", "link": "https://spaceflightnow.com/2023/03/03/falcon-9-starlink-2-7-mission-status-center/", "date": "March 3, 2023", "description": "SpaceX launched of a Falcon 9 rocket Friday at 10:38 a.m. PST (1:38 p.m. EST; 1838 GMT) from Vandenberg Space Force Base in California, lofting 51 more Starlink internet satellites into orbit. "}
{"title": "SpaceX rocket boosts U.S.-Russian-Emirati crew into orbit", "link": "https://spaceflightnow.com/2023/03/02/spacex-rocket-boosts-u-s-russian-emirati-crew-into-orbit/", "date": "March 2, 2023", "description": "SpaceX launched a Falcon 9 rocket Thursday from Kennedy Space Center with a four-man crew heading for a six-month stay on the International Space Station, including the first Arab astronaut to fly on a long-duration space mission. "}
{"title": "Crew-6 mission timeline", "link": "https://spaceflightnow.com/2023/03/01/crew-6-mission-timeline/", "date": "March 1, 2023", "description": "This detailed mission timeline covers major vehicle and crew activities during the Crew-6 countdown, launch, and rendezvous with the International Space Station. "}
{"title": "Live coverage: Four-man crew docks at International Space Station", "link": "https://spaceflightnow.com/2023/03/01/spacex-crew-6-launch-mission-status-center-2/", "date": "March 1, 2023", "description": "SpaceX and NASA launched the Crew-6 mission to the International Space Station at 12:34 a.m. EST (0534 GMT) Thursday from Kennedy Space Center in Florida. A Falcon 9 rocket blasted off with two NASA astronauts, an astronaut from the United Arab Emirates, and a Russian cosmonaut to begin a six-month expedition in orbit. Docking at the International Space Station occurred at 1:40 a.m. EST (0640 GMT) Friday. "}
{"title": "SpaceX Crew Dragon poised for second launch attempt", "link": "https://spaceflightnow.com/2023/03/01/spacex-crew-dragon-poised-for-second-launch-attempt/", "date": "March 1, 2023", "description": "Running three days late because of a last-minute technical glitch, a four-man space station crew, including a Russian cosmonaut and the first Arab to be assigned to a long duration spaceflight, braced for a second launch try early Thursday atop a SpaceX Falcon 9 rocket. "}
{"title": "SpaceX launches first batch of second-generation Starlink internet satellites", "link": "https://spaceflightnow.com/2023/02/27/falcon-9-starlink-6-1-live-coverage/", "date": "February 27, 2023", "description": "SpaceX launched the first batch of next-generation Starlink internet satellites Monday from Cape Canaveral, deploying 21 bigger, heavier, more capable spacecraft to boost capacity for the global broadband network. "}
{"title": "SpaceX crew launch scrubbed after concern with engine ignitor system", "link": "https://spaceflightnow.com/2023/02/27/spacex-crew-launch-scrubbed-after-concern-with-engine-ignitor-system/", "date": "February 27, 2023", "description": "SpaceX scrubbed the launch from Florida of a four-man crew heading to the International Space Station early Monday with less than three minutes remaining in the countdown, delaying the start of a six-month mission to examine a problem with a ground system needed to ignite the Falcon 9 rocket’s main engines. "}
{"title": "Live coverage: SpaceX scrubs launch of four-man crew to space station", "link": "https://spaceflightnow.com/2023/02/27/spacex-crew-6-launch-mission-status-center/", "date": "February 27, 2023", "description": "SpaceX called off the launch a Falcon 9 rocket and Crew Dragon spacecraft at 1:45 a.m. EST (0645 GMT) from NASA’s Kennedy Space Center in Florida to evaluate an issue with the system used to ignite the rocket’s main engines. When it takes off, the mission will send two NASA astronauts, an Emirati astronaut, and a Russian cosmonaut on a six-month mission on the International Space Station. "}
{"title": "SpaceX unveils first batch of larger upgraded Starlink satellites", "link": "https://spaceflightnow.com/2023/02/26/spacex-unveils-first-batch-of-larger-upgraded-starlink-satellites/", "date": "February 26, 2023", "description": "SpaceX released the first photos of the company’s upgraded Starlink internet satellite design, with 21 of the heavier, higher-capacity internet satellites set to ride a Falcon 9 rocket into orbit from Cape Canaveral on Monday. "}
{"title": "SpaceX Crew Dragon poised for overnight launch to space station", "link": "https://spaceflightnow.com/2023/02/26/spacex-crew-dragon-poised-for-overnight-launch-to-space-station/", "date": "February 26, 2023", "description": "SpaceX is counting down to the deep overnight launch early Monday of a Falcon 9 rocket and Crew Dragon capsule carrying two NASA astronauts, a Russian cosmonaut and a history-making United Arab Emirates astronaut to the International Space Station. "}
{"title": "Unpiloted Soyuz spacecraft docks at space station to replace damaged crew capsule", "link": "https://spaceflightnow.com/2023/02/26/unpiloted-soyuz-spacecraft-docks-at-space-station-to-replace-damaged-crew-capsule/", "date": "February 26, 2023", "description": "A replacement for a damaged Russian Soyuz crew ferry spacecraft docked at the International Space Station Saturday night, two days after launching from Kazakhstan on a mission to give two Russian cosmonauts and a NASA astronaut a ride back to Earth later this year. "}
{"title": "Static fire test, dress rehearsal complete for Crew-6 launch", "link": "https://spaceflightnow.com/2023/02/24/static-fire-test-dress-rehearsal-complete-for-crew-6-launch/", "date": "February 24, 2023", "description": "Led by a three-time space shuttle flier and former Navy submarine officer, the four-man team set to ride into orbit Monday on SpaceX’s Dragon Endeavour spacecraft rode to the launch pad in Florida in new black Tesla Model Xs and took their seats inside the commercial crew capsule Thursday night for a countdown dress rehearsal. "}
{"title": "Officials give ‘go’ for Crew-6 mission after launch readiness review", "link": "https://spaceflightnow.com/2023/02/24/falcon-9-crew-6-preps-mission-status-center/", "date": "February 24, 2023", "description": "NASA and SpaceX officials gave the green light Saturday night to continue preparations for launch of the next crew mission to the International Space Station Monday from Kennedy Space Center in Florida. "}
{"title": "Replacement Soyuz launched on flight to space station", "link": "https://spaceflightnow.com/2023/02/24/replacement-soyuz-launched-on-fight-to-space-station/", "date": "February 24, 2023", "description": "A Russian Soyuz crew ferry ship blasted off from Kazakhstan Thursday, kicking off an unpiloted but critical flight to the International Space Station to replace a damaged Soyuz and provide an eventual ride home for three of the lab’s crew members. "}
{"title": "Live coverage: Replacement Soyuz arrives at space station", "link": "https://spaceflightnow.com/2023/02/23/soyuz-ms-23-mission-status-center/", "date": "February 23, 2023", "description": "Two months after a coolant leak disabled a Soyuz crew ferry spacecraft at the International Space Station, Russia’s space agency launched of a replacement vehicle from the Baikonur Cosmodrome in Kazakhstan Thursday, and the craft docked at the station at 7:58 p.m. EST Saturday (0058 GMT Sunday). The Soyuz MS-23 spacecraft launched without any people on-board, and will serve as a lifeboat and ride home for a three-man space station crew later this year. "}
{"title": "Photos: Falcon 9 and Crew Dragon roll out to pad 39A", "link": "https://spaceflightnow.com/2023/02/23/photos-falcon-9-and-crew-dragon-roll-out-to-pad-39a-3/", "date": "February 23, 2023", "description": "SpaceX transported a Falcon 9 rocket with the Crew Dragon Endeavour spacecraft to pad 39A on Wednesday, Feb. 22, for final preparations to carry a four-man crew to the International Space Station on NASA’s Crew-6 mission. "}
{"title": "SpaceX postpones Starlink launch as NASA crew mission takes priority", "link": "https://spaceflightnow.com/2023/02/22/spacex-postpones-starlink-launch-as-nasa-crew-mission-takes-priority/", "date": "February 22, 2023", "description": "SpaceX has postponed the launch of another batch of Starlink internet satellites from Thursday as the company’s team in Florida prioritizes preparations for the launch of a four-man next week bound for the International Space Station. "}
{"title": "Relativity sets launch date for first flight of Terran 1 rocket", "link": "https://spaceflightnow.com/2023/02/22/relativity-sets-launch-date-for-first-flight-of-terran-1-rocket/", "date": "February 22, 2023", "description": "Relativity Space plans to skip a final test-firing of its first fully stacked Terran 1 rocket at Cape Canaveral and proceed with a launch attempt March 8 for the methane-fueled, 3D-printed launcher, the company said Wednesday. "}
{"title": "Multinational crew arrives at Kennedy Space Center for launch preparations", "link": "https://spaceflightnow.com/2023/02/21/multinational-crew-arrives-at-kennedy-space-center-for-launch-preparations/", "date": "February 21, 2023", "description": "Two NASA astronauts, a Russian cosmonaut and an Emirati flew to the Kennedy Space Center Tuesday to begin preparations for launch early Monday on a SpaceX Crew Dragon flight to replace four crew members aboard the International Space Station who are wrapping up a five-month stay. "}
{"title": "Russia blames Progress leak on ‘external influences’ as new Soyuz preps for launch", "link": "https://spaceflightnow.com/2023/02/21/russia-blames-progress-coolant-leak-on-external-influences-as-replacement-soyuz-rolls-to-launch-pad/", "date": "February 21, 2023", "description": "Russia’s space agency said Tuesday that preliminary data suggest a coolant leak on a Progress cargo freighter docked at the International Space Station earlier this month was caused by “external influences” — possibly something that occurred during its launch last year, according to a senior NASA space station manager. "}
{"title": "SpaceX completes Friday doubleheader with launch for Inmarsat", "link": "https://spaceflightnow.com/2023/02/17/falcon-9-inmarsat-6-f2-coverage/", "date": "February 17, 2023", "description": "SpaceX completed a launch doubleheader Friday night with the liftoff of a Falcon 9 rocket from Cape Canaveral carrying a dual-band, six-ton mobile communications relay station for London-based Inmarsat, hours after launching another Falcon 9 from California with a batch of Starlink internet satellites. "}
{"title": "Russian cargo ship departs space station after coolant leak", "link": "https://spaceflightnow.com/2023/02/17/progress-ms-21-undock/", "date": "February 17, 2023", "description": "Russian cosmonauts took pictures of the location where coolant leaked out of a Russian Progress cargo ship earlier this month when the supply freighter departed the International Space Station Friday night, as scheduled, to head for a destructive re-entry over the Pacific Ocean. "}
{"title": "Falcon 9 launch from California adds 51 more satellites to Starlink network", "link": "https://spaceflightnow.com/2023/02/17/falcon-9-launch-from-california-adds-51-more-satellites-to-starlink-network/", "date": "February 17, 2023", "description": "A Falcon 9 rocket delivered 51 more Starlink internet satellites into orbit Friday after launching from Vandenberg Space Force Base in California, adding to SpaceX’s global broadband network that reaches all seven continents. "}
{"title": "First launch of Japan’s H3 rocket aborted moments before liftoff", "link": "https://spaceflightnow.com/2023/02/17/first-launch-of-japans-h3-rocket-aborted-moments-before-liftoff/", "date": "February 17, 2023", "description": "Japan’s first H3 rocket, nearly a decade in development, was moments from liftoff Thursday (U.S. time) when the launch vehicle detected a problem and cut off the countdown just before sending a command to ignite two strap-on solid-fueled boosters. "}
{"title": "Live coverage: SpaceX launches 51 more Starlink satellites", "link": "https://spaceflightnow.com/2023/02/17/falcon-9-starlink-2-5-mission-status-center/", "date": "February 17, 2023", "description": "SpaceX teams in California launched a Falcon 9 launch from Vandenberg Space Force Base at 11:12 a.m. PST (2:12 p.m. EST; 1912 GMT) carrying 51 more Starlink internet satellites into orbit. "}
{"title": "Inmarsat satellite poised to provide connectivity over Atlantic Ocean", "link": "https://spaceflightnow.com/2023/02/16/inmarsat-satellite-poised-to-provide-connectivity-over-atlantic-ocean/", "date": "February 16, 2023", "description": "A large European-built communications satellite owned by London-based Inmarsat is set to ride a SpaceX Falcon 9 rocket into orbit Friday night from Cape Canaveral, kicking off a mission to connect ships and airplanes across the Atlantic Ocean and the U.S. East Coast through 2040. "}
{"title": "Japan’s new H3 rocket ready for first test flight", "link": "https://spaceflightnow.com/2023/02/16/h3-test-flight-1-preview/", "date": "February 16, 2023", "description": "Japan is set to test its new flagship launch vehicle, the H3, with a demonstration flight Thursday night from the Tanegashima Space Center, debuting a rocket that is less expensive, more capable, and more flexible than the country’s previous generation of launchers. "}
{"title": "Mars rover completes first sample storage depot", "link": "https://spaceflightnow.com/2023/02/14/mars-rover-completes-first-sample-storage-depot/", "date": "February 14, 2023", "description": "NASA’s Perseverance rover on Mars has cooly notched up another significant first by creating the first ever storage depot on another world for Martian soil samples. But if the rover’s mission goes to plan and it continues to operate as scheduled, the cached samples could be left on the Martian surface forever. "}
{"title": "Russia delays next Soyuz launch pending assessment of coolant leaks", "link": "https://spaceflightnow.com/2023/02/13/russia-delays-next-soyuz-launch-pending-assessment-of-coolant-leaks/", "date": "February 13, 2023", "description": "Launch of a Russian Soyuz crew capsule to replace a damaged ferry ship docked at the International Space Station is being delayed in the wake of a second incident that resulted in similar damage to a Progress cargo ship, a senior official said Monday. "}
{"title": "India’s Small Satellite Launch Vehicle successful on second test flight", "link": "https://spaceflightnow.com/2023/02/12/indias-small-satellite-launch-vehicle-successful-on-second-test-flight/", "date": "February 12, 2023", "description": "The second test flight of India’s Small Satellite Launch Vehicle was successful Feb. 10, delivering Indian and U.S.-owned payloads into orbit after the new rocket’s first demonstration mission ended in failure last year. "}
{"title": "SpaceX breaks launch pad turnaround record with midnight mission", "link": "https://spaceflightnow.com/2023/02/11/falcon-9-starlink-5-4-coverage/", "date": "February 11, 2023", "description": "A SpaceX Falcon 9 rocket hauled 55 more Starlink internet satellites into orbit just after midnight Sunday from Cape Canaveral, breaking a record for the shortest time between missions — five days — from the same SpaceX launch pad. "}
{"title": "Russian cargo ship docks as second Progress suffers sudden loss of coolant", "link": "https://spaceflightnow.com/2023/02/11/russian-cargo-ship-docks-as-second-progress-suffers-depressurization-of-coolant-loop/", "date": "February 11, 2023", "description": "A Russian Progress supply ship successfully docked with the International Space Station early Saturday but in an unlikely, presumed coincidence, another Progress, docked at a different port, suffered a sudden loss of coolant similar to an incident that disabled a Soyuz crew ship in December. "}
{"title": "SpaceX test-fires 31 engines on Starship’s gigantic Super Heavy booster", "link": "https://spaceflightnow.com/2023/02/09/spacex-test-fires-31-engines-on-starships-gigantic-super-heavy-booster/", "date": "February 9, 2023", "description": "In a significant milestone preparing for liftoff of the world’s most powerful rocket, SpaceX test-fired 31 of the booster’s 33 methane-fueled engines Thursday in South Texas as the company eyes a launch attempt as soon as March. "}
{"title": "Russian Progress resupply ship launches on flight to space station", "link": "https://spaceflightnow.com/2023/02/09/soyuz-progress-ms-22-launch/", "date": "February 9, 2023", "description": "A Russian Soyuz rocket blasted off Thursday from the Baikonur Cosmodrome in Kazakhstan, boosting a Progress resupply ship into orbit in pursuit of the International Space Station with more than 5,500 pounds of cargo, fuel, water, and air. "}
{"title": "Russian weather satellite deployed in geostationary orbit", "link": "https://spaceflightnow.com/2023/02/09/russian-weather-satellite-deployed-in-geostationary-orbit/", "date": "February 9, 2023", "description": "Russia launched a geostationary weather satellite Feb. 5 on a Proton rocket, heading for a position more than 22,000 miles over the Pacific Ocean to cover Russia’s Far East and the wider Asia-Pacific region. "}
{"title": "SpaceX ready for 33-engine test of Starship’s Super Heavy booster", "link": "https://spaceflightnow.com/2023/02/08/spacex-ready-for-33-engine-test-firing-of-starships-super-heavy-booster/", "date": "February 8, 2023", "description": "SpaceX is gearing up for the first full-up test-firing Thursday of all 33 engines on the booster for the company’s Starship mega-rocket in Texas, a critical milestone on the path to launching the giant vehicle on its first orbital test flight, which could happen as soon as March if this week’s test goes well. "}
{"title": "SpaceX launches communications satellite for Spain’s Hispasat", "link": "https://spaceflightnow.com/2023/02/06/falcon-9-amazonas-nexus-coverage/", "date": "February 6, 2023", "description": "SpaceX launched a Falcon 9 rocket Monday night from Cape Canaveral with Amazonas Nexus, a powerhouse satellite owned by the Spanish company Hispasat to connect trans-Atlantic airline passengers, maritime traffic, and rural communities across the Americas. "}
{"title": "Spanish-owned communications satellite ready for launch from Cape Canaveral", "link": "https://spaceflightnow.com/2023/02/04/spanish-owned-communications-satellite-ready-for-weekend-launch/", "date": "February 4, 2023", "description": "A nearly five-ton satellite for the Spanish company Hispasat is ready for liftoff from Cape Canaveral Monday aboard a SpaceX Falcon 9 rocket, beginning a mission to provide in-flight internet and other communications services over the Americas and the Atlantic Ocean. "}
{"title": "Space station astronauts finish preps for next pair of new solar arrays", "link": "https://spaceflightnow.com/2023/02/02/iss-us-eva-85/", "date": "February 2, 2023", "description": "Continuing work left over from a spacewalk last month, astronauts Nicole Mann and Koichi Wakata headed outside the International Space Station Thursday to finish installing a mounting bracket for new solar arrays due to arrive at the complex on a SpaceX resupply mission in June. "}
{"title": "SpaceX launches 53 more Starlink internet satellites", "link": "https://spaceflightnow.com/2023/02/02/falcon-9-starlink-5-3-coverage/", "date": "February 2, 2023", "description": "A Falcon 9 rocket launched from Kennedy Space Center in Florida early Thursday with 53 more Starlink satellites for SpaceX’s global internet network. "}
{"title": "20 years after Columbia disaster, lessons learned still in sharp focus at NASA", "link": "https://spaceflightnow.com/2023/02/01/20-years-after-columbia-disaster-lessons-learned-still-in-sharp-focus-at-nasa/", "date": "February 1, 2023", "description": "Twenty years ago, the space shuttle Columbia broke apart high over Texas on the way to landing in Florida, killing a crew of seven astronauts in a tragedy with long-lasting consequences that still reverberate across the space program. "}
{"title": "Starlink satellites, Italian space tug launched by SpaceX rocket", "link": "https://spaceflightnow.com/2023/01/31/starlink-satellites-italian-space-tug-launched-by-spacex-rocket/", "date": "January 31, 2023", "description": "SpaceX launched a Falcon 9 rocket Tuesday from California’s Central Coast with 49 Starlink internet satellites and a rideshare space tug for the Italian company D-Orbit, itself carrying tech demo experiments and cremated human remains for customers in the United States, Germany, New Zealand, and Switzerland. "}
{"title": "Live coverage: SpaceX launches Falcon 9 rocket from California", "link": "https://spaceflightnow.com/2023/01/31/falcon-9-starlink-2-6-mission-status-center/", "date": "January 31, 2023", "description": "SpaceX launched a Falcon 9 rocket Tuesday with 49 Starlink internet satellites and a rideshare payload for the Italian company D-Orbit. Liftoff from Vandenberg Space Force Base in California occurred at 8:15 a.m. PST (11:15 a.m. EST; 1615 GMT) after delays over the last two days to allow SpaceX to complete pre-launch preparations on the vehicle. "}
{"title": "H-2A rocket launches Japanese radar spy satellite", "link": "https://spaceflightnow.com/2023/01/26/h-2a-rocket-launches-japanese-radar-spy-satellite/", "date": "January 26, 2023", "description": "Japan launched a government spacecraft Jan. 25 on an H-2A rocket, adding a new radar platform to the country’s spy satellite fleet for all-weather, day-and-night surveillance. "}
{"title": "SpaceX launches heaviest payload on Falcon 9 rocket", "link": "https://spaceflightnow.com/2023/01/26/falcon-9-starlink-5-2-coverage/", "date": "January 26, 2023", "description": "A Falcon 9 rocket thundered off a launch pad at Cape Canaveral before dawn Thursday with another batch of 56 Starlink satellites, setting a record for the heaviest payload ever launched on a SpaceX rocket at more than 38,000 pounds. "}
{"title": "Rocket Lab primed for busy year after first launch from Virginia", "link": "https://spaceflightnow.com/2023/01/24/rocket-lab-primed-for-busy-year-after-first-launch-from-virginia/", "date": "January 24, 2023", "description": "Rocket Lab’s first mission from a launch pad in Virginia delivered three small commercial satellites into orbit Tuesday night, starting what the company hopes will be a banner year with at least 15 flights from the new U.S. launch site and a spaceport in New Zealand. "}
{"title": "Live coverage: Rocket Lab launches first mission from Virginia", "link": "https://spaceflightnow.com/2023/01/24/electron-virginia-is-for-launch-lovers-mission-status-center/", "date": "January 24, 2023", "description": "Rocket Lab launched its first mission from a new launch site in Virginia Tuesday. The company’s small satellite launcher took off from Virginia’s Eastern Shore at 6 p.m. EST (2300 GMT), carrying three small commercial satellites into orbit for HawkEye 360. "}
{"title": "Another countdown begins for Rocket Lab’s first launch from Virginia", "link": "https://spaceflightnow.com/2023/01/23/another-countdown-begins-for-rocket-labs-first-launch-from-virginia/", "date": "January 23, 2023", "description": "Rocket Lab is set to fill up its small Electron launcher with propellant fire it into space from Virginia Tuesday evening with three commercial satellites, the company’s second try to launch its first mission from U.S. soil after bad weather thwarted attempts last month. "}
