{"title": "Super Heavy-Starship climbs high but falls short on second test flight", "link": "https://spaceflightnow.com/2023/11/18/super-heavy-starship-climbs-high-but-falls-short-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX’s gargantuan Super Heavy-Starship, the most powerful rocket ever built, blasted off on its second test flight Saturday and while the initial stages of the mission went smoothly, the first stage broke apart moments after separation from the Starship upper stage, which then blew itself up as it neared space. "}
{"title": "Live Coverage: SpaceX to launch Starship/Super Heavy Booster on second test flight", "link": "https://spaceflightnow.com/2023/11/18/live-coverage-spacex-to-launch-starship-super-heavy-booster-on-second-test-flight/", "date": "November 18, 2023", "description": "SpaceX is counting down for the second test flight of its mammoth Starship launch vehicle. Liftoff from Starbase in Texas is scheduled for 7 a.m. CST / 8 a.m. EST (1300 UTC). If all goes according to plan the Starship will travel around the world before splashing down in the Pacific near Hawaii. "}
{"title": "SpaceX launches Falcon 9 rocket from Cape Canaveral with 23 Starlink satellites", "link": "https://spaceflightnow.com/2023/11/18/live-coverage-spacex-to-launch-falcon-9-rocket-from-cape-canaveral-with-23-starlink-satellites/", "date": "November 18, 2023", "description": "A Falcon 9 rocket is to launch tonight with another batch of satellites for SpaceX’s Starlink internet service. Liftoff from pad 40 at Cape Canaveral Space Force Station occurred at 11:15 p.m. EDT (0415 UTC). "}
{"title": "FAA clears SpaceX for second Super Heavy-Starship test flight", "link": "https://spaceflightnow.com/2023/11/16/faa-clears-spacex-for-second-super-heavy-starship-test-flight/", "date": "November 16, 2023", "description": "SpaceX’s huge Super Heavy-Starship rocket has been cleared for a second test flight in an attempt to boost the unpiloted Starship upper stage into space for the first time, the company announced Wednesday. On Thursday Elon Musk announced the launch has slipped to Saturday to replace a grid fin actuator. "}
{"title": "SpaceX Falcon 9 rocket launches 3rd pair of O3b mPOWER satellites from Cape Canaveral", "link": "https://spaceflightnow.com/2023/11/12/live-coverage-spacex-falcon-9-rocket-to-launch-3rd-pair-of-o3b-mpower-satellites-from-cape-canaveral/", "date": "November 12, 2023", "description": "The launch of the SES O3b mPOWER satellites a day after the Transporter-9 rideshare mission from California. The Boeing-built O3b mPOWER 5&6 satellites launched from Space Launch Complex 40 (SLC-40) at the start of the 89-minute window that opened at 4:08 p.m. EST (2108 UTC). "}
{"title": "SpaceX launches more than a hundred payloads on Falcon 9 mission from Vandenberg", "link": "https://spaceflightnow.com/2023/11/11/live-coverage-spacex-to-launch-90-payloads-on-transporter-9-falcon-9-mission-from-vandenberg/", "date": "November 11, 2023", "description": "A SpaceX Falcon 9 launched from Vandenberg Space Force Base in California on a rideshare mission to low Earth orbit with a multitude of small payloads. The Transporter-9 mission lifted off into a clear blue sky at 10:49 a.m. PST (18:49 UTC)."}
{"title": "SpaceX launches Dragon cargo ship to space station", "link": "https://spaceflightnow.com/2023/11/10/spacex-launches-dragon-cargo-ship-to-space-station/", "date": "November 10, 2023", "description": "Lighting up the night sky, a SpaceX Falcon 9 rocket streaked into orbit in spectacular fashion Thursday, kicking off a 32-hour rendezvous with the International Space Station to deliver 6,500 pounds of research gear, crew supplies and needed equipment. "}
{"title": "SpaceX launches Falcon 9 rocket on 29th resupply mission to the Space Station", "link": "https://spaceflightnow.com/2023/11/09/live-coverage-spacex-to-launch-falcon-9-rocket-on-29th-resupply-mission-to-the-space-station/", "date": "November 9, 2023", "description": "Rodents, water filters and a laser relay are among the 6,500 pounds of science and equipment that will launch to the International Space Station on Thursday evening. A Falcon 9 rocket launched carrying a SpaceX Cargo Dragon at 8:28 p.m. EST (0128 UTC on Nov. 10) from Launch Complex 39A at NASA’s Kennedy Space Center. "}
{"title": "U.S. military’s X-37B  mini-shuttle to launch on SpaceX Falcon Heavy for the first time", "link": "https://spaceflightnow.com/2023/11/09/u-s-militarys-x-37b-mini-shuttle-to-launch-on-spacex-falcon-heavy-for-the-first-time/", "date": "November 9, 2023", "description": "The U.S. military’s experimental spaceplane will soon soar to orbit using a SpaceX Falcon Heavy rocket for the first time, a Pentagon news release announced. The X-37B spacecraft will launch from the Kennedy Space Center no earlier than December 7. "}
{"title": "Capitol Hill budget battle may limit initial funding of some National Security Space Launch missions", "link": "https://spaceflightnow.com/2023/11/08/capitol-hill-budget-battle-may-limit-initial-funding-of-some-national-security-space-launch-missions/", "date": "November 8, 2023", "description": "Among the 21 missions set to be ordered in the fifth year of Phase 2 task orders, only eight are anticipated to be ordered under a continuing resolution. "}
